-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /hpc/group/econ/tmr17/Dropout-R1/src/data-cleaning/nlsy97/y97_crea
> te_trim_tscrGPA.log
  log type:  text
 opened on:  13 Apr 2023, 12:59:49

. 
. global rawloc ../../../data/nlsy97/raw/

. global clnloc ../../../data/nlsy97/cleaned/

. global tabloc ../../../exhibits/tables/

. use ${rawloc}y97_master.dta

. drop GPA

. ren tscriptGPA GPA

. 
. keep if inrange(year,1997,2015)
(161,712 observations deleted)

. gen anyFlag = 0

. gen anyFlagFemale = 0

. *=================================================
. * Frequency stats and droppings
. *=================================================
. * create .tex table with data creation steps
. file open appendix using "${tabloc}dataAppendix_tscrGPA.tex", write replace

. file write appendix "\begin{landscape} "_n 

. file write appendix "\begin{table} "_n 

. file write appendix "\caption{Sample Selection} "_n 

. file write appendix "\centering{}\label{tab:Sample Selection}% "_n 

. file write appendix "\resizebox{1.3\textwidth}{!}{ "_n 

. file write appendix "\begin{threeparttable} "_n 

. file write appendix "\begin{tabular}{lcc} "_n 

. file write appendix "\toprule "_n 

. file write appendix "Selection criterion                                     
>                            & Resultant persons & Resultant person-years\\ "_n
>  

. file write appendix "\midrule  "_n 

. 
. xtset ID year
       panel variable:  ID (strongly balanced)
        time variable:  year, 1997 to 2015
                delta:  1 unit

. xtsum ID

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4504.302   2602.999          1       9022 |     N =  170696
         between |             2603.136          1       9022 |     n =    8984
         within  |                    0   4504.302   4504.302 |     T =      19

. file write appendix "Full NLSY97 sample                                      
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. 
. * drop females
. replace anyFlag = 1 if female==1
(83,315 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4464.712   2605.868          2       9021 |     N =   87381
         between |             2606.137          2       9021 |     n =    4599
         within  |                    0   4464.712   4464.712 |     T =      19

. file write appendix "Drop women                                              
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4504.302   2602.999          1       9022 |     N =  170696
         between |             2603.136          1       9022 |     n =    8984
         within  |                    0   4504.302   4504.302 |     T =      19

. 
. * drop mixed race
. drop race

. gen race = .
(170,696 missing values generated)

. replace race = 1 if white==1
(88,635 real changes made)

. replace race = 2 if black==1
(44,365 real changes made)

. replace race = 3 if hispanic==1
(36,119 real changes made)

. replace race = 4 if mixed==1
(1,577 real changes made)

. label define vlrace_true 1 "White" 2 "Black" 3 "Hispanic" 4 "Mixed"

. lab val race vlrace_true

. replace anyFlag = 1 if mixed==1
(760 real changes made)

. replace anyFlagFemale = 1 if mixed==1
(1,577 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4476.745   2608.103          2       9021 |     N =   86621
         between |             2608.374          2       9021 |     n =    4559
         within  |                    0   4476.745   4476.745 |     T =      19

. file write appendix "Drop other race                                         
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4515.107    2605.49          1       9022 |     N =  169119
         between |             2605.629          1       9022 |     n =    8901
         within  |                    0   4515.107   4515.107 |     T =      19

. 
. * drop missing AFQT
. replace anyFlag = 1 if m_afqt==1 & (mi(SATmath) | mi(SATverb))
(14,630 real changes made)

. replace anyFlagFemale = 1 if m_afqt==1 & (mi(SATmath) | mi(SATverb))
(26,087 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4444.691   2586.105          2       9021 |     N =   71991
         between |             2586.428          2       9021 |     n =    3789
         within  |                    0   4444.691   4444.691 |     T =      19

. file write appendix "Drop missing AFQT and SAT test scores                   
>                             &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4504.684   2582.243          1       9022 |     N =  143032
         between |             2582.406          1       9022 |     n =    7528
         within  |                    0   4504.684   4504.684 |     T =      19

. 
. * drop missing family income
. replace anyFlag = 1 if m_famIncAsTeen==1
(10,602 real changes made)

. replace anyFlagFemale = 1 if m_famIncAsTeen==1
(21,413 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |    4468.6   2536.996          2       9021 |     N =   61389
         between |             2537.368          2       9021 |     n =    3231
         within  |                    0     4468.6     4468.6 |     T =      19

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4508.485   2539.767          1       9022 |     N =  121619
         between |             2539.955          1       9022 |     n =    6401
         within  |                    0   4508.485   4508.485 |     T =      19

. 
. * drop missing HS grades
. replace anyFlag = 1 if m_Grades_HS_best==1
(1,216 real changes made)

. replace anyFlagFemale = 1 if m_Grades_HS_best==1
(2,508 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4469.911   2534.383          2       9021 |     N =   60173
         between |             2534.762          2       9021 |     n =    3167
         within  |                    0   4469.911   4469.911 |     T =      19

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4504.372   2536.701          1       9021 |     N =  119111
         between |             2536.893          1       9021 |     n =    6269
         within  |                    0   4504.372   4504.372 |     T =      19

. 
. * drop missing parental education
. replace anyFlag = 1 if m_Peduc==1
(2,052 real changes made)

. replace anyFlagFemale = 1 if m_Peduc==1
(4,522 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4456.199   2523.523          2       9021 |     N =   58121
         between |             2523.914          2       9021 |     n =    3059
         within  |                    0   4456.199   4456.199 |     T =      19

. file write appendix "Drop missing HS grades, Parental education, or Parental 
> income                     &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4477.181   2525.686          1       9021 |     N =  114589
         between |             2525.885          1       9021 |     n =    6031
         within  |                    0   4477.181   4477.181 |     T =      19

. 
. * drop HS dropouts and GED recipients
. replace anyFlag = 1 if HS_dropout==1 | ever_grad_GED==1
(12,312 real changes made)

. replace anyFlagFemale = 1 if HS_dropout==1 | ever_grad_GED==1
(20,976 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4298.625   2512.559          2       9021 |     N =   45809
         between |             2513.053          2       9021 |     n =    2411
         within  |                    0   4298.625   4298.625 |     T =      19

. file write appendix "Drop HS Dropouts and GED recipients                     
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4366.858    2515.76          1       9021 |     N =   93613
         between |             2516.002          1       9021 |     n =    4927
         within  |                    0   4366.858   4366.858 |     T =      19

. 
. * drop obs before HS graduation
. gen lateHSFlag = year*(in_secondary_school==1)

. recode lateHSFlag (0 = .)
(lateHSFlag: 142090 changes made)

. bys ID (year): egen firstLateHSFlag = max(lateHSFlag)
(9576 missing values generated)

. recode firstLateHSFlag (0 = .)
(firstLateHSFlag: 0 changes made)

. replace anyFlag = 1 if year<firstLateHSFlag
(6,612 real changes made)

. replace anyFlag = 1 if year<HS_year
(3,136 real changes made)

. replace anyFlag = 1 if choice15==-1
(58 real changes made)

. replace anyFlagFemale = 1 if year<firstLateHSFlag
(13,195 real changes made)

. replace anyFlagFemale = 1 if year<HS_year
(6,098 real changes made)

. replace anyFlagFemale = 1 if choice15==-1
(131 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4257.375   2515.032          2       9021 |     N =   36003
         between |             2509.918          2       9021 |     n =    2331
         within  |                    0   4257.375   4257.375 | T-bar = 15.4453

. file write appendix "Drop observations before HS graduation                  
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4335.795   2517.051          1       9021 |     N =   74189
         between |             2514.622          1       9021 |     n =    4778
         within  |                    0   4335.795   4335.795 | T-bar = 15.5272

. 
. * drop right-censored missing interview spells
. replace anyFlag = 1 if missIntLastSpell==1
(455 real changes made)

. replace anyFlagFemale = 1 if missIntLastSpell==1
(848 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4260.196   2515.925          2       9021 |     N =   35548
         between |             2509.918          2       9021 |     n =    2331
         within  |                    0   4260.196   4260.196 | T-bar = 15.2501

. file write appendix "Drop right-censored missing interview spells            
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4339.688   2517.832          1       9021 |     N =   73341
         between |             2514.622          1       9021 |     n =    4778
         within  |                    0   4339.688   4339.688 | T-bar = 15.3497

. 
. * drop all future observations for those who return to school after graduatio
> n
. gen repeaterFlag = year*(grad_4yr==1 & inlist(choice15,-2,1,2,3,4,5,6,7,8,9))

. recode repeaterFlag (0 = .)
(repeaterFlag: 169707 changes made)

. bys ID (year): egen firstRepeaterFlag = min(repeaterFlag)
(160797 missing values generated)

. recode firstRepeaterFlag (0 = .)
(firstRepeaterFlag: 0 changes made)

. replace anyFlag = 1 if year>=firstRepeaterFlag
(1,270 real changes made)

. replace anyFlagFemale = 1 if year>=firstRepeaterFlag
(3,417 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4266.733   2517.505          2       9021 |     N =   34278
         between |             2509.918          2       9021 |     n =    2331
         within  |                    0   4266.733   4266.733 | T-bar = 14.7053

. file write appendix "Drop any who attend college at a young age or graduate c
> ollege in 2 or fewer years &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4345.854   2514.077          1       9021 |     N =   69924
         between |             2514.622          1       9021 |     n =    4778
         within  |                    0   4345.854   4345.854 | T-bar = 14.6346

. 
. * drop all future observations for those who attend graduate school before gr
> aduation
. gen earlyGSFlag = year*(in_grad_school==1 & grad_4yr==0)

. recode earlyGSFlag (0 = .)
(earlyGSFlag: 170624 changes made)

. bys ID (year): egen firstEarlyGSFlag = min(earlyGSFlag)
(169993 missing values generated)

. recode firstEarlyGSFlag (0 = .)
(firstEarlyGSFlag: 0 changes made)

. replace anyFlag = 1 if year>=firstEarlyGSFlag
(92 real changes made)

. replace anyFlagFemale = 1 if year>=firstEarlyGSFlag
(160 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4267.582   2517.643          2       9021 |     N =   34186
         between |             2509.918          2       9021 |     n =    2331
         within  |                    0   4267.582   4267.582 | T-bar = 14.6658

. file write appendix "Drop any who are not in HS at age 15 or under or have ot
> her outlying data          &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4346.216   2514.494          1       9021 |     N =   69764
         between |             2514.622          1       9021 |     n =    4778
         within  |                    0   4346.216   4346.216 | T-bar = 14.6011

. 
. * drop observations for those who graduate HS after age 20
. bys ID (year): gen ageGradHSA = age_now if grad_Diploma==1 & grad_Diploma[_n-
> 1]==0
(164,022 missing values generated)

. bys ID (year): egen ageGradHS = mean(ageGradHSA)
(43890 missing values generated)

. replace anyFlag = 1 if inrange(ageGradHS,21,.) | mi(ageGradHS)
(361 real changes made)

. replace anyFlagFemale = 1 if inrange(ageGradHS,21,.) | mi(ageGradHS)
(714 real changes made)

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4263.621   2515.416          2       9021 |     N =   33825
         between |             2508.058          2       9021 |     n =    2301
         within  |                    0   4263.621   4263.621 | T-bar = 14.7001

. file write appendix "Drop any who graduate HS after age 20                   
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. xtsum ID if anyFlagFemale==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4346.037   2512.834          1       9021 |     N =   69050
         between |              2513.17          1       9021 |     n =    4718
         within  |                    0   4346.037   4346.037 | T-bar = 14.6354

. 
. *=================================================
. * Rename age variables
. *=================================================
. drop age

. gen age = age_now-18

. drop age_now

. 
. *=================================================
. * Generate experience variables for descriptives
. *=================================================
. gen exper_postgrad     = 0

. gen exper_white_collar = 0

. 
. * Running cumulative choice variables
. bys ID (year): generat cum_2yr              = sum(L.in_2yr)

. bys ID (year): generat cum_4yr              = sum(L.in_4yr)

. bys ID (year): generat cum_college          = sum(L.in_college)

. bys ID (year): generat experFT              = sum(L.workFT)

. bys ID (year): generat experPT              = sum(L.workPT)

.                generat exper                = experFT+.5*experPT

. bys ID (year): generat cum_grad_school      = sum(L.in_grad_school)

. bys ID (year): generat experFT_postgrad     = sum(L.workFT) if grad_4yr==1
(148,393 missing values generated)

. bys ID (year): generat experPT_postgrad     = sum(L.workPT) if grad_4yr==1
(148,393 missing values generated)

.                replace exper_postgrad       = experFT_postgrad+.5*experPT_pos
> tgrad if grad_4yr==1
(20,711 real changes made)

. bys ID (year): generat experFT_white_collar = sum((L.workFT==1)*(L.whiteColla
> r==1))

. bys ID (year): generat experPT_white_collar = sum((L.workPT==1)*(L.whiteColla
> r==1))

.                replace exper_white_collar   = experFT_white_collar+.5*experPT
> _white_collar
(40,584 real changes made)

. drop experFT experPT experFT_postgrad experPT_postgrad experFT_white_collar e
> xperPT_white_collar

. 
. *=================================================
. * Generate previous decision dummies
. *=================================================
. gen prev_WC = 0

. gen prev_BC = 0

. 
. bys ID (year): generat prev_HS  = L.in_secondary_school==1

. bys ID (year): generat prev_2yr = L.in_2yr
(8,984 missing values generated)

. bys ID (year): generat prev_4yr = L.in_4yr
(8,984 missing values generated)

. bys ID (year): generat prev_PT  = L.workPT
(8,984 missing values generated)

. bys ID (year): generat prev_FT  = L.workFT
(8,984 missing values generated)

. bys ID (year): replace prev_WC  = L.whiteCollar==1 & (L.workPT==1 | L.workFT=
> =1)
(17,791 real changes made)

. bys ID (year): replace prev_BC  = L.whiteCollar==0 & (L.workPT==1 | L.workFT=
> =1)
(68,461 real changes made)

. bys ID (year): generat prev_GS  = L.in_grad_school
(8,984 missing values generated)

. 
. 
. *=================================================
. * Table summarizing wage cleaning steps
. *=================================================
. * create .tex table with wage cleaning steps
. file open wageappdx using "${tabloc}wageAppendix_tscrGPA.tex", write replace

. file write wageappdx "\begin{table} "_n 

. file write wageappdx "\caption{Steps taken to mitigate number of missing wage
>  observations} "_n 

. file write wageappdx "\centering{}\label{tab:wageselection}% "_n 

. file write wageappdx "\begin{threeparttable} "_n 

. file write wageappdx "\begin{tabular}{p{0.25in}p{3in}cc} "_n 

. file write wageappdx "\toprule "_n 

. file write wageappdx "\multicolumn{2}{l}{Description} & Person-years & Percen
> tage missing \\ "_n 

. file write wageappdx "\midrule  "_n 

. 
. * initial number of employment observations
. qui count if ~anyFlag &                     (weeks_worked_Oct>=4) & inrange(a
> vgHrsOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)

. global numworkobs = `r(N)'

. file write wageappdx "\multicolumn{2}{l}{Employed part- or full-time in preli
> minary sample\tnote{a}} &" %7.0fc (`r(N)') "& --- \\ "  _n

. * initial number of employment observations with missing wages
. qui count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(a
> vgHrsOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)

. global initmisswage = `r(N)'

. file write wageappdx "\multicolumn{2}{l}{Initial number with missing wages} &
> " %7.0fc (`r(N)') " & " %4.2f (`=100*`r(N)'/${numworkobs}') " \\ "  _n

. file write wageappdx "\multicolumn{2}{l}{Interpolation and imputation process
> :} && \\ "  _n

. 
. 
. 
. *=================================================
. * Clean up wages (i.e. interpolate for 2012,2014 
. * interviews and leverage within-spell variation
. * to fill in missing wages
. *=================================================
. do wage_cleaning

. ***************************************************
. ***************************************************
. ** 4 cases for filling in missing wages in 2012
. ** (due to the biennial structure of the survey)
. ***************************************************
. ***************************************************
. gen wflg = (workPT | workFT) & in_secondary_school==0

. *=================================================
. * Case 1: Interpolate 2012 wages for those in same spell in '11, '12, and '13
. *=================================================
. mdesc comp_job_main if year==2012 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        5331        5331              1

. * First create a dummy for if the job was same in all three years
. bys ID (year): generat empTemp    = Emp_Status_Week_40_
(16,744 missing values generated)

. bys ID (year): generat empTempLag = L.Emp_Status_Week_40_
(23,846 missing values generated)

. bys ID (year): generat empTempFut = F.Emp_Status_Week_40_
(23,452 missing values generated)

. 
. bys ID (year): replace empTemp    = Emp_Status_Week_41_   if !inrange(  Emp_S
> tatus_Week_40_,1000,.) & (  workPT |   workFT) &   in_secondary_school==0
(836 real changes made)

. bys ID (year): replace empTempLag = L.Emp_Status_Week_41_ if !inrange(L.Emp_S
> tatus_Week_40_,1000,.) & (L.workPT | L.workFT) & L.in_secondary_school==0
(816 real changes made)

. bys ID (year): replace empTempFut = F.Emp_Status_Week_41_ if !inrange(F.Emp_S
> tatus_Week_40_,1000,.) & (F.workPT | F.workFT) & F.in_secondary_school==0
(835 real changes made)

. 
. generat same3jobs = 0

. replace same3jobs = 1 if empTemp==empTempLag & empTemp==empTempFut & year==20
> 12 & inrange(empTempLag,1000,.) & inrange(empTemp,1000,.) & inrange(empTempFu
> t,1000,.)
(3,267 real changes made)

. bys ID (year): replace same3jobs = same3jobs[_n+1] if year<=2011
(3,267 real changes made)

. bys ID (year): replace same3jobs = same3jobs[_n-1] if year==2013
(3,267 real changes made)

. 
. * Now interpolate and use the interpolated wage as the 2012 wage
. bys ID (year): ipolate comp_job_main year if same3jobs, gen(comp_job_main_ipo
> late)
(162121 missing values generated)

. replace comp_job_main = comp_job_main_ipolate if same3jobs & year==2012
(2,720 real changes made)

. drop comp_job_main_ipolate

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  4,566

. local interp2012 = ${initmisswage}-`r(N)' // Interpolate year 2012 wages for 
> those in same job in 2011, 2012, and 2013

. 
. *=================================================
. * Case 2: Use 2013 reported wage if 2012 was end of a job spell
. *=================================================
. mdesc comp_job_main if year==2012 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        2656        5331        .498218

. * First create a dummy for if the person was transitioning out of the job in 
> 2012
. generat oldjob2012 = 0

. replace oldjob2012 = 1 if empTemp!=empTempFut & empTemp==empTempLag & year==2
> 012 & inrange(empTemp,1000,.) & inrange(empTempLag,1000,.)
(713 real changes made)

. 
. * Now use the reported wage from the 2013 interview as the 2012 wage
. replace comp_job_main = compOct if oldjob2012 & year==2012
(692 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  4,393

. local rep2013 = ${initmisswage}-`interp2012'-`r(N)' // Use 2013 reported wage
>  as year 2012 wage for those where 2012 was the end of a job spell 

. 
. *=================================================
. * Case 3: Use 2013 reported wage if 2012 was single job spell
. *=================================================
. mdesc comp_job_main if year==2012 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        2010        5331         .37704

. * First create a dummy for if the person was in a single-year spell in 2012
. generat singlejob2012 = 0

. replace singlejob2012 = 1 if empTemp!=empTempFut & empTemp!=empTempLag & year
> ==2012 & inrange(empTemp,1000,.)
(536 real changes made)

. 
. * Now use the reported wage from the 2013 interview as the 2012 wage
. replace comp_job_main = compOct if singlejob2012 & year==2012
(511 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  4,286

. local s2013 = ${initmisswage}-`interp2012'-`rep2013'-`r(N)' // Use 2013 repor
> ted wage as year 2012 wage for those where 2012 was a single job spell 

. 
. 
. *=================================================
. * Case 4: Use regression to predict 2012 wage if same employer in 2012 and 20
> 13
. *=================================================
. mdesc comp_job_main if year==2012 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        1534        5331        .287751

. * Create dummy for if person was in a job that started in 2012 and continued 
> in 2013
. generat newjob2012 = 0

. replace newjob2012 = 1 if empTemp==empTempFut & empTemp!=empTempLag & year==2
> 012 & inrange(empTemp,1000,.) & inrange(empTempFut,1000,.)
(1,077 real changes made)

. summari newjob2012 if year==2012 & wflg

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  newjob2012 |      5,331    .1913337     .393388          0          1

. 
. * Check that these 4 cases form an exhaustive set of 2012 workers
. sum same3jobs oldjob2012 singlejob2012 newjob2012 if year==2012 & wflg

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   same3jobs |      5,331    .5959482    .4907536          0          1
  oldjob2012 |      5,331    .1228663    .3283144          0          1
singlej~2012 |      5,331    .0898518    .2859962          0          1
  newjob2012 |      5,331    .1913337     .393388          0          1

. tab ID if !same3jobs & !oldjob2012 & !singlejob2012 & !newjob2012 & year==201
> 2 & wflg
no observations

. 
. * Estimate regressions, separately by gender
. clonevar comp_job_mein = comp_job_main
(71,415 missing values generated)

. generat wagetemp = log(comp_job_mein/100)
(71,913 missing values generated)

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==1, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     32658
Group variable: ID                              Number of groups   =      4099

R-sq:  within  = 0.1684                         Obs per group: min =         1
       between = 0.2448                                        avg =       8.0
       overall = 0.1931                                        max =        17

                                                F(26,28533)        =    222.25
corr(u_i, Xb)  = 0.0860                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0404449   .0028579    14.15   0.000     .0348434    .0460465
         age |   .0160392   .0039835     4.03   0.000     .0082314    .0238471
     cum_2yr |   .0148144    .004895     3.03   0.002       .00522    .0244087
     cum_4yr |    .023098   .0041783     5.53   0.000     .0149084    .0312876
             |
        year |
       1998  |   .0984397   .0659015     1.49   0.135    -.0307303    .2276096
       1999  |   .2131255   .0572649     3.72   0.000     .1008836    .3253675
       2000  |   .2494542   .0524417     4.76   0.000      .146666    .3522423
       2001  |   .2524678   .0489337     5.16   0.000     .1565554    .3483803
       2002  |   .2639653   .0453119     5.83   0.000     .1751518    .3527787
       2003  |   .2391531   .0420121     5.69   0.000     .1568075    .3214988
       2004  |   .2344637   .0387521     6.05   0.000     .1585078    .3104196
       2005  |   .2345107    .035545     6.60   0.000     .1648409    .3041805
       2006  |   .2025128   .0322578     6.28   0.000     .1392859    .2657396
       2007  |   .2025966   .0291971     6.94   0.000     .1453689    .2598244
       2008  |   .1830675   .0262496     6.97   0.000     .1316169     .234518
       2009  |   .1452234   .0234203     6.20   0.000     .0993185    .1911284
       2010  |   .1136527   .0207926     5.47   0.000     .0728982    .1544071
       2011  |   .0675142   .0183991     3.67   0.000     .0314512    .1035772
       2012  |   .0748376   .0172002     4.35   0.000     .0411243    .1085509
       2013  |   .0337122    .014748     2.29   0.022     .0048054     .062619
       2015  |          0  (omitted)
             |
    1.in_2yr |  -.0293309   .0122613    -2.39   0.017    -.0533636   -.0052983
    1.in_4yr |  -.0930745   .0122765    -7.58   0.000     -.117137    -.069012
1.in_grad_~l |  -.0884698   .0203295    -4.35   0.000    -.1283166   -.0486231
    1.workPT |  -.0555582   .0071984    -7.72   0.000    -.0696675   -.0414489
  1.grad_2yr |   .0497291   .0192229     2.59   0.010     .0120512     .087407
  1.grad_4yr |    .218672   .0168565    12.97   0.000     .1856325    .2517114
       _cons |   1.701534   .0513364    33.14   0.000     1.600912    1.802156
-------------+----------------------------------------------------------------
     sigma_u |   .3814006
     sigma_e |  .45422639
         rho |  .41350588   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4098, 28533) = 4.26                 Prob > F = 0.0000

. predict wagepredF if year==2012 & newjob2012 & wflg & female==1
(option xb assumed; fitted values)
(170,214 missing values generated)

. replace wagepredF = wagepredF + `e(sigma_e)'*rnormal() if !mi(wagepredF)
(482 real changes made)

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==0, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     34021
Group variable: ID                              Number of groups   =      4266

R-sq:  within  = 0.1474                         Obs per group: min =         1
       between = 0.1462                                        avg =       8.0
       overall = 0.1439                                        max =        17

                                                F(26,29729)        =    197.71
corr(u_i, Xb)  = 0.0625                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0415509   .0032723    12.70   0.000     .0351371    .0479646
         age |   .0231654   .0045275     5.12   0.000     .0142913    .0320396
     cum_2yr |  -.0003119   .0066135    -0.05   0.962    -.0132747    .0126509
     cum_4yr |    .006314   .0051267     1.23   0.218    -.0037345    .0163626
             |
        year |
       1998  |   .1760448   .0730175     2.41   0.016     .0329274    .3191623
       1999  |   .2353585   .0639263     3.68   0.000     .1100602    .3606568
       2000  |   .2853162   .0583851     4.89   0.000     .1708788    .3997537
       2001  |   .2414219    .054247     4.45   0.000     .1350954    .3477484
       2002  |   .2379222   .0502454     4.74   0.000      .139439    .3364054
       2003  |   .2381905   .0465423     5.12   0.000     .1469656    .3294154
       2004  |   .2606559   .0429296     6.07   0.000      .176512    .3447999
       2005  |   .2458111   .0393927     6.24   0.000     .1685996    .3230225
       2006  |   .2440235   .0356294     6.85   0.000     .1741883    .3138588
       2007  |   .2394627    .032226     7.43   0.000     .1762984     .302627
       2008  |    .177302   .0289085     6.13   0.000     .1206401    .2339639
       2009  |   .1257571   .0257256     4.89   0.000     .0753339    .1761803
       2010  |   .0983074   .0227713     4.32   0.000     .0536746    .1429402
       2011  |   .0793259   .0199956     3.97   0.000     .0401337    .1185181
       2012  |   .0630663   .0186054     3.39   0.001      .026599    .0995336
       2013  |   .0222789    .015911     1.40   0.161    -.0089074    .0534652
       2015  |          0  (omitted)
             |
    1.in_2yr |  -.1122292   .0163185    -6.88   0.000    -.1442142   -.0802442
    1.in_4yr |  -.1494454     .01619    -9.23   0.000    -.1811785   -.1177123
1.in_grad_~l |  -.0708688   .0297891    -2.38   0.017    -.1292567   -.0124808
    1.workPT |  -.0553717   .0093668    -5.91   0.000     -.073731   -.0370125
  1.grad_2yr |    .093908   .0250221     3.75   0.000     .0448635    .1429525
  1.grad_4yr |   .2012683   .0220573     9.12   0.000     .1580349    .2445017
       _cons |   1.801241   .0567149    31.76   0.000     1.690077    1.912404
-------------+----------------------------------------------------------------
     sigma_u |  .49298696
     sigma_e |  .50961018
         rho |   .4834244   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4265, 29729) = 5.10                 Prob > F = 0.0000

. predict wagepred  if year==2012 & newjob2012 & wflg & female==0
(option xb assumed; fitted values)
(170,158 missing values generated)

. replace wagepred  = wagepred + `e(sigma_e)'*rnormal() if !mi(wagepred)
(538 real changes made)

. 
. * Use the predicted wages from the regressions as the 2012 wage
. replace comp_job_main = 100*exp(wagepredF) if female==1 & year==2012 & newjob
> 2012 & !mi(compOct) & wflg
(476 real changes made)

. replace comp_job_main = 100*exp(wagepred)  if female==0 & year==2012 & newjob
> 2012 & !mi(compOct) & wflg
(527 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  4,042

. local fe2013 = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`r(N)' // Imput
> e (via FE regression) 2012 wage for those who were at the same employer in 20
> 12 and 2013  

. 
. mdesc comp_job_main if year==2012 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job~ain         531        5331        .099606

. 
. * * Missingness over time and by job type
. * gen m_comp_job_main = mi(comp_job_main) if wflg
. 
. * tab year     if in_secondary_school==0 & female==0, sum(m_comp_job_main)
. * tab exper    if in_secondary_school==0 & female==0, sum(m_comp_job_main)
. 
. * l ID year choice15 comp_job_main compOct Main_job Hrly_comp_Job1_ Hrly_comp
> _Job2_ if female==0 & inrange(ID,1,50) & wflg, sepby(ID)
. 
. drop empTemp* wagepred* wagetemp same3jobs oldjob2012 singlejob2012 newjob201
> 2 comp_job_mein

. 
. ***************************************************
. ***************************************************
. ** 4 cases for filling in missing wages in 2014
. ** (due to the biennial structure of the survey)
. ***************************************************
. ***************************************************
. *=================================================
. * Case 1: Interpolate 2014 wages for those in same spell in '13, '14, and '15
. *=================================================
. mdesc comp_job_main if year==2014 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        5189        5189              1

. * First create a dummy for if the job was same in all three years
. bys ID (year): generat empTemp    = Emp_Status_Week_40_
(16,744 missing values generated)

. bys ID (year): generat empTempLag = L.Emp_Status_Week_40_
(23,846 missing values generated)

. bys ID (year): generat empTempFut = F.Emp_Status_Week_40_
(23,452 missing values generated)

. 
. bys ID (year): replace empTemp    = Emp_Status_Week_41_   if !inrange(  Emp_S
> tatus_Week_40_,1000,.) & (  workPT |   workFT) &   in_secondary_school==0
(836 real changes made)

. bys ID (year): replace empTempLag = L.Emp_Status_Week_41_ if !inrange(L.Emp_S
> tatus_Week_40_,1000,.) & (L.workPT | L.workFT) & L.in_secondary_school==0
(816 real changes made)

. bys ID (year): replace empTempFut = F.Emp_Status_Week_41_ if !inrange(F.Emp_S
> tatus_Week_40_,1000,.) & (F.workPT | F.workFT) & F.in_secondary_school==0
(835 real changes made)

. 
. generat same3jobs = 0

. replace same3jobs = 1 if empTemp==empTempLag & empTemp==empTempFut & year==20
> 14 & inrange(empTempLag,1000,.) & inrange(empTemp,1000,.) & inrange(empTempFu
> t,1000,.)
(3,176 real changes made)

. bys ID (year): replace same3jobs = same3jobs[_n+1] if year<=2013
(3,176 real changes made)

. bys ID (year): replace same3jobs = same3jobs[_n-1] if year==2015
(3,176 real changes made)

. 
. * Now interpolate and use the interpolated wage as the 2014 wage
. bys ID (year): ipolate comp_job_main year if same3jobs, gen(comp_job_main_ipo
> late)
(162118 missing values generated)

. replace comp_job_main = comp_job_main_ipolate if same3jobs & year==2014
(2,729 real changes made)

. drop comp_job_main_ipolate

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  3,222

. local interp2014 = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`r
> (N)' // Interpolate year 2012 wages for those in same job in 2011, 2012, and 
> 2013 

. 
. *=================================================
. * Case 2: Use 2015 reported wage if 2014 was end of a job spell
. *=================================================
. mdesc comp_job_main if year==2014 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        2496        5189        .481018

. * First create a dummy for if the person was transitioning out of the job in 
> 2014
. generat oldjob2014 = 0

. replace oldjob2014 = 1 if empTemp!=empTempFut & empTemp==empTempLag & year==2
> 014 & inrange(empTemp,1000,.) & inrange(empTempLag,1000,.)
(700 real changes made)

. 
. * Now use the reported wage from the 2015 interview as the 2014 wage
. replace comp_job_main = compOct if oldjob2014 & year==2014
(676 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  3,071

. local rep2015 = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`inte
> rp2014'-`r(N)' // Use 2015 reported wage as year 2014 wage for those where 20
> 14 was the end of a job spell  

. 
. 
. *=================================================
. * Case 3: Use 2015 reported wage if 2014 was single job spell
. *=================================================
. mdesc comp_job_main if year==2014 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        1851        5189        .356716

. * First create a dummy for if the person was in a single-year spell in 2014
. generat singlejob2014 = 0

. replace singlejob2014 = 1 if empTemp!=empTempFut & empTemp!=empTempLag & year
> ==2014 & inrange(empTemp,1000,.)
(502 real changes made)

. 
. * Now use the reported wage from the 2015 interview as the 2014 wage
. replace comp_job_main = compOct if singlejob2014 & year==2014
(485 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  2,978

. local s2015 = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`interp
> 2014'-`rep2015'-`r(N)' // Use 2015 reported wage as year 2014 wage for those 
> where 2014 was a single job spell  

. 
. 
. *=================================================
. * Case 4: Use regression to predict 2014 wage if same employer in 2014 and 20
> 15
. *=================================================
. mdesc comp_job_main if year==2014 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job_m~n        1401        5189        .269994

. * Create dummy for if person was in a job that started in 2014 and continued 
> in 2015
. generat newjob2014 = 0

. replace newjob2014 = 1 if empTemp==empTempFut & empTemp!=empTempLag & year==2
> 014 & inrange(empTemp,1000,.) & inrange(empTempFut,1000,.)
(1,015 real changes made)

. summari newjob2014 if year==2014 & wflg

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  newjob2014 |      5,189    .1873193    .3902053          0          1

. 
. * Check that these 4 cases form an exhaustive set of 2014 workers
. sum same3jobs oldjob2014 singlejob2014 newjob2014 if year==2014 & wflg

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   same3jobs |      5,189    .5983812    .4902728          0          1
  oldjob2014 |      5,189    .1262286    .3321388          0          1
singlej~2014 |      5,189    .0880709    .2834253          0          1
  newjob2014 |      5,189    .1873193    .3902053          0          1

. tab ID if !same3jobs & !oldjob2014 & !singlejob2014 & !newjob2014 & year==201
> 4 & wflg
no observations

. 
. * Estimate regressions, separately by gender
. clonevar comp_job_mein = comp_job_main
(66,522 missing values generated)

. generat wagetemp = log(comp_job_mein/100)
(67,053 missing values generated)

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==1, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     34952
Group variable: ID                              Number of groups   =      4101

R-sq:  within  = 0.1735                         Obs per group: min =         1
       between = 0.2593                                        avg =       8.5
       overall = 0.2008                                        max =        18

                                                F(27,30824)        =    239.61
corr(u_i, Xb)  = 0.0891                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0407096    .002658    15.32   0.000     .0354998    .0459195
         age |   .0165406   .0038751     4.27   0.000     .0089452    .0241359
     cum_2yr |   .0131127   .0046291     2.83   0.005     .0040394    .0221861
     cum_4yr |   .0212245   .0039957     5.31   0.000     .0133929    .0290561
             |
        year |
       1998  |   .1043468   .0652263     1.60   0.110    -.0234994    .2321929
       1999  |   .2215596   .0566498     3.91   0.000     .1105237    .3325956
       2000  |   .2567238   .0518752     4.95   0.000     .1550462    .3584013
       2001  |   .2596564   .0484006     5.36   0.000     .1647893    .3545235
       2002  |   .2713668   .0448135     6.06   0.000     .1835305    .3592032
       2003  |   .2463105   .0415505     5.93   0.000     .1648697    .3277512
       2004  |   .2405848   .0383239     6.28   0.000     .1654684    .3157013
       2005  |   .2397343   .0351527     6.82   0.000     .1708337     .308635
       2006  |   .2070502   .0319051     6.49   0.000     .1445148    .2695855
       2007  |   .2067057   .0288764     7.16   0.000     .1501068    .2633046
       2008  |   .1865984    .025964     7.19   0.000     .1357079     .237489
       2009  |   .1475868   .0231692     6.37   0.000     .1021743    .1929994
       2010  |   .1156568   .0205757     5.62   0.000     .0753276     .155986
       2011  |    .068981   .0182115     3.79   0.000     .0332857    .1046763
       2012  |   .0846467   .0162549     5.21   0.000     .0527865    .1165069
       2013  |   .0336584   .0146121     2.30   0.021     .0050181    .0622987
       2014  |    .037031   .0147517     2.51   0.012     .0081172    .0659449
       2015  |          0  (omitted)
             |
    1.in_2yr |  -.0360088   .0118671    -3.03   0.002    -.0592688   -.0127488
    1.in_4yr |  -.0974846   .0118519    -8.23   0.000    -.1207148   -.0742543
1.in_grad_~l |  -.0935168   .0194517    -4.81   0.000    -.1316429   -.0553907
    1.workPT |  -.0566502   .0069364    -8.17   0.000    -.0702459   -.0430545
  1.grad_2yr |   .0484089   .0184455     2.62   0.009     .0122549    .0845629
  1.grad_4yr |    .220722   .0162688    13.57   0.000     .1888345    .2526094
       _cons |    1.69895   .0507141    33.50   0.000     1.599548    1.798352
-------------+----------------------------------------------------------------
     sigma_u |  .37066416
     sigma_e |  .45118994
         rho |  .40295106   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4100, 30824) = 4.53                 Prob > F = 0.0000

. predict wagepredF if year==2014 & newjob2014 & wflg & female==1
(option xb assumed; fitted values)
(170,255 missing values generated)

. replace wagepredF = wagepredF + `e(sigma_e)'*rnormal() if !mi(wagepredF)
(441 real changes made)

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==0, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     36491
Group variable: ID                              Number of groups   =      4270

R-sq:  within  = 0.1503                         Obs per group: min =         1
       between = 0.1528                                        avg =       8.5
       overall = 0.1481                                        max =        18

                                                F(27,32194)        =    210.99
corr(u_i, Xb)  = 0.0661                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0388671   .0030697    12.66   0.000     .0328503    .0448839
         age |   .0247155     .00442     5.59   0.000      .016052    .0333789
     cum_2yr |  -.0018475   .0063166    -0.29   0.770    -.0142282    .0105331
     cum_4yr |    .005051   .0049192     1.03   0.305    -.0045908    .0146928
             |
        year |
       1998  |   .1634909   .0725129     2.25   0.024     .0213629    .3056188
       1999  |   .2249243   .0634831     3.54   0.000      .100495    .3493536
       2000  |   .2752523   .0579772     4.75   0.000     .1616148    .3888898
       2001  |   .2304365   .0538676     4.28   0.000     .1248539    .3360191
       2002  |   .2272025   .0498907     4.55   0.000     .1294148    .3249902
       2003  |   .2278407   .0462115     4.93   0.000     .1372643     .318417
       2004  |    .252955   .0426253     5.93   0.000     .1694079    .3365022
       2005  |   .2385243   .0391115     6.10   0.000     .1618642    .3151843
       2006  |   .2363924   .0353794     6.68   0.000     .1670474    .3057374
       2007  |   .2334969   .0319999     7.30   0.000      .170776    .2962178
       2008  |   .1722858   .0287082     6.00   0.000     .1160166     .228555
       2009  |    .120723   .0255505     4.72   0.000     .0706431    .1708029
       2010  |   .0938683   .0226191     4.15   0.000      .049534    .1382026
       2011  |   .0766738   .0198644     3.86   0.000     .0377388    .1156087
       2012  |   .0704028   .0176428     3.99   0.000     .0358223    .1049833
       2013  |   .0204422   .0158131     1.29   0.196     -.010552    .0514365
       2014  |   .0293615   .0159111     1.85   0.065    -.0018249    .0605479
       2015  |          0  (omitted)
             |
    1.in_2yr |   -.107793   .0158534    -6.80   0.000    -.1388662   -.0767197
    1.in_4yr |  -.1491562   .0157287    -9.48   0.000    -.1799851   -.1183273
1.in_grad_~l |   -.072028   .0283968    -2.54   0.011    -.1276868   -.0163693
    1.workPT |  -.0526915   .0090994    -5.79   0.000    -.0705266   -.0348564
  1.grad_2yr |   .0935845   .0240716     3.89   0.000     .0464032    .1407658
  1.grad_4yr |   .2003097   .0213472     9.38   0.000     .1584683    .2421511
       _cons |   1.811523   .0562694    32.19   0.000     1.701232    1.921813
-------------+----------------------------------------------------------------
     sigma_u |  .48871633
     sigma_e |  .50749652
         rho |  .48115511   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4269, 32194) = 5.43                 Prob > F = 0.0000

. predict wagepred  if year==2014 & newjob2014 & wflg & female==0
(option xb assumed; fitted values)
(170,165 missing values generated)

. replace wagepred  = wagepred + `e(sigma_e)'*rnormal() if !mi(wagepred)
(531 real changes made)

. 
. * Use the predicted wages from the regressions as the 2014 wage
. replace comp_job_main = 100*exp(wagepredF) if female==1 & year==2014 & newjob
> 2014 & !mi(compOct) & wflg
(425 real changes made)

. replace comp_job_main = 100*exp(wagepred)  if female==0 & year==2014 & newjob
> 2014 & !mi(compOct) & wflg
(513 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  2,726

. local fe2014 = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`inter
> p2014'-`rep2015'-`s2015'-`r(N)' // Impute (via FE regression) 2012 wage for t
> hose who were at the same employer in 2012 and 2013  

. 
. mdesc comp_job_main if year==2014 & wflg
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
comp_job~ain         463        5189        .089227

. 
. * * Missingness over time and by job type
. * gen m_comp_job_main = mi(comp_job_main) if wflg
. 
. * tab year     if in_secondary_school==0 & female==0, sum(m_comp_job_main)
. * tab exper    if in_secondary_school==0 & female==0, sum(m_comp_job_main)
. 
. * l ID year choice15 comp_job_main compOct Main_job Hrly_comp_Job1_ Hrly_comp
> _Job2_ if female==0 & inrange(ID,1,50) & wflg, sepby(ID)
. 
. drop empTemp* wagepred* wagetemp same3jobs oldjob2014 singlejob2014 newjob201
> 4 comp_job_mein

. 
. ***************************************************
. ***************************************************
. ** 4 cases for filling in missing wages in years
. ** respondent missed interview (Main_job==.n)
. ***************************************************
. ***************************************************
. * Create missed interview spell identifiers
. sort ID year

. spell if ~missIntLastSpell & year<2016 & year!=2012, by(ID) cond(Interview_da
> te==.n) spell(MIspell) end(MIend) seq(MIseq) censor(MIcensorl MIcensorr)

. bys ID MIspell (year): egen MIspellLength = max(MIseq)

. bys ID (year): egen numMIspells = max(MIspell)

. sort ID year

. 
. * Create October employer identifiers
. generat tempemp = Emp_Status_Week_40_ if wflg
(86,443 missing values generated)

. replace tempemp = Emp_Status_Week_41_ if wflg & !inrange(tempemp,1000,.)
(836 real changes made)

. 
. * Create employment spell identifiers
. sort ID year

. spell tempemp if ~missIntLastSpell & year<2016 & wflg, by(ID) spell(emp_spell
> ) end(emp_spell_end) seq(emp_spell_seq) censor(emp_spell_censor_l emp_spell_c
> ensor_r)

. sort ID year

. 
. *=================================================
. * Case 1: Interpolate missed interview wages for those
. * in same empl. spell for all periods of missed intvw spell
. *=================================================
. bys ID (year): generat samejob = 0

. bys ID (year): replace samejob = 1 if tempemp==F1.tempemp & tempemp==F2.tempe
> mp & MIseq==0 & F1.MIseq==1 & F1.MIspellLength==1 & inrange(tempemp,1000,.) &
>  inrange(F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.)
(2,957 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L1.tempemp & tempemp==F1.tempe
> mp & MIseq==1               &    MIspellLength==1 & inrange(tempemp,1000,.) &
>  inrange(L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.)
(2,957 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L2.tempemp & tempemp==L1.tempe
> mp & MIseq==0 & L1.MIseq==1 & L1.MIspellLength==1 & inrange(tempemp,1000,.) &
>  inrange(L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.)
(2,940 real changes made)

. 
. bys ID (year): replace samejob = 1 if tempemp==F1.tempemp & tempemp==F2.tempe
> mp & tempemp==F3.tempemp & MIseq==0 & F1.MIseq==1 & F1.MIspellLength==2 & inr
> ange(tempemp,1000,.) & inrange(F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.
> ) & inrange(F3.tempemp,1000,.)
(210 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L1.tempemp & tempemp==F1.tempe
> mp & tempemp==F2.tempemp & MIseq==1 &                  MIspellLength==2 & inr
> ange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.
> ) & inrange(F2.tempemp,1000,.)
(217 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L2.tempemp & tempemp==L1.tempe
> mp & tempemp==F1.tempemp & MIseq==2 &                  MIspellLength==2 & inr
> ange(tempemp,1000,.) & inrange(L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.
> ) & inrange(F1.tempemp,1000,.)
(217 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L3.tempemp & tempemp==L2.tempe
> mp & tempemp==L1.tempemp & MIseq==0 & L1.MIseq==2 & L1.MIspellLength==2 & inr
> ange(tempemp,1000,.) & inrange(L3.tempemp,1000,.) & inrange(L2.tempemp,1000,.
> ) & inrange(L1.tempemp,1000,.)
(203 real changes made)

. 
. bys ID (year): replace samejob = 1 if tempemp==F1.tempemp & tempemp==F2.tempe
> mp & tempemp==F3.tempemp & tempemp==F4.tempemp & MIseq==0 & F1.MIseq==1 & F1.
> MIspellLength==3 & inrange(tempemp,1000,.) & inrange(F1.tempemp,1000,.) & inr
> ange(F2.tempemp,1000,.) & inrange(F3.tempemp,1000,.) & inrange(F4.tempemp,100
> 0,.)
(65 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L1.tempemp & tempemp==F1.tempe
> mp & tempemp==F2.tempemp & tempemp==F3.tempemp & MIseq==1 &                  
> MIspellLength==3 & inrange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inr
> ange(F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.) & inrange(F3.tempemp,100
> 0,.)
(74 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L2.tempemp & tempemp==L1.tempe
> mp & tempemp==F1.tempemp & tempemp==F2.tempemp & MIseq==2 &                  
> MIspellLength==3 & inrange(tempemp,1000,.) & inrange(L2.tempemp,1000,.) & inr
> ange(L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.) & inrange(F2.tempemp,100
> 0,.)
(78 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L3.tempemp & tempemp==L2.tempe
> mp & tempemp==L1.tempemp & tempemp==F1.tempemp & MIseq==3 &                  
> MIspellLength==3 & inrange(tempemp,1000,.) & inrange(L3.tempemp,1000,.) & inr
> ange(L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange(F1.tempemp,100
> 0,.)
(78 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L4.tempemp & tempemp==L3.tempe
> mp & tempemp==L2.tempemp & tempemp==L1.tempemp & MIseq==0 & L1.MIseq==3 & L1.
> MIspellLength==3 & inrange(tempemp,1000,.) & inrange(L4.tempemp,1000,.) & inr
> ange(L3.tempemp,1000,.) & inrange(L2.tempemp,1000,.) & inrange(L1.tempemp,100
> 0,.)
(73 real changes made)

. 
. bys ID (year): replace samejob = 1 if tempemp==F1.tempemp & tempemp==F2.tempe
> mp & tempemp==F3.tempemp & tempemp==F4.tempemp & tempemp==F5.tempemp & MIseq=
> =0 & F1.MIseq==1 & F1.MIspellLength==4 & inrange(tempemp,1000,.) & inrange(F1
> .tempemp,1000,.) & inrange(F2.tempemp,1000,.) & inrange(F3.tempemp,1000,.) & 
> inrange(F4.tempemp,1000,.) & inrange(F5.tempemp,1000,.)
(25 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L1.tempemp & tempemp==F1.tempe
> mp & tempemp==F2.tempemp & tempemp==F3.tempemp & tempemp==F4.tempemp & MIseq=
> =1 &                  MIspellLength==4 & inrange(tempemp,1000,.) & inrange(L1
> .tempemp,1000,.) & inrange(F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.) & 
> inrange(F3.tempemp,1000,.) & inrange(F4.tempemp,1000,.)
(28 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L2.tempemp & tempemp==L1.tempe
> mp & tempemp==F1.tempemp & tempemp==F2.tempemp & tempemp==F3.tempemp & MIseq=
> =2 &                  MIspellLength==4 & inrange(tempemp,1000,.) & inrange(L2
> .tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.) & 
> inrange(F2.tempemp,1000,.) & inrange(F3.tempemp,1000,.)
(28 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L3.tempemp & tempemp==L2.tempe
> mp & tempemp==L1.tempemp & tempemp==F1.tempemp & tempemp==F2.tempemp & MIseq=
> =3 &                  MIspellLength==4 & inrange(tempemp,1000,.) & inrange(L3
> .tempemp,1000,.) & inrange(L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.) & 
> inrange(F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.)
(29 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L4.tempemp & tempemp==L3.tempe
> mp & tempemp==L2.tempemp & tempemp==L1.tempemp & tempemp==F1.tempemp & MIseq=
> =4 &                  MIspellLength==4 & inrange(tempemp,1000,.) & inrange(L4
> .tempemp,1000,.) & inrange(L3.tempemp,1000,.) & inrange(L2.tempemp,1000,.) & 
> inrange(L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.)
(29 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L5.tempemp & tempemp==L4.tempe
> mp & tempemp==L3.tempemp & tempemp==L2.tempemp & tempemp==L1.tempemp & MIseq=
> =0 & L1.MIseq==4 & L1.MIspellLength==4 & inrange(tempemp,1000,.) & inrange(L5
> .tempemp,1000,.) & inrange(L4.tempemp,1000,.) & inrange(L3.tempemp,1000,.) & 
> inrange(L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.)
(25 real changes made)

. 
. bys ID (year): replace samejob = 1 if tempemp==F1.tempemp & tempemp==F2.tempe
> mp & tempemp==F3.tempemp & tempemp==F4.tempemp & tempemp==F5.tempemp & tempem
> p==F6.tempemp & MIseq==0 & F1.MIseq==1 & F1.MIspellLength==5 & inrange(tempem
> p,1000,.) & inrange(F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.) & inrange
> (F3.tempemp,1000,.) & inrange(F4.tempemp,1000,.) & inrange(F5.tempemp,1000,.)
>  & inrange(F6.tempemp,1000,.)
(5 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L1.tempemp & tempemp==F1.tempe
> mp & tempemp==F2.tempemp & tempemp==F3.tempemp & tempemp==F4.tempemp & tempem
> p==F5.tempemp & MIseq==1 &                  MIspellLength==5 & inrange(tempem
> p,1000,.) & inrange(L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.) & inrange
> (F2.tempemp,1000,.) & inrange(F3.tempemp,1000,.) & inrange(F4.tempemp,1000,.)
>  & inrange(F5.tempemp,1000,.)
(5 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L2.tempemp & tempemp==L1.tempe
> mp & tempemp==F1.tempemp & tempemp==F2.tempemp & tempemp==F3.tempemp & tempem
> p==F4.tempemp & MIseq==2 &                  MIspellLength==5 & inrange(tempem
> p,1000,.) & inrange(L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange
> (F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.) & inrange(F3.tempemp,1000,.)
>  & inrange(F4.tempemp,1000,.)
(5 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L3.tempemp & tempemp==L2.tempe
> mp & tempemp==L1.tempemp & tempemp==F1.tempemp & tempemp==F2.tempemp & tempem
> p==F3.tempemp & MIseq==3 &                  MIspellLength==5 & inrange(tempem
> p,1000,.) & inrange(L3.tempemp,1000,.) & inrange(L2.tempemp,1000,.) & inrange
> (L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.) & inrange(F2.tempemp,1000,.)
>  & inrange(F3.tempemp,1000,.)
(5 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L4.tempemp & tempemp==L3.tempe
> mp & tempemp==L2.tempemp & tempemp==L1.tempemp & tempemp==F1.tempemp & tempem
> p==F2.tempemp & MIseq==4 &                  MIspellLength==5 & inrange(tempem
> p,1000,.) & inrange(L4.tempemp,1000,.) & inrange(L3.tempemp,1000,.) & inrange
> (L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange(F1.tempemp,1000,.)
>  & inrange(F2.tempemp,1000,.)
(5 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L5.tempemp & tempemp==L4.tempe
> mp & tempemp==L3.tempemp & tempemp==L2.tempemp & tempemp==L1.tempemp & tempem
> p==F1.tempemp & MIseq==5 &                  MIspellLength==5 & inrange(tempem
> p,1000,.) & inrange(L5.tempemp,1000,.) & inrange(L4.tempemp,1000,.) & inrange
> (L3.tempemp,1000,.) & inrange(L2.tempemp,1000,.) & inrange(L1.tempemp,1000,.)
>  & inrange(F1.tempemp,1000,.)
(5 real changes made)

. bys ID (year): replace samejob = 1 if tempemp==L6.tempemp & tempemp==L5.tempe
> mp & tempemp==L4.tempemp & tempemp==L3.tempemp & tempemp==L2.tempemp & tempem
> p==L1.tempemp & MIseq==0 & L1.MIseq==5 & L1.MIspellLength==5 & inrange(tempem
> p,1000,.) & inrange(L6.tempemp,1000,.) & inrange(L5.tempemp,1000,.) & inrange
> (L4.tempemp,1000,.) & inrange(L3.tempemp,1000,.) & inrange(L2.tempemp,1000,.)
>  & inrange(L1.tempemp,1000,.)
(4 real changes made)

. 
. * Specific cases
. bys ID (year): replace samejob = 1 if inlist(year,2013,2015) & samejob==0 & L
> .samejob==1 & tempemp==L.tempemp & inrange(tempemp,1000,.) & inrange(L.tempem
> p,1000,.)
(38 real changes made)

. 
. * Now interpolate and use the interpolated wage as the 2012 wage
. bys ID (year): ipolate comp_job_main year if samejob, gen(comp_job_main_ipola
> te)
(161203 missing values generated)

. replace comp_job_main = comp_job_main_ipolate if samejob & mi(comp_job_main) 
> & !mi(comp_job_main_ipolate)
(1,083 real changes made)

. drop comp_job_main_ipolate

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  2,437

. local interpall = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`in
> terp2014'-`rep2015'-`s2015'-`fe2014'-`r(N)' // Interpolate missing wages for 
> those with missing interviews but in the same job before, during, and after m
> issing the interview(s)  

. 
. *=================================================
. * Case 2: Use next valid interview wage if
. * missed intvw was end of a job spell
. *=================================================
. generat oldjob = 0

. replace oldjob = 1 if tempemp!=F1.tempemp & tempemp==L1.tempemp              
>                                                                            & 
> Main_job==.n & inrange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange
> (F1.tempemp,1000,.) & MIspellLength==1
(123 real changes made)

. replace oldjob = 1 if tempemp!=F1.tempemp & tempemp==L1.tempemp & tempemp==L2
> .tempemp                                                                   & 
> Main_job==.n & inrange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange
> (F1.tempemp,1000,.) & MIspellLength==2
(29 real changes made)

. replace oldjob = 1 if tempemp!=F1.tempemp & tempemp==L1.tempemp & tempemp==L2
> .tempemp & tempemp==L3.tempemp                                             & 
> Main_job==.n & inrange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange
> (F1.tempemp,1000,.) & MIspellLength==3
(14 real changes made)

. replace oldjob = 1 if tempemp!=F1.tempemp & tempemp==L1.tempemp & tempemp==L2
> .tempemp & tempemp==L3.tempemp & tempemp==L4.tempemp                       & 
> Main_job==.n & inrange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange
> (F1.tempemp,1000,.) & MIspellLength==4
(10 real changes made)

. replace oldjob = 1 if tempemp!=F1.tempemp & tempemp==L1.tempemp & tempemp==L2
> .tempemp & tempemp==L3.tempemp & tempemp==L4.tempemp & tempemp==L5.tempemp & 
> Main_job==.n & inrange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange
> (F1.tempemp,1000,.) & MIspellLength==5
(5 real changes made)

. 
. * Now use the reported wage from the next non-missed interview as the wage
. replace comp_job_main = compOct if oldjob
(179 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  2,403

. local interpvi = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`int
> erp2014'-`rep2015'-`s2015'-`fe2014'-`interpall'-`r(N)' // Interpolate missing
>  wages using the next valid interview wage if the missed interview was at the
>  end of a job spell  

. 
. 
. *=================================================
. * Case 3: Use next valid interview wage if
. * missed intvw was single job spell
. *=================================================
. * First create a dummy for if the person was in a single-year spell in 2012
. generat singlejob = 0

. replace singlejob = 1 if tempemp!=F1.tempemp & tempemp!=L1.tempemp & Main_job
> ==.n & inrange(tempemp,1000,.) & inrange(L1.tempemp,1000,.) & inrange(F1.temp
> emp,1000,.) & MIspellLength==1
(105 real changes made)

. 
. * Now use the reported wage from the 2015 interview as the 2012 wage
. replace comp_job_main = compOct if singlejob
(105 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  2,374

. local interpni = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`int
> erp2014'-`rep2015'-`s2015'-`fe2014'-`interpall'-`interpvi'-`r(N)' // Interpol
> ate missing wages using the next valid interview wage if the missed interview
>  was at the end of a job spell  

. 
. 
. *=================================================
. * Case 5: Interpolate wages within same employment spell
. *=================================================
. bys ID emp_spell (year): ipolate comp_job_main year, gen(comp_job_main_ipolat
> e)
(51617 missing values generated)

. replace comp_job_main = comp_job_main_ipolate if mi(comp_job_main) & wflg & !
> mi(comp_job_main_ipolate)
(1,686 real changes made)

. drop comp_job_main_ipolate

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  1,911

. local interpwi = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`int
> erp2014'-`rep2015'-`s2015'-`fe2014'-`interpall'-`interpvi'-`interpni'-`r(N)' 
> // Interpolate missing wages within the same job spell 

. 
. 
. *=================================================
. * Case 4: Use regression to predict missed intvw spell wages
. * if same start of employer spell and start of missed interview spell coincid
> e
. *=================================================
. gen tempflag = emp_spell_seq==1 & mi(comp_job_main) & wflg

. * Estimate regressions, separately by gender
. clonevar comp_job_mein = comp_job_main
(62,531 missing values generated)

. generat wagetemp = log(comp_job_mein/100)
(63,077 missing values generated)

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==1, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     36698
Group variable: ID                              Number of groups   =      4101

R-sq:  within  = 0.1708                         Obs per group: min =         1
       between = 0.2573                                        avg =       8.9
       overall = 0.1951                                        max =        18

                                                F(27,32570)        =    248.46
corr(u_i, Xb)  = 0.0835                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0403528   .0025829    15.62   0.000     .0352902    .0454154
         age |    .016708   .0038544     4.33   0.000     .0091533    .0242627
     cum_2yr |   .0143312   .0045379     3.16   0.002     .0054367    .0232257
     cum_4yr |   .0221435   .0039213     5.65   0.000     .0144577    .0298292
             |
        year |
       1998  |   .1036927   .0651467     1.59   0.111    -.0239973    .2313826
       1999  |   .2201387   .0565954     3.89   0.000     .1092095    .3310678
       2000  |   .2577437   .0518729     4.97   0.000      .156071    .3594165
       2001  |   .2639044   .0483545     5.46   0.000     .1691277    .3586811
       2002  |   .2714833   .0447705     6.06   0.000     .1837315     .359235
       2003  |   .2509452   .0414944     6.05   0.000     .1696146    .3322758
       2004  |   .2454682   .0382725     6.41   0.000     .1704528    .3204837
       2005  |   .2468652   .0350655     7.04   0.000     .1781356    .3155948
       2006  |   .2110021    .031866     6.62   0.000     .1485435    .2734607
       2007  |   .2127588    .028811     7.38   0.000     .1562882    .2692295
       2008  |   .1857065    .025885     7.17   0.000     .1349708    .2364421
       2009  |   .1512783    .023117     6.54   0.000      .105968    .1965886
       2010  |   .1185869   .0205062     5.78   0.000      .078394    .1587798
       2011  |   .0737072    .018123     4.07   0.000     .0381855    .1092289
       2012  |   .0874193   .0161139     5.43   0.000     .0558356    .1190031
       2013  |   .0357497   .0145073     2.46   0.014     .0073148    .0641846
       2014  |   .0417003   .0138202     3.02   0.003     .0146122    .0687884
       2015  |          0  (omitted)
             |
    1.in_2yr |  -.0345619   .0116782    -2.96   0.003    -.0574516   -.0116722
    1.in_4yr |  -.0986135   .0116373    -8.47   0.000     -.121423    -.075804
1.in_grad_~l |  -.0896527   .0190068    -4.72   0.000    -.1269068   -.0523987
    1.workPT |  -.0569689   .0068009    -8.38   0.000     -.070299   -.0436388
  1.grad_2yr |    .043165   .0180415     2.39   0.017      .007803    .0785269
  1.grad_4yr |   .2166951   .0159279    13.60   0.000     .1854759    .2479143
       _cons |   1.700618   .0507374    33.52   0.000     1.601171    1.800065
-------------+----------------------------------------------------------------
     sigma_u |  .37166035
     sigma_e |  .45266837
         rho |  .40266846   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4100, 32570) = 4.87                 Prob > F = 0.0000

. predict wagepredF if emp_spell_seq==1 & mi(comp_job_main) & wflg & female==1
(option xb assumed; fitted values)
(168,589 missing values generated)

. replace wagepredF = wagepredF + `e(sigma_e)'*rnormal() if !mi(wagepredF)
(2,107 real changes made)

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==0, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     38721
Group variable: ID                              Number of groups   =      4273

R-sq:  within  = 0.1499                         Obs per group: min =         1
       between = 0.1538                                        avg =       9.1
       overall = 0.1459                                        max =        19

                                                F(27,34421)        =    224.73
corr(u_i, Xb)  = 0.0639                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0381823    .002953    12.93   0.000     .0323944    .0439702
         age |   .0261595    .004349     6.02   0.000     .0176354    .0346836
     cum_2yr |   -.001946   .0061466    -0.32   0.752    -.0139935    .0101016
     cum_4yr |   .0045717    .004807     0.95   0.342    -.0048502    .0139935
             |
        year |
       1998  |   .1779358   .0716833     2.48   0.013     .0374342    .3184374
       1999  |   .2426043    .062831     3.86   0.000     .1194536    .3657551
       2000  |   .2882641   .0574342     5.02   0.000     .1756913    .4008369
       2001  |   .2443218   .0533736     4.58   0.000     .1397077    .3489359
       2002  |   .2410202   .0494246     4.88   0.000     .1441464    .3378939
       2003  |   .2431159   .0457389     5.32   0.000     .1534662    .3327655
       2004  |    .268391   .0421719     6.36   0.000     .1857326    .3510494
       2005  |   .2574923   .0386361     6.66   0.000     .1817643    .3332203
       2006  |   .2470805   .0350186     7.06   0.000      .178443    .3157181
       2007  |   .2436282   .0316428     7.70   0.000     .1816073    .3056491
       2008  |   .1842894    .028385     6.49   0.000     .1286538     .239925
       2009  |   .1276252   .0252428     5.06   0.000     .0781484    .1771019
       2010  |   .1051013   .0223241     4.71   0.000     .0613453    .1488573
       2011  |   .0799146   .0196231     4.07   0.000     .0414526    .1183766
       2012  |    .075034   .0173362     4.33   0.000     .0410546    .1090135
       2013  |   .0260743   .0155505     1.68   0.094    -.0044052    .0565538
       2014  |   .0413809   .0146548     2.82   0.005      .012657    .0701048
       2015  |          0  (omitted)
             |
    1.in_2yr |  -.1098772   .0153387    -7.16   0.000    -.1399416   -.0798128
    1.in_4yr |  -.1547244   .0153088   -10.11   0.000    -.1847302   -.1247186
1.in_grad_~l |  -.0679588   .0276283    -2.46   0.014    -.1221111   -.0138065
    1.workPT |  -.0511905    .008854    -5.78   0.000    -.0685447   -.0338363
  1.grad_2yr |   .1053009   .0233464     4.51   0.000     .0595412    .1510605
  1.grad_4yr |   .1944025   .0208137     9.34   0.000      .153607    .2351981
       _cons |   1.800546   .0558042    32.27   0.000     1.691168    1.909924
-------------+----------------------------------------------------------------
     sigma_u |  .48674228
     sigma_e |  .50537682
         rho |  .48122406   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(4272, 34421) = 5.79                 Prob > F = 0.0000

. predict wagepred  if emp_spell_seq==1 & mi(comp_job_main) & wflg & female==0
(option xb assumed; fitted values)
(168,256 missing values generated)

. replace wagepred  = wagepred + `e(sigma_e)'*rnormal() if !mi(wagepred)
(2,440 real changes made)

. gen IDempspell = ID*100+emp_spell

. xtset IDempspell year
       panel variable:  IDempspell (unbalanced)
        time variable:  year, 1997 to 2015, but with gaps
                delta:  1 unit

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==1, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     36698
Group variable: IDempspell                      Number of groups   =     16414

R-sq:  within  = 0.0536                         Obs per group: min =         1
       between = 0.1592                                        avg =       2.2
       overall = 0.1765                                        max =        17

                                                F(27,20257)        =     42.50
corr(u_i, Xb)  = 0.1214                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0416825   .0062212     6.70   0.000     .0294885    .0538765
         age |   .0289011   .0089261     3.24   0.001     .0114053    .0463969
     cum_2yr |   .0119125   .0073859     1.61   0.107    -.0025645    .0263895
     cum_4yr |   .0119052   .0066351     1.79   0.073    -.0011001    .0249104
             |
        year |
       1998  |   .3026389   .1209085     2.50   0.012     .0656485    .5396293
       1999  |    .429274   .1132272     3.79   0.000     .2073395    .6512084
       2000  |    .500116   .1062332     4.71   0.000     .2918904    .7083416
       2001  |   .4741299    .099689     4.76   0.000     .2787313    .6695285
       2002  |   .4580665    .092925     4.93   0.000      .275926    .6402069
       2003  |   .4295061   .0860578     4.99   0.000     .2608259    .5981864
       2004  |   .4097209   .0791262     5.18   0.000      .254627    .5648148
       2005  |    .398871    .072188     5.53   0.000     .2573765    .5403654
       2006  |    .348779   .0651739     5.35   0.000      .221033    .4765251
       2007  |   .3340583   .0582063     5.74   0.000     .2199693    .4481474
       2008  |    .279131   .0512399     5.45   0.000     .1786965    .3795654
       2009  |   .2169496   .0443572     4.89   0.000      .130006    .3038933
       2010  |   .1861748   .0375583     4.96   0.000     .1125574    .2597922
       2011  |   .1295139   .0308954     4.19   0.000     .0689565    .1900714
       2012  |   .1263733   .0244654     5.17   0.000     .0784192    .1743275
       2013  |   .0607383   .0185879     3.27   0.001     .0243045    .0971721
       2014  |   .0480603   .0138466     3.47   0.001     .0209198    .0752008
       2015  |          0  (omitted)
             |
    1.in_2yr |  -.0128295   .0138923    -0.92   0.356    -.0400594    .0144005
    1.in_4yr |  -.0282703   .0144731    -1.95   0.051    -.0566387    .0000982
1.in_grad_~l |  -.0407878    .020247    -2.01   0.044    -.0804735   -.0011021
    1.workPT |  -.0169439   .0090978    -1.86   0.063    -.0347765    .0008886
  1.grad_2yr |   .0572434   .0267135     2.14   0.032     .0048827     .109604
  1.grad_4yr |   .1487772   .0241981     6.15   0.000      .101347    .1962074
       _cons |   1.506126   .1073847    14.03   0.000     1.295643    1.716609
-------------+----------------------------------------------------------------
     sigma_u |  .53360871
     sigma_e |  .35430725
         rho |  .69402331   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(16413, 20257) = 3.99                Prob > F = 0.0000

. predict wagepredspF if emp_spell_seq==1 & mi(comp_job_main) & wflg & female==
> 1
(option xb assumed; fitted values)
(168,589 missing values generated)

. replace wagepredspF = wagepredspF + `e(sigma_e)'*rnormal() if !mi(wagepredspF
> )
(2,107 real changes made)

. xtreg   wagetemp c.exper c.age c.cum_2yr c.cum_4yr b1997.year i.in_2yr i.in_4
> yr i.in_grad_school i.workPT i.grad_2yr i.grad_4yr if wflg & female==0, fe
note: 2015.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =     38721
Group variable: IDempspell                      Number of groups   =     16808

R-sq:  within  = 0.0491                         Obs per group: min =         1
       between = 0.1170                                        avg =       2.3
       overall = 0.1325                                        max =        18

                                                F(27,21886)        =     41.82
corr(u_i, Xb)  = 0.1075                         Prob > F           =    0.0000

------------------------------------------------------------------------------
    wagetemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |   .0306084   .0087148     3.51   0.000     .0135267    .0476901
         age |   .0278874   .0107859     2.59   0.010     .0067464    .0490285
     cum_2yr |  -.0076064    .010136    -0.75   0.453    -.0274736    .0122608
     cum_4yr |   .0165048   .0082974     1.99   0.047     .0002412    .0327684
             |
        year |
       1998  |   .1114876   .1224075     0.91   0.362      -.12844    .3514152
       1999  |   .2017317    .113298     1.78   0.075    -.0203406     .423804
       2000  |   .2118524   .1064231     1.99   0.047     .0032554    .4204494
       2001  |   .1970884   .0999851     1.97   0.049     .0011104    .3930665
       2002  |   .2566672    .092935     2.76   0.006     .0745078    .4388266
       2003  |   .2260233   .0859762     2.63   0.009     .0575038    .3945428
       2004  |   .2464422   .0790343     3.12   0.002     .0915292    .4013553
       2005  |   .2275555   .0720863     3.16   0.002     .0862612    .3688498
       2006  |   .2219635   .0651037     3.41   0.001     .0943555    .3495715
       2007  |   .2128995    .058159     3.66   0.000     .0989036    .3268954
       2008  |   .1606468   .0512818     3.13   0.002     .0601307    .2611629
       2009  |   .1233139   .0444797     2.77   0.006     .0361305    .2104973
       2010  |   .0960155   .0378023     2.54   0.011     .0219202    .1701108
       2011  |   .0799843   .0312452     2.56   0.010     .0187414    .1412273
       2012  |   .0728686   .0249948     2.92   0.004     .0238769    .1218602
       2013  |   .0263382   .0193352     1.36   0.173    -.0115603    .0642367
       2014  |   .0422996   .0147378     2.87   0.004     .0134124    .0711867
       2015  |          0  (omitted)
             |
    1.in_2yr |  -.0401761   .0195488    -2.06   0.040    -.0784932   -.0018589
    1.in_4yr |  -.0154225   .0202485    -0.76   0.446    -.0551109     .024266
1.in_grad_~l |   .0144796   .0322274     0.45   0.653    -.0486885    .0776477
    1.workPT |   .0488895    .012542     3.90   0.000     .0243064    .0734727
  1.grad_2yr |   .1246238   .0368028     3.39   0.001     .0524876      .19676
  1.grad_4yr |   .0735579   .0329024     2.24   0.025     .0090669    .1380489
       _cons |   1.819149   .1074006    16.94   0.000     1.608636    2.029662
-------------+----------------------------------------------------------------
     sigma_u |  .60915508
     sigma_e |  .41128528
         rho |  .68687968   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(16807, 21886) = 4.01                Prob > F = 0.0000

. predict wagepredsp  if emp_spell_seq==1 & mi(comp_job_main) & wflg & female==
> 0
(option xb assumed; fitted values)
(168,256 missing values generated)

. replace wagepredsp  = wagepredsp + `e(sigma_e)'*rnormal() if !mi(wagepredsp)
(2,440 real changes made)

. xtset ID year
       panel variable:  ID (strongly balanced)
        time variable:  year, 1997 to 2015
                delta:  1 unit

. drop IDempspell

. corr wagepredsp wagepred if female==0 & emp_spell_seq==1 & mi(comp_job_main) 
> & wflg
(obs=2,440)

             | wagepr~p wagepred
-------------+------------------
  wagepredsp |   1.0000
    wagepred |   0.1300   1.0000


. 
. * Use the predicted wages from the regressions as the 2012 or 2016 wage
. replace comp_job_main = 100*exp(wagepredspF) if female==1 & emp_spell_seq==1 
> & mi(comp_job_main) & wflg
(2,107 real changes made)

. replace comp_job_main = 100*exp(wagepredsp)  if female==0 & emp_spell_seq==1 
> & mi(comp_job_main) & wflg
(2,440 real changes made)

. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  892

. local feall = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`interp
> 2014'-`rep2015'-`s2015'-`fe2014'-`interpall'-`interpvi'-`interpni'-`interpwi'
> -`r(N)' // Impute (via FE regression) 2012 wage for those who were at the sam
> e employer in 2012 and 2013  

. 
. *=================================================
. * Case 5 (again): Interpolate wages within same employment spell
. *=================================================
. bys ID emp_spell (year): ipolate comp_job_main year, gen(comp_job_main_ipolat
> e)
(45673 missing values generated)

. replace comp_job_main = comp_job_main_ipolate if mi(comp_job_main) & wflg & !
> mi(comp_job_main_ipolate)
(1,397 real changes made)

. drop comp_job_main_ipolate

. * l ID year choice15 tempemp Main_job comp_job_main comp_job_main_ipolate Inc
> ome wagepred MIseq MIspell MIspellLength samejob same3jobs oldjob2012 singlej
> ob2012 newjob2012 if inlist(ID,58,95,180,1547,2341,2660,5698,8452) &  female=
> =0, sepby(ID)
. * l ID year choice15 tempemp Main_job comp_job_main compOct Income wagepred* 
> emp_spell_seq MIseq tempflag  if inlist(ID,8896,8916,6667,6766), sepby(ID) no
> l
. count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(avgHr
> sOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)
  592

. local interpfinal = ${initmisswage}-`interp2012'-`rep2013'-`s2013'-`fe2013'-`
> interp2014'-`rep2015'-`s2015'-`fe2014'-`interpall'-`interpvi'-`interpni'-`int
> erpwi'-`feall'-`r(N)' // (Again) interpolate missing wages within the same jo
> b spell 

. 
. *=================================================
. * Write results to file
. *=================================================
. * interpolation
. di "`interpfinal'"
300

. di "`interpvi'"
34

. di "`interpni'"
29

. di "`interpwi'"
463

. di "`interp2012'"
818

. di "`interp2014'"
820

. di "`interpall'"
289

. local ia = ${initmisswage}-(`interpfinal'+`interpvi'+`interpni'+`interpwi'+`i
> nterp2012'+`interp2014'+`interpall')

. di "`ia'"
2631

. file write wageappdx " & Remainder missing after interpolating missing wages 
> within the same job spell\tnote{b} &" %7.0fc (`ia') " & " %4.2f (`=100*`ia'/$
> {numworkobs}') " \\ "  _n

. 
. * next year wage if missing wage was end of job spell
. di "`s2013'"
107

. di "`s2015'"
93

. di "`rep2013'"
173

. di "`rep2015'"
151

. local ra = `ia'-(`s2013'+`s2015'+`rep2013'+`rep2015')

. di "`ra'"
2107

. file write wageappdx " & Remainder missing after using next-period reported w
> age for some of the missing wages\tnote{c} &" %7.0fc (`ra') " & " %4.2f (`=10
> 0*`ra'/${numworkobs}') " \\ "  _n

. 
. * imputation via FE regression
. di "`fe2012'"


. di "`fe2014'"
252

. di "`feall'"
1019

. local fa = `ra'-(`fe2012'+`fe2014'+`feall')

. di "`fa'"
836

. file write wageappdx " & Remainder missing after imputing (via FE regression)
>  prior-period wage for missing current-period wage under certain conditions\t
> note{d}  &" %7.0fc (`fa') " & " %4.2f (`=100*`fa'/${numworkobs}') " \\ "  _n

. 
. 
. 
end of do-file

. 
. 
. *=================================================
. * Bottom- and top-code wages at 2%, 99.5% 
. *=================================================
. * Convert Bottom- and top-code wages
. foreach wage in wageOct wageAltOct wage_job_main compOct compAltOct comp_job_
> main {
  2.     replace   `wage' = `wage'/100
  3.     qui mdesc `wage' if wflg & anyFlag==0
  4.     di "Percent of `wage' imputed using annual income: " %3.2f `=100*`r(pe
> rcent)''
  5.     replace   `wage' = Income/annualHrsWrkUse if mi(`wage') & wflg // move
> d this line up to impute before top-coding
  6.     egen upper`wage' = pctile(`wage'), p(99.5)
  7.     egen lower`wage' = pctile(`wage'), p(2.5)
  8.     replace   `wage' = upper`wage' if `wage'>=upper`wage' & ~mi(`wage')
  9.     replace   `wage' = lower`wage' if `wage'<=lower`wage' & ~mi(`wage')
 10. }
(96,450 real changes made)
Percent of wageOct imputed using annual income: 1.25
(416 real changes made)
(491 real changes made)
(2,454 real changes made)
(97,150 real changes made)
Percent of wageAltOct imputed using annual income: 1.54
(496 real changes made)
(492 real changes made)
(2,464 real changes made)
(101,886 real changes made, 2,402 to missing)
Percent of wage_job_main imputed using annual income: 19.70
(11,151 real changes made)
(557 real changes made)
(2,738 real changes made)
(92,362 real changes made)
Percent of compOct imputed using annual income: 4.01
(1,831 real changes made)
(485 real changes made)
(0 real changes made)
(93,212 real changes made)
Percent of compAltOct imputed using annual income: 5.74
(2,652 real changes made)
(481 real changes made)
(2,405 real changes made)
(117,681 real changes made, 4,118 to missing)
Percent of comp_job_main imputed using annual income: 2.62
(793 real changes made)
(574 real changes made)
(2,870 real changes made)

. 
. * new number of employment observations with missing wages after annual incom
> e imputation
. qui count if ~anyFlag & mi(comp_job_main) & (weeks_worked_Oct>=4) & inrange(a
> vgHrsOct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)

. file write wageappdx " & Remainder missing after imputing wages as annual inc
> ome / annual hours worked &" %7.0fc (`r(N)') " & " %4.2f (`=100*`r(N)'/${numw
> orkobs}') " \\ "  _n

. 
. * comp_job_main is the wage measure that we use in our final estimation
. * we use the annual income for those who are missing this variable at a rate 
> of (5978 / (5978+83214)) = 6.7%
. 
. *=================================================
. * Top-code transfers at $25,000 (to match Johnson)
. *=================================================
. * Convert Bottom- and top-code wages
. foreach trans in incParTransfer colParTransfer rentParTransfer {
  2.     replace   `trans' = 25000 if inrange(`trans',25000,.)
  3. }
(35 real changes made)
(59 real changes made)
(0 real changes made)

. replace colParTransfer = . if in_college==0
(147,596 real changes made, 147,596 to missing)

. 
. *=================================================
. * Rename wage variables
. *=================================================
. ren wage_job_main wage

. ren comp_job_main comp

. 
. gen log_wage       = ln(wage)
(59,176 missing values generated)

. gen log_wageOct    = ln(wageOct)
(72,406 missing values generated)

. gen log_wageAltOct = ln(wageAltOct)
(72,102 missing values generated)

. gen log_comp       = ln(comp)
(55,794 missing values generated)

. gen log_compOct    = ln(compOct)
(76,513 missing values generated)

. gen log_compAltOct = ln(compAltOct)
(74,365 missing values generated)

. 
. drop wflg MIspellLength numMIspells samejob oldjob singlejob tempflag MI* emp
> _spell*

. 
. *=================================================
. * Label some data that will be helpful later
. *=================================================
. lab def vlreasontookbreak 1 "To accelerate" 2 "To make up classes" 3 "For fun
> " 4 "For enrichment" 5 "Only time class was offered" 6 "For childcare" 7 "Oth
> er"

. lab val reasonTookClassDuringBreak vlreasontookbreak

. 
. *=================================================
. * Generate predicted SAT scores for those with missing SAT
. *=================================================
. 
. bys ID (year): gen firstObs = _n==1

. sum SAT???? asvab??, sep(0)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     SATmath |     66,652   -2.89e-09     .999865  -3.782305   2.362864
     SATverb |     66,044   -1.81e-09    .9998637   -2.21056    1.81312
     asvabAR |    135,147    1.28e-09    .9999334  -1.942594   1.962904
     asvabCS |    133,076    2.93e-09    .9999324  -2.599174   2.271833
     asvabMK |    134,767    3.74e-09    .9999332  -2.096103   1.779813
     asvabNO |    133,038   -6.86e-09    .9999323  -2.975442   1.252145
     asvabPC |    134,957   -2.18e-09    .9999333  -2.068778   1.446454
     asvabWK |    135,090    3.67e-11    .9999334  -2.619034   1.484721

.     regress SATmath_unscaled asvab?? if firstObs

      Source |       SS           df       MS      Number of obs   =     2,894
-------------+----------------------------------   F(6, 2887)      =    300.36
       Model |  16446349.1         6  2741058.18   Prob > F        =    0.0000
    Residual |  26346200.7     2,887  9125.80559   R-squared       =    0.3843
-------------+----------------------------------   Adj R-squared   =    0.3830
       Total |  42792549.8     2,893  14791.7559   Root MSE        =    95.529

------------------------------------------------------------------------------
SATmath_un~d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     asvabAR |    53.2814    3.15442    16.89   0.000     47.09626    59.46655
     asvabCS |   5.099416   2.408974     2.12   0.034     .3759345    9.822898
     asvabMK |   29.96666   3.596219     8.33   0.000     22.91525    37.01808
     asvabNO |  -4.373561   2.775498    -1.58   0.115     -9.81572    1.068598
     asvabPC |  -13.39577   3.555264    -3.77   0.000    -20.36689   -6.424663
     asvabWK |   16.74031   3.431997     4.88   0.000      10.0109    23.46972
       _cons |   459.7408   2.122665   216.59   0.000     455.5787    463.9029
------------------------------------------------------------------------------

. qui predict predSATmath, xb

. qui replace predSATmath = SATmath_unscaled if ~mi(SATmath_unscaled)

. 
.     regress SATverb_unscaled asvab?? if firstObs

      Source |       SS           df       MS      Number of obs   =     2,867
-------------+----------------------------------   F(6, 2860)      =    111.42
       Model |  12712780.2         6  2118796.69   Prob > F        =    0.0000
    Residual |  54388223.8     2,860  19016.8615   R-squared       =    0.1895
-------------+----------------------------------   Adj R-squared   =    0.1878
       Total |    67101004     2,866  23412.7718   Root MSE        =     137.9

------------------------------------------------------------------------------
SATverb_un~d |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     asvabAR |   35.52694   4.575411     7.76   0.000     26.55551    44.49838
     asvabCS |   3.734724   3.488634     1.07   0.284    -3.105768    10.57522
     asvabMK |   19.77546    5.21197     3.79   0.000     9.555864    29.99506
     asvabNO |  -3.194837   4.048854    -0.79   0.430     -11.1338     4.74413
     asvabPC |  -5.001156   5.187147    -0.96   0.335    -15.17208    5.169769
     asvabWK |   33.06166   5.001091     6.61   0.000     23.25555    42.86777
       _cons |   428.8776   3.102333   138.24   0.000     422.7945    434.9606
------------------------------------------------------------------------------

. qui predict predSATverb, xb

. qui replace predSATverb = SATverb_unscaled if ~mi(SATverb_unscaled)

. 
. sum predSAT*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 predSATmath |    144,704    461.2129    104.2789        200        800
 predSATverb |    144,609    431.1399    118.7522        200        800

. 
. * Z-score the semi-imputed SAT variables
. zscore  predSATmath if year==1997 & ~mi(predSATmath)
z_predSATmath created with 163080 missing values

. bys ID (year): egen predSATmathZ = mean(z_predSATmath)
(25992 missing values generated)

. drop z_predSATmath

. zscore  predSATverb if year==1997 & ~mi(predSATverb)
z_predSATverb created with 163085 missing values

. bys ID (year): egen predSATverbZ = mean(z_predSATverb)
(26087 missing values generated)

. drop z_predSATverb

. 
. gen m_wage = !anyFlag & mi(log_comp) & (weeks_worked_Oct>=4) & inrange(avgHrs
> Oct,10,.) & inlist(choice15,-2,1,2,4,5,7,8,10,11,13,14)

. gen m_GPA  = !anyFlag & mi(GPA)      & (inlist(choice15,-2) | inrange(choice1
> 5,1,9))

. gen m_maj  = !anyFlag & choice15==-2

. 
. sum m_wage if ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      m_wage |     33,825    .0109978    .1042936          0          1

. 
. bys ID (year): gen sum_m_wage = sum(m_wage)

. bys ID (year): gen sum_m_GPA  = sum(m_GPA )

. bys ID (year): gen sum_m_maj  = sum(m_maj )

. 
. gen bad_wage   = sum_m_wage>=1

. gen bad_grade  = sum_m_GPA >=2

. gen bad_major  = sum_m_maj >=2

. 
. sum grad_4yr if anyFlag==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    grad_4yr |     33,825    .1712639    .3767449          0          1

. xtsum ID if anyFlag==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4263.621   2515.416          2       9021 |     N =   33825
         between |             2508.058          2       9021 |     n =    2301
         within  |                    0   4263.621   4263.621 | T-bar = 14.7001

. sum grad_4yr if anyFlag==0 & bad_wage==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    grad_4yr |     32,301     .169066     .374816          0          1

. xtsum ID if anyFlag==0 & bad_wage==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4263.186   2515.455          2       9021 |     N =   32301
         between |             2508.433          2       9021 |     n =    2300
         within  |                    0   4263.186   4263.186 | T-bar = 14.0439

. sum grad_4yr if anyFlag==0 & bad_major==0 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    grad_4yr |     30,852    .1424219     .349488          0          1

. xtsum ID if anyFlag==0 & bad_major==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4313.048   2512.116          2       9021 |     N =   30852
         between |             2508.058          2       9021 |     n =    2301
         within  |                    0   4313.048   4313.048 | T-bar = 13.4081

. sum grad_4yr if anyFlag==0 & bad_major==0 & bad_wage==0 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    grad_4yr |     29,465    .1405057    .3475168          0          1

. xtsum ID if anyFlag==0 & bad_major==0 & bad_wage==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4310.069   2512.156          2       9021 |     N =   29465
         between |             2508.433          2       9021 |     n =    2300
         within  |                    0   4310.069   4310.069 | T-bar = 12.8109

. sum grad_4yr if anyFlag==0 & bad_major==0 & bad_wage==0 & bad_grade==0 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    grad_4yr |     22,398    .1101438    .3130759          0          1

. xtsum ID if anyFlag==0 & bad_major==0 & bad_wage==0 & bad_grade==0

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
ID       overall |  4392.229   2506.046          2       9021 |     N =   22398
         between |             2508.433          2       9021 |     n =    2300
         within  |                    0   4392.229   4392.229 | T-bar = 9.73826

. file write appendix "Drop observations after and including the first instance
>  of missing a wage while working, &            &       \\" _n 

. file write appendix "or after the first instance of a missing college major o
> r GPA                      &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. file write appendix "\midrule " _n 

. file write appendix "Final structural estimation subsample\tnote{a}          
>                            &" %7.0fc (`r(n)') "&" %7.0fc (`r(N)') " \\ "  _n

. file write appendix "\bottomrule " _n 

. file write appendix "\end{tabular} " _n 

. file write appendix "\begin{tablenotes} " _n 

. file write appendix "\item[a] \footnotesize{Our structural estimation procedu
> re incorporates integration of missing GPA and major observations, as discuss
> ed in Section \ref{subsec:intMissOutc}.} " _n 

. file write appendix "\end{tablenotes} " _n 

. file write appendix "\end{threeparttable} " _n 

. file write appendix "} " _n 

. file write appendix "\end{table} " _n 

. file write appendix " " _n 

. file write appendix "\end{landscape} " _n 

. file close appendix

. 
. * finish the wage table now that sample selection table is finished
. count if ~anyFlag & bad_grade==0 & bad_wage==0 & bad_major==0 & inlist(choice
> 15,1,2,4,5,7,8,10,11,13,14)
  14,937

. file write wageappdx "\midrule " _n 

. file write wageappdx "\multicolumn{2}{l}{Employed part- or full-time in final
>  sample} &" %7.0fc (`r(N)') " & 0.00 \\ "  _n

. file write wageappdx "\bottomrule " _n 

. file write wageappdx "\end{tabular} " _n 

. file write wageappdx "Notes: Each row of the table lists the remaining number
>  and percentage of employment observations that have missing wages after cumu
> latively taking the corresponding action described in the row and all rows ab
> ove it." _n 

. file write wageappdx "\begin{tablenotes}" _n 

. file write wageappdx "\item[a] Preliminary sample refers to our estimation su
> bsample prior to dropping missing wages, college grades, or college majors." 
> _n 

. file write wageappdx "\item[b] We linearly interpolate missing wages within t
> he same job spell. This occurs most frequently in waves after the survey swit
> ched to a biennial frequency (i.e. years after 2011)." _n 

. file write wageappdx "\item[c] We replace missing current-period wages with t
> he next-period wage in years 2012 and 2014 when the job spell ended in 2012 a
> nd 2014." _n 

. file write wageappdx "\item[d] We use a regression model with individual fixe
> d effects to fill in missing wage observations within the same employment spe
> ll that cannot be interpolated due to not having two endpoints. This occurs m
> ost frequently in years 2012 and 2014 that are not directly covered by the su
> rvey due to being in the biennially administered phase." _n 

. file write wageappdx "\end{tablenotes}" _n 

. file write wageappdx "\end{threeparttable} " _n 

. file write wageappdx "\end{table} " _n 

. file close wageappdx

. 
. * Make sure everyone in the sample is coded as being in HS the year before th
> ey enter the sample
. tab choice25 if anyFlag==0

                           Choice |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
     Missing 4-year college major |      1,246        3.68        3.68
            2yr & FT, blue collar |        695        2.05        5.74
           2yr & FT, white collar |         78        0.23        5.97
            2yr & PT, blue collar |        593        1.75        7.72
           2yr & PT, white collar |         41        0.12        7.84
                    2yr & No Work |        692        2.05        9.89
    4yr Science & FT, blue collar |        143        0.42       10.31
   4yr Science & FT, white collar |         50        0.15       10.46
    4yr Science & PT, blue collar |        278        0.82       11.28
   4yr Science & PT, white collar |         55        0.16       11.44
            4yr Science & No Work |        578        1.71       13.15
 4yr Humanities & FT, blue collar |        364        1.08       14.23
4yr Humanities & FT, white collar |         90        0.27       14.50
 4yr Humanities & PT, blue collar |        624        1.84       16.34
4yr Humanities & PT, white collar |        128        0.38       16.72
         4yr Humanities & No Work |      1,221        3.61       20.33
             Work PT, blue collar |      1,834        5.42       25.75
            Work PT, white collar |        276        0.82       26.57
             Work FT, blue collar |     12,742       37.67       64.24
            Work FT, white collar |      3,792       11.21       75.45
                             Home |      7,787       23.02       98.47
    Grad School & FT, blue collar |         62        0.18       98.65
   Grad School & FT, white collar |        171        0.51       99.16
    Grad School & PT, blue collar |         23        0.07       99.23
   Grad School & PT, white collar |         65        0.19       99.42
            Grad School & No Work |        197        0.58      100.00
----------------------------------+-----------------------------------
                            Total |     33,825      100.00

. bys ID (year): egen esttime  = seq() if anyFlag==0
(136871 missing values generated)

. gen esttime0 = 0

. bys ID (year):  replace esttime0 = 1 if esttime==. & esttime[_n+1]==1
(2,301 real changes made)

. l ID year anyFlag esttime choice25 Choice if ID==9021, sep(0)

        +----------------------------------------------------------------+
170659. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 1997 |       1 |       . |                 Middle or HS |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  1                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170660. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 1998 |       1 |       . |                 Middle or HS |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  1                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170661. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 1999 |       0 |       1 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170662. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2000 |       0 |       2 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170663. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2001 |       0 |       3 |        2yr & PT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  2                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170664. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2002 |       0 |       4 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170665. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2003 |       0 |       5 |        2yr & FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  2                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170666. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2004 |       0 |       6 |        2yr & FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  2                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170667. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2005 |       0 |       7 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170668. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2006 |       0 |       8 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170669. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2007 |       0 |       9 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170670. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2008 |       0 |      10 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170671. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2009 |       0 |      11 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170672. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2010 |       0 |      12 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170673. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2011 |       0 |      13 |         Work FT, blue collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170674. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2012 |       0 |      14 |        4yr Science & No Work |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  3                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170675. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2013 |       0 |      15 | Missing 4-year college major |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  3                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170676. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2014 |       0 |      16 | Missing 4-year college major |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  3                             |
        +----------------------------------------------------------------+

        +----------------------------------------------------------------+
170677. |   ID | year | anyFlag | esttime |                     choice25 |
        | 9021 | 2015 |       0 |      17 |        Work FT, white collar |
        |----------------------------------------------------------------|
        |                             Choice                             |
        |                                  4                             |
        +----------------------------------------------------------------+

. tab choice25 if esttime0==1

                           Choice |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
                     Middle or HS |      2,257       98.09       98.09
           2yr & PT, white collar |          1        0.04       98.13
             Work PT, blue collar |         11        0.48       98.61
             Work FT, blue collar |         11        0.48       99.09
            Work FT, white collar |          1        0.04       99.13
                             Home |         20        0.87      100.00
----------------------------------+-----------------------------------
                            Total |      2,301      100.00

. tab Choice   if esttime0==1

     Choice |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,257       98.09       98.09
          2 |          1        0.04       98.13
          4 |         23        1.00       99.13
          5 |         20        0.87      100.00
------------+-----------------------------------
      Total |      2,301      100.00

. replace choice25 = -1 if esttime0==1 & !inrange(choice25,-1,-1)
(44 real changes made)

. replace Choice   =  1 if esttime0==1 & !inrange(Choice  , 1, 1)
(44 real changes made)

. tab choice25 if esttime0==1

                           Choice |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
                     Middle or HS |      2,301      100.00      100.00
----------------------------------+-----------------------------------
                            Total |      2,301      100.00

. tab Choice   if esttime0==1

     Choice |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,301      100.00      100.00
------------+-----------------------------------
      Total |      2,301      100.00

. tab choice25 if anyFlag==0

                           Choice |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
     Missing 4-year college major |      1,246        3.68        3.68
            2yr & FT, blue collar |        695        2.05        5.74
           2yr & FT, white collar |         78        0.23        5.97
            2yr & PT, blue collar |        593        1.75        7.72
           2yr & PT, white collar |         41        0.12        7.84
                    2yr & No Work |        692        2.05        9.89
    4yr Science & FT, blue collar |        143        0.42       10.31
   4yr Science & FT, white collar |         50        0.15       10.46
    4yr Science & PT, blue collar |        278        0.82       11.28
   4yr Science & PT, white collar |         55        0.16       11.44
            4yr Science & No Work |        578        1.71       13.15
 4yr Humanities & FT, blue collar |        364        1.08       14.23
4yr Humanities & FT, white collar |         90        0.27       14.50
 4yr Humanities & PT, blue collar |        624        1.84       16.34
4yr Humanities & PT, white collar |        128        0.38       16.72
         4yr Humanities & No Work |      1,221        3.61       20.33
             Work PT, blue collar |      1,834        5.42       25.75
            Work PT, white collar |        276        0.82       26.57
             Work FT, blue collar |     12,742       37.67       64.24
            Work FT, white collar |      3,792       11.21       75.45
                             Home |      7,787       23.02       98.47
    Grad School & FT, blue collar |         62        0.18       98.65
   Grad School & FT, white collar |        171        0.51       99.16
    Grad School & PT, blue collar |         23        0.07       99.23
   Grad School & PT, white collar |         65        0.19       99.42
            Grad School & No Work |        197        0.58      100.00
----------------------------------+-----------------------------------
                            Total |     33,825      100.00

. tab choice25 if anyFlag==0 & bad_major==0 & bad_wage==0 & bad_grade==0

                           Choice |      Freq.     Percent        Cum.
----------------------------------+-----------------------------------
     Missing 4-year college major |        570        2.54        2.54
            2yr & FT, blue collar |        381        1.70        4.25
           2yr & FT, white collar |         33        0.15        4.39
            2yr & PT, blue collar |        407        1.82        6.21
           2yr & PT, white collar |         22        0.10        6.31
                    2yr & No Work |        429        1.92        8.22
    4yr Science & FT, blue collar |         80        0.36        8.58
   4yr Science & FT, white collar |         27        0.12        8.70
    4yr Science & PT, blue collar |        162        0.72        9.42
   4yr Science & PT, white collar |         29        0.13        9.55
            4yr Science & No Work |        368        1.64       11.20
 4yr Humanities & FT, blue collar |        167        0.75       11.94
4yr Humanities & FT, white collar |         40        0.18       12.12
 4yr Humanities & PT, blue collar |        350        1.56       13.68
4yr Humanities & PT, white collar |         58        0.26       13.94
         4yr Humanities & No Work |        669        2.99       16.93
             Work PT, blue collar |      1,461        6.52       23.45
            Work PT, white collar |        168        0.75       24.20
             Work FT, blue collar |      9,550       42.64       66.84
            Work FT, white collar |      1,837        8.20       75.04
                             Home |      5,327       23.78       98.83
    Grad School & FT, blue collar |         16        0.07       98.90
   Grad School & FT, white collar |         91        0.41       99.30
    Grad School & PT, blue collar |         10        0.04       99.35
   Grad School & PT, white collar |         48        0.21       99.56
            Grad School & No Work |         98        0.44      100.00
----------------------------------+-----------------------------------
                            Total |     22,398      100.00

. l ID year anyFlag esttime* choice25 Choice if ID==9021, sep(0)

        +--------------------------------------------+
170659. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 1997 |       1 |       . |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |                  Middle or HS  |       1   |
        +--------------------------------------------+

        +--------------------------------------------+
170660. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 1998 |       1 |       . |        1 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |                  Middle or HS  |       1   |
        +--------------------------------------------+

        +--------------------------------------------+
170661. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 1999 |       0 |       1 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170662. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2000 |       0 |       2 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170663. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2001 |       0 |       3 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |         2yr & PT, blue collar  |       2   |
        +--------------------------------------------+

        +--------------------------------------------+
170664. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2002 |       0 |       4 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170665. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2003 |       0 |       5 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |         2yr & FT, blue collar  |       2   |
        +--------------------------------------------+

        +--------------------------------------------+
170666. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2004 |       0 |       6 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |         2yr & FT, blue collar  |       2   |
        +--------------------------------------------+

        +--------------------------------------------+
170667. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2005 |       0 |       7 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170668. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2006 |       0 |       8 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170669. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2007 |       0 |       9 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170670. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2008 |       0 |      10 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170671. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2009 |       0 |      11 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170672. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2010 |       0 |      12 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170673. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2011 |       0 |      13 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |          Work FT, blue collar  |       4   |
        +--------------------------------------------+

        +--------------------------------------------+
170674. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2012 |       0 |      14 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |         4yr Science & No Work  |       3   |
        +--------------------------------------------+

        +--------------------------------------------+
170675. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2013 |       0 |      15 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |  Missing 4-year college major  |       3   |
        +--------------------------------------------+

        +--------------------------------------------+
170676. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2014 |       0 |      16 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |  Missing 4-year college major  |       3   |
        +--------------------------------------------+

        +--------------------------------------------+
170677. |   ID | year | anyFlag | esttime | esttime0 |
        | 9021 | 2015 |       0 |      17 |        0 |
        |--------------------------------------------|
        |                      choice25  |  Choice   |
        |         Work FT, white collar  |       4   |
        +--------------------------------------------+

. 
. gen lnFamIncAsTeen = ln(famIncAsTeen)
(27,607 missing values generated)

. 
. do calculateEFC

. *---------------------------------------------------------
. * EFC calculation
. *---------------------------------------------------------
. generat cpi_92 = 0.89420012

. generat cpi_97 = 1.0229446

. generat cpi_06 = 1.2848948

. 
. replace age_mom_born = . if age_mom_born<15
(646 real changes made, 646 to missing)

. generat age_older_parent = age_mom_born+18
(12,198 missing values generated)

. 
. generat famIncAsTeenEFC = famIncAsTeen*1000/cpi_97

. 
. generat efc = .
(170,696 missing values generated)

. replace efc = 0 if famIncAsTeenEFC<=(20000/cpi_06)
(60,610 real changes made)

. 
. replace HHsize1997 = . if HHsize1997<1
(0 real changes made)

. 
. * binned parental education for asset imputation
. generat father_educ = 1 if ((Feduc>0 & Feduc<12) | Feduc==95)
(139,745 missing values generated)

. replace father_educ = 2 if Feduc==12
(51,832 real changes made)

. replace father_educ = 3 if (Feduc>=13 & Feduc<16)
(24,567 real changes made)

. replace father_educ = 4 if (Feduc>=16 & Feduc<=20)
(27,930 real changes made)

. 
. generat mother_educ = 1 if ((Meduc>0 & Meduc<12) | Meduc==95)
(133,513 missing values generated)

. replace mother_educ = 2 if Meduc==12
(57,722 real changes made)

. replace mother_educ = 3 if (Meduc>=13 & Meduc<16)
(35,948 real changes made)

. replace mother_educ = 4 if (Meduc>=16 & Meduc<=20)
(26,657 real changes made)

. 
. egen max_educ = rowmax(father_educ mother_educ)
(9139 missing values generated)

. tab max_educ, gen(educ_)

   max_educ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     27,816       17.22       17.22
          2 |     54,891       33.98       51.19
          3 |     39,539       24.47       75.67
          4 |     39,311       24.33      100.00
------------+-----------------------------------
      Total |    161,557      100.00

. rename educ_2 hsgrad

. rename educ_3 some_college

. rename educ_4 college

. 
. * parents marital status
. generat mar_status = 1 if (marriedSp1==1 | marriedSp2==1 | marriedSp3==1)
(72,960 missing values generated)

. replace mar_status = 0 if mar_status==.
(72,960 real changes made)

. 
. generat rp1997 = Relationship_HH_head if year==1997
(161,743 missing values generated)

. bys ID (year): egen rel_par = mean(rp1997)
(589 missing values generated)

. drop rp1997

. generat married = 1 if mar_status==1 & rel_par==1
(97,508 missing values generated)

. replace married = 1 if mar_status==1 & rel_par==6
(1,311 real changes made)

. replace married = 0 if mar_status==0
(72,960 real changes made)

. replace married = 0 if mar_status==1 & (rel_par==2 | rel_par==3 | rel_par==4 
> | rel_par==5 | rel_par==7 | rel_par==8 | rel_par==9 | rel_par==10) 
(23,180 real changes made)

. 
. gen netWorthM=Family_net_worth1996/1000000
(44,935 missing values generated)

. gen netWorthM_sq=netWorthM^2
(44,935 missing values generated)

. 
. gen lnfamIncAsTeenEFC=log(famIncAsTeenEFC)
(27,607 missing values generated)

. 
. gen real_income=IncomePvs/cpi
(55,990 missing values generated)

. 
. gen prev_college = prev_4yr | prev_2yr

. tempfile pvinc

. preserve

.     collapse real_income, by(prev_FT prev_PT prev_college)

.     replace real_income = 0 if prev_FT==0 & prev_PT==0 
(2 real changes made)

.     l

     +-----------------------------------------+
     | prev_PT   prev_FT   prev_c~e   real_i~e |
     |-----------------------------------------|
  1. |       0         0          0          0 |
  2. |       0         0          1          0 |
  3. |       1         0          0   7886.488 |
  4. |       1         0          1   7867.752 |
  5. |       0         1          0   22695.64 |
     |-----------------------------------------|
  6. |       0         1          1   17368.89 |
  7. |       .         .          1   276.6541 |
     +-----------------------------------------+

.     ren real_income student_lag_income

.     save `pvinc', replace
(note: file /tmp/St812828.000001 not found)
file /tmp/St812828.000001 saved

. restore

. 
. merge m:1 prev_FT prev_PT prev_college using `pvinc', keep(match master) noge
> n

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           170,696  
    -----------------------------------------

. *HSV Average tax data
. sort ID year

. by ID: gen index=1 if _n==1
(161,712 missing values generated)

. egen mean_income_pre=mean(famIncAsTeenEFC) if index==1
(161712 missing values generated)

. egen mean_income=mean(mean_income_pre)

. gen share_m_income=famIncAsTeenEFC/mean_income

. ***************
. gen lambda_m1=0.910

. gen tau_m1=0.064

. gen tax2_married_1_ch = 1-lambda_m1*(share_m_income)^(-tau_m1) if married==1 
> & HH_size_under_18==1
(156,560 missing values generated)

. ***************
. gen lambda_m2=0.925

. gen tau_m2=0.070

. gen tax2_married_2_ch = 1-lambda_m2*(share_m_income)^(-tau_m2) if married==1 
> & HH_size_under_18==2
(142,709 missing values generated)

. ***************
. gen lambda_m3=0.940

. gen tau_m3=0.058

. gen tax2_married_3_ch = 1-lambda_m3*(share_m_income)^(-tau_m3) if married==1 
> & HH_size_under_18>=3
(145,787 missing values generated)

. ***************
. gen lambda_um1=0.926

. gen tau_um1=0.042

. gen tax2_unmarried_1_ch = 1-lambda_um1*(share_m_income)^(-tau_um1) if married
> ==0 & HH_size_under_18==1
(152,247 missing values generated)

. ***************
. gen lambda_um2=0.954

. gen tau_um2=0.027

. gen tax2_unmarried_2_ch = 1-lambda_um2*(share_m_income)^(-tau_um2) if married
> ==0 & HH_size_under_18==2
(145,198 missing values generated)

. ***************
. gen lambda_um3=0.965

. gen tau_um3=0.021

. gen tax2_unmarried_3_ch = 1-lambda_um3*(share_m_income)^(-tau_um3) if married
> ==0 & HH_size_under_18>=3
(138,662 missing values generated)

. ***************
. gen share_m_income_stud=student_lag_income/mean_income

. gen lambda_um0=0.882

. gen tau_um0=0.036

. gen tax2_unmarried_0_ch = 1-lambda_um0*(share_m_income_stud)^(-tau_um0) 
(75,460 missing values generated)

. replace tax2_unmarried_0_ch=0 if student_lag_income==0
(75,460 real changes made)

. ************
. 
. ***************
. *ALL MARRIED, JUST TO CHECK
. gen lambda_m_all=0.902

. gen tau_m_all=0.036

. gen tax2_married_all = 1-lambda_m_all*(share_m_income)^(-tau_m_all) if marrie
> d==1
(103,626 missing values generated)

. ************
. 
. gen tax2_rate=tax2_married_1_ch
(156,560 missing values generated)

. replace tax2_rate=tax2_married_2_ch if tax2_rate==.
(27,987 real changes made)

. replace tax2_rate=tax2_married_3_ch if tax2_rate==.
(24,909 real changes made)

. replace tax2_rate=tax2_unmarried_1_ch if tax2_rate==.
(18,449 real changes made)

. replace tax2_rate=tax2_unmarried_2_ch if tax2_rate==.
(25,498 real changes made)

. replace tax2_rate=tax2_unmarried_3_ch if tax2_rate==.
(32,034 real changes made)

. 
. replace tax2_rate=0 if tax2_rate<0
(16,245 real changes made)

. replace tax2_unmarried_0_ch=0 if tax2_unmarried_0_ch<0
(8,984 real changes made)

. 
. gen black_hsgrad=black*hsgrad
(9,139 missing values generated)

. gen black_some_college=black*some_college
(9,139 missing values generated)

. gen black_college=black*college
(9,139 missing values generated)

. 
. gen hispanic_hsgrad=hispanic*hsgrad
(9,139 missing values generated)

. gen hispanic_some_college=hispanic*some_college
(9,139 missing values generated)

. gen hispanic_college=hispanic*college
(9,139 missing values generated)

. 
. gen other = mixed

. gen other_hsgrad=other*hsgrad
(9,139 missing values generated)

. gen other_some_college=other*some_college
(9,139 missing values generated)

. gen other_college=other*college
(9,139 missing values generated)

. 
. reg age_mom_born i.father_educ

      Source |       SS           df       MS      Number of obs   =   128,896
-------------+----------------------------------   F(3, 128892)    =   3722.73
       Model |   293598.99         3    97866.33   Prob > F        =    0.0000
    Residual |   3388419.3   128,892  26.2888255   R-squared       =    0.0797
-------------+----------------------------------   Adj R-squared   =    0.0797
       Total |  3682018.29   128,895  28.5660288   Root MSE        =    5.1273

------------------------------------------------------------------------------
age_mom_born |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 father_educ |
          2  |  -.1213467   .0379486    -3.20   0.001    -.1957253   -.0469681
          3  |   1.446025   .0448964    32.21   0.000     1.358029    1.534022
          4  |   3.697654   .0432137    85.57   0.000     3.612956    3.782353
             |
       _cons |   24.84279   .0300426   826.92   0.000     24.78391    24.90167
------------------------------------------------------------------------------

. predict age_mom_born_f, xb
(35,416 missing values generated)

. 
. reg age_mom_born i.mother_educ

      Source |       SS           df       MS      Number of obs   =   151,677
-------------+----------------------------------   F(3, 151673)    =   3525.07
       Model |  289607.755         3  96535.9182   Prob > F        =    0.0000
    Residual |  4153647.76   151,673   27.385545   R-squared       =    0.0652
-------------+----------------------------------   Adj R-squared   =    0.0652
       Total |  4443255.52   151,676  29.2943875   Root MSE        =    5.2331

------------------------------------------------------------------------------
age_mom_born |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 mother_educ |
          2  |   .7724153   .0356421    21.67   0.000     .7025575    .8422731
          3  |   1.823666    .039555    46.10   0.000     1.746139    1.901193
          4  |    4.12029   .0427915    96.29   0.000     4.036419     4.20416
             |
       _cons |   24.14633   .0278974   865.54   0.000     24.09165    24.20101
------------------------------------------------------------------------------

. predict age_mom_born_p, xb
(13,186 missing values generated)

. 
. replace age_mom_born = age_mom_born_p if mi(age_mom_born)
variable age_mom_born was int now float
(12,160 real changes made, 6,327 to missing)

. replace age_older_parent = age_mom_born_p +18 if mi(age_older_parent)
(5,833 real changes made)

. replace age_older_parent = age_mom_born_f +18 if mi(age_older_parent)
(2,356 real changes made)

. 
. mdesc age_older_parent 
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
age_older_~t        4009      170696        .023486

. mdesc age_older_parent if ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
age_older_~t           0       33825              0

. 
. reg netWorthM lnfamIncAsTeen black hispanic other hsgrad some_college college
>  black_hsgrad black_some_college black_college hispanic_hsgrad hispanic_some_
> college hispanic_college other_hsgrad other_college other_some_college

      Source |       SS           df       MS      Number of obs   =   112,708
-------------+----------------------------------   F(16, 112691)   =   3116.76
       Model |  649.797841        16   40.612365   Prob > F        =    0.0000
    Residual |  1468.39963   112,691  .013030319   R-squared       =    0.3068
-------------+----------------------------------   Adj R-squared   =    0.3067
       Total |  2118.19748   112,707  .018793841   Root MSE        =    .11415

------------------------------------------------------------------------------
   netWorthM |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnfamIncAs~C |   .0383789   .0003279   117.05   0.000     .0377362    .0390215
       black |   .0104139   .0023923     4.35   0.000     .0057251    .0151027
    hispanic |   .0111616   .0020418     5.47   0.000     .0071597    .0151634
       other |    .120788   .0118312    10.21   0.000      .097599     .143977
      hsgrad |   .0342141   .0018808    18.19   0.000     .0305277    .0379004
some_college |   .0537128   .0019052    28.19   0.000     .0499786     .057447
     college |      .1293   .0018952    68.23   0.000     .1255854    .1330145
black_hsgrad |  -.0430283   .0027102   -15.88   0.000    -.0483402   -.0377164
black_some~e |  -.0604121   .0029141   -20.73   0.000    -.0661236   -.0547005
black_coll~e |  -.1121804   .0031972   -35.09   0.000    -.1184469   -.1059139
hispanic_h~d |  -.0339872   .0026483   -12.83   0.000    -.0391779   -.0287965
hispanic_s~e |  -.0490798   .0028105   -17.46   0.000    -.0545883   -.0435713
hispanic_c~e |    -.07932   .0030988   -25.60   0.000    -.0853936   -.0732465
other_hsgrad |  -.1399304   .0136522   -10.25   0.000    -.1666884   -.1131723
other_coll~e |  -.1596859   .0135452   -11.79   0.000    -.1862342   -.1331375
other_some~e |  -.1685102   .0134566   -12.52   0.000    -.1948849   -.1421355
       _cons |  -.3439246   .0036361   -94.59   0.000    -.3510514   -.3367979
------------------------------------------------------------------------------

. estimates save ${clnloc}netw.ster, replace
file ../../../data/nlsy97/cleaned/netw.ster saved

. predict netWorthM_p, xb
(34,067 missing values generated)

. 
. replace netWorthM = netWorthM_p if netWorthM==.
(23,921 real changes made)

. replace netWorthM_sq = netWorthM_p^2 if netWorthM_sq==.
(23,921 real changes made)

. 
. mdesc netWorthM lnfamIncAsTeen black hispanic other hsgrad some_college colle
> ge black_hsgrad black_some_college black_college hispanic_hsgrad hispanic_som
> e_college hispanic_college other_hsgrad other_college other_some_college
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
   netWorthM       21014      170696        .123108
lnfamIncAs~C       27607      170696        .161732
       black           0      170696              0
    hispanic           0      170696              0
       other           0      170696              0
      hsgrad        9139      170696         .05354
some_college        9139      170696         .05354
     college        9139      170696         .05354
black_hsgrad        9139      170696         .05354
black_some~e        9139      170696         .05354
black_coll~e        9139      170696         .05354
hispanic_h~d        9139      170696         .05354
hispanic_s~e        9139      170696         .05354
hispanic_c~e        9139      170696         .05354
other_hsgrad        9139      170696         .05354
other_coll~e        9139      170696         .05354
other_some~e        9139      170696         .05354

. 
. // this next line comes from the estimated regression coefficients of "reg ln
> EFCassets c.netWorthM##c.netWorthM lnFamInc b1.race##b1.educlev" in "create_s
> ipp.do"
. gen log_assets =  4.677884+netWorthM*5.255093+netWorthM_sq*(-1.913535)+lnfamI
> ncAsTeenEFC*0.3113251+black*(-0.1909873)+hispanic*(-0.348915)+other*(-0.83451
> 45)+ ///
>                   hsgrad*0.1705307+some_college*0.2982295+college*0.5590433+b
> lack_hsgrad*(-0.3508782)+black_some_college*(-0.3372525)+black_college*0.0192
> 319+ ///
>                   hispanic_hsgrad*0.3629062+hispanic_some_college*0.0815695+h
> ispanic_college*(-0.0038466)+other_hsgrad*0.806685+other_some_college*0.86944
> 67+ ///
>                   other_college*0.7000476
(34,067 missing values generated)

. 
. mdesc log_assets netWorthM lnfamIncAsTeen black hispanic other hsgrad some_co
> llege college black_hsgrad black_some_college black_college hispanic_hsgrad h
> ispanic_some_college hispanic_college other_hsgrad other_college other_some_c
> ollege if ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
  log_assets           0       33825              0
   netWorthM           0       33825              0
lnfamIncAs~C           0       33825              0
       black           0       33825              0
    hispanic           0       33825              0
       other           0       33825              0
      hsgrad           0       33825              0
some_college           0       33825              0
     college           0       33825              0
black_hsgrad           0       33825              0
black_some~e           0       33825              0
black_coll~e           0       33825              0
hispanic_h~d           0       33825              0
hispanic_s~e           0       33825              0
hispanic_c~e           0       33825              0
other_hsgrad           0       33825              0
other_coll~e           0       33825              0
other_some~e           0       33825              0

. 
. gen assets_tot=exp(log_assets)/cpi_97
(34,067 missing values generated)

. 
. replace assets_tot=0 if famIncAsTeenEFC<50000/cpi_06
(103,892 real changes made)

. 
. **********************
. *Parental Contribution
. **********************
. *Assume that number HH_size_under_18 in college is equal to 1 but we could ch
> ange this using the variable hh_size_under_18_97 (number of HH_size_under_18 
> under age 18 in 1997)
. gen HH_size_under_18_in_college=1

. 
. gen allowance_1=0.0765*famIncAsTeenEFC if famIncAsTeenEFC<(94200/cpi_06)
(24,130 missing values generated)

. replace allowance_1=0.0765*(94200/cpi_06) if famIncAsTeenEFC>=(94200/cpi_06)
(24,130 real changes made)

. gen allowance_2=tax2_rate*famIncAsTeenEFC
(27,683 missing values generated)

. gen allowance_3=0.06*famIncAsTeenEFC

. gen allowance_4=(10000/cpi_06)+HHsize1997*(3460/cpi_06)-HH_size_under_18*(246
> 0/cpi_06)

. gen allowance_5_pre=0.35*famIncAsTeenEFC

. gen allowance_5=(3100/cpi_06) if allowance_5_pre>=(3100/cpi_06)
(42,693 missing values generated)

. replace allowance_5=allowance_5_pre if allowance_5_pre<(3100/cpi_06)
(42,693 real changes made)

. 
. gen tot_allowances=allowance_1+allowance_2+allowance_3+allowance_4+allowance_
> 5 
(27,683 missing values generated)

. 
. gen available_parent_income=famIncAsTeenEFC-tot_allowances
(27,683 missing values generated)

. replace available_parent_income=0 if available_parent_income<0
(44,479 real changes made)

. 
. gen parent_assets=assets_tot/cpi_97
(2,261 missing values generated)

. gen asset_protection=(1732/cpi_06)*(age_older_parent-23) 
(4,009 missing values generated)

. replace asset_protection=asset_protection/2.3 if married==0
(93,176 real changes made)

. gen parent_contr_assets=(parent_assets-asset_protection)*0.12
(5,073 missing values generated)

. replace parent_contr_assets=0 if parent_contr_assets<0
(156,598 real changes made)

. 
. gen AAI_pre=parent_contr_assets+available_parent_income
(31,635 missing values generated)

. gen AAI=0.32*AAI_pre if AAI_pre<=(26000/cpi_06)
(80,541 missing values generated)

. replace AAI=0.47*AAI_pre if AAI_pre>(26000/cpi_06)
(48,906 real changes made)

. 
. gen parent_contribution= AAI/HH_size_under_18
(31,635 missing values generated)

. 
. 
. **********************
. *Student Contribution
. **********************
. 
. gen s_allowance_1=0.0765*student_lag_income if student_lag_income<(94200/cpi_
> 06)

. replace s_allowance_1=0.0765*(94200/cpi_06) if student_lag_income>=(94200/cpi
> _06)
(0 real changes made)

. gen s_allowance_2=tax2_unmarried_0_ch*student_lag_income

. gen s_allowance_3=0.03*student_lag_income

. gen s_tot_allowances=(2550/cpi_06)+s_allowance_1+s_allowance_2+s_allowance_3

. 
. 
. gen available_student_income=student_lag_income-s_tot_allowances

. replace available_student_income=0 if available_student_income<0
(84,444 real changes made)

. 
. gen student_contr_assets=0

. 
. gen student_contr_income=0.5*available_student_income

. 
. gen student_contribution=student_contr_income+student_contr_assets

. 
. * Final EFC number
. replace efc=parent_contribution+student_contribution if efc~=0
(107,084 real changes made)

. 
. 
. *---------------------------------------------------------
. * Net cost of college (given EFC)
. *---------------------------------------------------------
. gen     net_cost_4yr = .
(170,696 missing values generated)

. replace net_cost_4yr = 18966 if inrange(efc,0,405.303100585937)
(69,594 real changes made)

. replace net_cost_4yr = 19185.1 if inrange(efc,405.303100585937,822.0781860351
> 56)
(3,136 real changes made)

. replace net_cost_4yr = 19411.3 if inrange(efc,822.078186035156,1221.948730468
> 75)
(3,474 real changes made)

. replace net_cost_4yr = 19627.9 if inrange(efc,1221.94873046875,1564.912963867
> 18)
(1,999 real changes made)

. replace net_cost_4yr = 19813.9 if inrange(efc,1564.91296386718,1823.006835937
> 5)
(1,439 real changes made)

. replace net_cost_4yr = 19954.3 if inrange(efc,1823.0068359375,2168.4099121093
> 7)
(2,188 real changes made)

. replace net_cost_4yr = 20141.4 if inrange(efc,2168.40991210937,2354.84375)
(2,663 real changes made)

. replace net_cost_4yr = 20242.1 if inrange(efc,2354.84375,2637.3212890625)
(1,926 real changes made)

. replace net_cost_4yr = 20395.7 if inrange(efc,2637.3212890625,2830.279296875)
(1,427 real changes made)

. replace net_cost_4yr = 20500.4 if inrange(efc,2830.279296875,3063.10009765625
> )
(1,289 real changes made)

. replace net_cost_4yr = 20626.7 if inrange(efc,3063.10009765625,3282.674804687
> 5)
(1,434 real changes made)

. replace net_cost_4yr = 20745.6 if inrange(efc,3282.6748046875,3503.779296875)
(1,136 real changes made)

. replace net_cost_4yr = 20865.3 if inrange(efc,3503.779296875,3661.20849609375
> )
(609 real changes made)

. replace net_cost_4yr = 20951.2 if inrange(efc,3661.20849609375,3825.427734375
> )
(806 real changes made)

. replace net_cost_4yr = 21039.8 if inrange(efc,3825.427734375,3985.17944335937
> )
(637 real changes made)

. replace net_cost_4yr = 21126.6 if inrange(efc,3985.17944335937,4184.78125)
(764 real changes made)

. replace net_cost_4yr = 21234.8 if inrange(efc,4184.78125,4370.8671875)
(986 real changes made)

. replace net_cost_4yr = 21335.5 if inrange(efc,4370.8671875,4557.115234375)
(790 real changes made)

. replace net_cost_4yr = 21437 if inrange(efc,4557.115234375,4729.46923828125)
(559 real changes made)

. replace net_cost_4yr = 21530.2 if inrange(efc,4729.46923828125,4905.138183593
> 75)
(941 real changes made)

. replace net_cost_4yr = 21625.5 if inrange(efc,4905.13818359375,5071.370605468
> 75)
(1,084 real changes made)

. replace net_cost_4yr = 21715.6 if inrange(efc,5071.37060546875,5194.512207031
> 25)
(538 real changes made)

. replace net_cost_4yr = 21782.5 if inrange(efc,5194.51220703125,5374.283203125
> )
(746 real changes made)

. replace net_cost_4yr = 21880 if inrange(efc,5374.283203125,5553.9658203125)
(798 real changes made)

. replace net_cost_4yr = 21976.9 if inrange(efc,5553.9658203125,5736.5788574218
> 7)
(750 real changes made)

. replace net_cost_4yr = 22076.3 if inrange(efc,5736.57885742187,5878.374511718
> 75)
(450 real changes made)

. replace net_cost_4yr = 22153.4 if inrange(efc,5878.37451171875,6005.994140625
> )
(802 real changes made)

. replace net_cost_4yr = 22222.1 if inrange(efc,6005.994140625,6133.2353515625)
(545 real changes made)

. replace net_cost_4yr = 22291.6 if inrange(efc,6133.2353515625,6344.3227539062
> 5)
(779 real changes made)

. replace net_cost_4yr = 22406.1 if inrange(efc,6344.32275390625,6462.888671875
> )
(620 real changes made)

. replace net_cost_4yr = 22469.8 if inrange(efc,6462.888671875,6671.2373046875)
(741 real changes made)

. replace net_cost_4yr = 22583.2 if inrange(efc,6671.2373046875,6868.8974609375
> )
(539 real changes made)

. replace net_cost_4yr = 22690 if inrange(efc,6868.8974609375,7012.421875)
(401 real changes made)

. replace net_cost_4yr = 22768.1 if inrange(efc,7012.421875,7181.83837890625)
(699 real changes made)

. replace net_cost_4yr = 22859.7 if inrange(efc,7181.83837890625,7355.229980468
> 75)
(522 real changes made)

. replace net_cost_4yr = 22954.3 if inrange(efc,7355.22998046875,7574.854003906
> 25)
(580 real changes made)

. replace net_cost_4yr = 23073.1 if inrange(efc,7574.85400390625,7794.40234375)
(638 real changes made)

. replace net_cost_4yr = 23192.5 if inrange(efc,7794.40234375,8036.275390625)
(4,805 real changes made)

. replace net_cost_4yr = 23323.7 if inrange(efc,8036.275390625,8278.0703125)
(2,218 real changes made)

. replace net_cost_4yr = 23454.8 if inrange(efc,8278.0703125,8500.205078125)
(1,777 real changes made)

. replace net_cost_4yr = 23575.1 if inrange(efc,8500.205078125,8713.158203125)
(1,794 real changes made)

. replace net_cost_4yr = 23690.6 if inrange(efc,8713.158203125,8953.9599609375)
(1,950 real changes made)

. replace net_cost_4yr = 23820.9 if inrange(efc,8953.9599609375,9244.095703125)
(2,312 real changes made)

. replace net_cost_4yr = 23978.6 if inrange(efc,9244.095703125,9545.515625)
(2,029 real changes made)

. replace net_cost_4yr = 24141.9 if inrange(efc,9545.515625,9876.1103515625)
(2,357 real changes made)

. replace net_cost_4yr = 24321.5 if inrange(efc,9876.1103515625,10170.940429687
> 5)
(1,883 real changes made)

. replace net_cost_4yr = 24480.8 if inrange(efc,10170.9404296875,10493.70117187
> 5)
(1,677 real changes made)

. replace net_cost_4yr = 24655.8 if inrange(efc,10493.701171875,10725.28515625)
(1,213 real changes made)

. replace net_cost_4yr = 24781.7 if inrange(efc,10725.28515625,11085.814453125)
(1,948 real changes made)

. replace net_cost_4yr = 24977.1 if inrange(efc,11085.814453125,11408.552246093
> 7)
(1,180 real changes made)

. replace net_cost_4yr = 25152 if inrange(efc,11408.5522460937,11757.89453125)
(1,247 real changes made)

. replace net_cost_4yr = 25341.7 if inrange(efc,11757.89453125,11993.751953125)
(931 real changes made)

. replace net_cost_4yr = 25469.3 if inrange(efc,11993.751953125,12310.1484375)
(1,119 real changes made)

. replace net_cost_4yr = 25641.6 if inrange(efc,12310.1484375,12605.6259765625)
(991 real changes made)

. replace net_cost_4yr = 25801.2 if inrange(efc,12605.6259765625,12959.62695312
> 5)
(1,252 real changes made)

. replace net_cost_4yr = 25993.2 if inrange(efc,12959.626953125,13322.759765625
> )
(1,494 real changes made)

. replace net_cost_4yr = 26190.1 if inrange(efc,13322.759765625,13642.462890625
> )
(1,143 real changes made)

. replace net_cost_4yr = 26363.6 if inrange(efc,13642.462890625,14000.170898437
> 5)
(1,183 real changes made)

. replace net_cost_4yr = 26548.6 if inrange(efc,14000.1708984375,14404.39941406
> 25)
(1,402 real changes made)

. replace net_cost_4yr = 26750.7 if inrange(efc,14404.3994140625,14808.23828125
> )
(1,028 real changes made)

. replace net_cost_4yr = 26952.9 if inrange(efc,14808.23828125,15102.2509765625
> )
(753 real changes made)

. replace net_cost_4yr = 27099.8 if inrange(efc,15102.2509765625,15429.140625)
(646 real changes made)

. replace net_cost_4yr = 27263.1 if inrange(efc,15429.140625,15815.296875)
(799 real changes made)

. replace net_cost_4yr = 27456.2 if inrange(efc,15815.296875,16225.3193359375)
(808 real changes made)

. replace net_cost_4yr = 27661.1 if inrange(efc,16225.3193359375,16585.04882812
> 5)
(621 real changes made)

. replace net_cost_4yr = 27841.1 if inrange(efc,16585.048828125,16876.72265625)
(514 real changes made)

. replace net_cost_4yr = 27986.6 if inrange(efc,16876.72265625,17187.19921875)
(416 real changes made)

. replace net_cost_4yr = 28142.1 if inrange(efc,17187.19921875,17510.40234375)
(550 real changes made)

. replace net_cost_4yr = 28303.7 if inrange(efc,17510.40234375,17883.107421875)
(805 real changes made)

. replace net_cost_4yr = 28490.1 if inrange(efc,17883.107421875,18246.21484375)
(519 real changes made)

. replace net_cost_4yr = 28671.6 if inrange(efc,18246.21484375,18620.40234375)
(568 real changes made)

. replace net_cost_4yr = 28858.4 if inrange(efc,18620.40234375,18944.01171875)
(493 real changes made)

. replace net_cost_4yr = 29020.7 if inrange(efc,18944.01171875,19307.21484375)
(365 real changes made)

. replace net_cost_4yr = 29202.2 if inrange(efc,19307.21484375,19806.55078125)
(640 real changes made)

. replace net_cost_4yr = 29451.6 if inrange(efc,19806.55078125,20232.8818359375
> )
(580 real changes made)

. replace net_cost_4yr = 29664.5 if inrange(efc,20232.8818359375,20663.234375)
(477 real changes made)

. replace net_cost_4yr = 29879.9 if inrange(efc,20663.234375,21115.30078125)
(439 real changes made)

. replace net_cost_4yr = 30106.1 if inrange(efc,21115.30078125,21510.1015625)
(343 real changes made)

. replace net_cost_4yr = 30303.6 if inrange(efc,21510.1015625,21886.10546875)
(343 real changes made)

. replace net_cost_4yr = 30491.5 if inrange(efc,21886.10546875,22311.62109375)
(308 real changes made)

. replace net_cost_4yr = 30703.9 if inrange(efc,22311.62109375,22918.037109375)
(501 real changes made)

. replace net_cost_4yr = 31007.7 if inrange(efc,22918.037109375,23487.943359375
> )
(436 real changes made)

. replace net_cost_4yr = 31292 if inrange(efc,23487.943359375,24003.546875)
(300 real changes made)

. replace net_cost_4yr = 31550 if inrange(efc,24003.546875,24849.220703125)
(430 real changes made)

. replace net_cost_4yr = 31973.1 if inrange(efc,24849.220703125,25563.427734375
> )
(460 real changes made)

. replace net_cost_4yr = 32330 if inrange(efc,25563.427734375,26248.775390625)
(416 real changes made)

. replace net_cost_4yr = 32672.5 if inrange(efc,26248.775390625,27139.1171875)
(392 real changes made)

. replace net_cost_4yr = 33117.8 if inrange(efc,27139.1171875,28176.517578125)
(373 real changes made)

. replace net_cost_4yr = 33636.5 if inrange(efc,28176.517578125,29303.02734375)
(287 real changes made)

. replace net_cost_4yr = 34171.3 if inrange(efc,29303.02734375,30241.74609375)
(274 real changes made)

. replace net_cost_4yr = 34589.2 if inrange(efc,30241.74609375,31416.3125)
(314 real changes made)

. replace net_cost_4yr = 35112.4 if inrange(efc,31416.3125,32901.046875)
(332 real changes made)

. replace net_cost_4yr = 35773.9 if inrange(efc,32901.046875,34649.0546875)
(497 real changes made)

. replace net_cost_4yr = 36552.5 if inrange(efc,34649.0546875,36580.7265625)
(337 real changes made)

. replace net_cost_4yr = 37412.7 if inrange(efc,36580.7265625,39063.515625)
(758 real changes made)

. replace net_cost_4yr = 38518.5 if inrange(efc,39063.515625,42061.65625)
(637 real changes made)

. replace net_cost_4yr = 39575.1 if inrange(efc,42061.65625,46831.9921875)
(767 real changes made)

. replace net_cost_4yr = 40855.7 if inrange(efc,46831.9921875,75620.109375)
(724 real changes made)

. replace net_cost_4yr = 44932.4 if inrange(efc,75620.109375,80406.859375)
(190 real changes made)

. replace net_cost_4yr = 44932.4 if inrange(efc,80406.859375,85562.28125)
(146 real changes made)

. replace net_cost_4yr = 44932.4 if inrange(efc,85562.28125,.)
(174 real changes made)

. 
. 
. gen     net_cost_2yr = .
(170,696 missing values generated)

. replace net_cost_2yr = 4007.1 if inrange(famIncAsTeenEFC,0,30000)
(88,179 real changes made)

. replace net_cost_2yr = 4441.4 if inrange(famIncAsTeenEFC,30000,39999)
(18,487 real changes made)

. replace net_cost_2yr = 5545.6 if inrange(famIncAsTeenEFC,40000,49999)
(16,017 real changes made)

. replace net_cost_2yr = 5545.6 if inrange(famIncAsTeenEFC,50000,59999)
(12,901 real changes made)

. replace net_cost_2yr = 6496.5 if inrange(famIncAsTeenEFC,60000,699999)
(35,112 real changes made)

. replace net_cost_2yr = 6696.8 if inrange(famIncAsTeenEFC,70000,79999)
(8,550 real changes made)

. replace net_cost_2yr = 6862.2 if inrange(famIncAsTeenEFC,80000,89999)
(4,313 real changes made)

. replace net_cost_2yr = 7030.2 if inrange(famIncAsTeenEFC,90000,99999)
(3,306 real changes made)

. replace net_cost_2yr = 6739.8 if inrange(famIncAsTeenEFC,100000,.)
(10,222 real changes made)

. 
. *** figure out what missings are ***
. local efcvars efc student_lag_income tax2_rate tax2_unmarried_0_ch famIncAsTe
> enEFC HHsize1997 HH_size_under_18 assets_tot age_older_parent married

. mdesc `efcvars' if in_4yr & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
         efc           0        4777              0
student_la~e           0        4777              0
   tax2_rate           0        4777              0
tax2_un~0_ch           0        4777              0
famIncAsTe~C           0        4777              0
  HHsize1997           0        4777              0
HH_size_u~18           0        4777              0
  assets_tot           0        4777              0
age_older_~t           0        4777              0
     married           0        4777              0

. mdesc `efcvars' if in_2yr & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
         efc           0        2099              0
student_la~e           0        2099              0
   tax2_rate           0        2099              0
tax2_un~0_ch           0        2099              0
famIncAsTe~C           0        2099              0
  HHsize1997           0        2099              0
HH_size_u~18           0        2099              0
  assets_tot           0        2099              0
age_older_~t           0        2099              0
     married           0        2099              0

. 
. mdesc `efcvars' if in_4yr & mi(efc) & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
         efc           0           0              .
student_la~e           0           0              .
   tax2_rate           0           0              .
tax2_un~0_ch           0           0              .
famIncAsTe~C           0           0              .
  HHsize1997           0           0              .
HH_size_u~18           0           0              .
  assets_tot           0           0              .
age_older_~t           0           0              .
     married           0           0              .

. mdesc `efcvars' if in_2yr & mi(efc) & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
         efc           0           0              .
student_la~e           0           0              .
   tax2_rate           0           0              .
tax2_un~0_ch           0           0              .
famIncAsTe~C           0           0              .
  HHsize1997           0           0              .
HH_size_u~18           0           0              .
  assets_tot           0           0              .
age_older_~t           0           0              .
     married           0           0              .

. 
. count if in_college & ~anyFlag
  6,876

. sum efc if in_college & ~anyFlag, d

                             efc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,876
25%     2647.144              0       Sum of Wgt.       6,876

50%     7179.549                      Mean           9902.929
                        Largest       Std. Dev.      10903.36
75%     12858.24       80877.23
90%     22523.56       80877.23       Variance       1.19e+08
95%     33044.69       80877.23       Skewness       2.491212
99%     45740.66       81653.09       Kurtosis        12.2758

. sum efc if in_4yr & ~anyFlag, d

                             efc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,777
25%      2910.94              0       Sum of Wgt.       4,777

50%     7471.105                      Mean           10726.07
                        Largest       Std. Dev.      11802.48
75%     13917.84       79885.94
90%     25913.87       80877.23       Variance       1.39e+08
95%     37255.72       80877.23       Skewness       2.383824
99%     53483.02       81653.09       Kurtosis       11.03453

. sum efc if in_2yr & ~anyFlag, d

                             efc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,099
25%      2162.52              0       Sum of Wgt.       2,099

50%     6571.084                      Mean           8029.595
                        Largest       Std. Dev.      8210.469
75%     11240.03        51473.4
90%     17260.77       66006.88       Variance       6.74e+07
95%      22744.3       80877.23       Skewness       2.279284
99%     39241.85       80877.23       Kurtosis       12.87711

. 
. 
end of do-file

. 
. do imputeParTrans

. local efcvarname efc_new

. include recalculateEFC

. *---------------------------------------------------------
. * EFC calculation (only change taxes and income/asset protections)
. *---------------------------------------------------------
. generat `efcvarname' = .
(170,696 missing values generated)

. replace `efcvarname' = 0 if famIncAsTeenEFC<=(20000/cpi_06)
(60,610 real changes made)

. 
. capture drop index mean_income_pre mean_income share_m_income*

. capture drop lambda_* tau_* tax2_*

. 
. *HSV Average tax data
. sort ID year

. by ID: gen index=1 if _n==1
(161,712 missing values generated)

. egen mean_income_pre=mean(famIncAsTeenEFC) if index==1
(161712 missing values generated)

. egen mean_income=mean(mean_income_pre)

. gen share_m_income=famIncAsTeenEFC/mean_income

. ***************
. gen lambda_m1=0.910

. gen tau_m1=0.064

. gen tax2_married_1_ch = 1-lambda_m1*(share_m_income)^(-tau_m1) if married==1 
> & HH_size_under_18==1
(156,560 missing values generated)

. ***************
. gen lambda_m2=0.925

. gen tau_m2=0.070

. gen tax2_married_2_ch = 1-lambda_m2*(share_m_income)^(-tau_m2) if married==1 
> & HH_size_under_18==2
(142,709 missing values generated)

. ***************
. gen lambda_m3=0.940

. gen tau_m3=0.058

. gen tax2_married_3_ch = 1-lambda_m3*(share_m_income)^(-tau_m3) if married==1 
> & HH_size_under_18>=3
(145,787 missing values generated)

. ***************
. gen lambda_um1=0.926

. gen tau_um1=0.042

. gen tax2_unmarried_1_ch = 1-lambda_um1*(share_m_income)^(-tau_um1) if married
> ==0 & HH_size_under_18==1
(152,247 missing values generated)

. ***************
. gen lambda_um2=0.954

. gen tau_um2=0.027

. gen tax2_unmarried_2_ch = 1-lambda_um2*(share_m_income)^(-tau_um2) if married
> ==0 & HH_size_under_18==2
(145,198 missing values generated)

. ***************
. gen lambda_um3=0.965

. gen tau_um3=0.021

. gen tax2_unmarried_3_ch = 1-lambda_um3*(share_m_income)^(-tau_um3) if married
> ==0 & HH_size_under_18>=3
(138,662 missing values generated)

. ***************
. gen share_m_income_stud=student_lag_income/mean_income

. gen lambda_um0=0.882

. gen tau_um0=0.036

. gen tax2_unmarried_0_ch = 1-lambda_um0*(share_m_income_stud)^(-tau_um0) 
(75,460 missing values generated)

. replace tax2_unmarried_0_ch=0 if student_lag_income==0
(75,460 real changes made)

. ************
. 
. ***************
. *ALL MARRIED, JUST TO CHECK
. gen lambda_m_all=0.902

. gen tau_m_all=0.036

. gen tax2_married_all = 1-lambda_m_all*(share_m_income)^(-tau_m_all) if marrie
> d==1
(103,626 missing values generated)

. ************
. 
. gen tax2_rate=tax2_married_1_ch
(156,560 missing values generated)

. replace tax2_rate=tax2_married_2_ch if tax2_rate==.
(27,987 real changes made)

. replace tax2_rate=tax2_married_3_ch if tax2_rate==.
(24,909 real changes made)

. replace tax2_rate=tax2_unmarried_1_ch if tax2_rate==.
(18,449 real changes made)

. replace tax2_rate=tax2_unmarried_2_ch if tax2_rate==.
(25,498 real changes made)

. replace tax2_rate=tax2_unmarried_3_ch if tax2_rate==.
(32,034 real changes made)

. 
. replace tax2_rate=0 if tax2_rate<0
(16,245 real changes made)

. replace tax2_unmarried_0_ch=0 if tax2_unmarried_0_ch<0
(8,984 real changes made)

. 
. 
. **********************
. *Parental Contribution
. **********************
. capture drop allowance_* tot_allowances available_parent_income parent_assets
>  asset_protection parent_contr_assets AAI_pre AAI parent_contribution

. 
. gen allowance_1=0.0765*famIncAsTeenEFC if famIncAsTeenEFC<(94200/cpi_06)
(24,130 missing values generated)

. replace allowance_1=0.0765*(94200/cpi_06) if famIncAsTeenEFC>=(94200/cpi_06)
(24,130 real changes made)

. gen allowance_2=tax2_rate*famIncAsTeenEFC
(27,683 missing values generated)

. gen allowance_3=0.06*famIncAsTeenEFC

. gen allowance_4=(10000/cpi_06)+HHsize1997*(3460/cpi_06)-HH_size_under_18*(246
> 0/cpi_06)

. gen allowance_5_pre=0.35*famIncAsTeenEFC

. gen allowance_5=(3100/cpi_06) if allowance_5_pre>=(3100/cpi_06)
(42,693 missing values generated)

. replace allowance_5=allowance_5_pre if allowance_5_pre<(3100/cpi_06)
(42,693 real changes made)

. 
. gen tot_allowances=allowance_1+allowance_2+allowance_3+allowance_4+allowance_
> 5 
(27,683 missing values generated)

. 
. gen available_parent_income=famIncAsTeenEFC-tot_allowances
(27,683 missing values generated)

. replace available_parent_income=0 if available_parent_income<0
(44,479 real changes made)

. 
. gen parent_assets=assets_tot/cpi_97
(2,261 missing values generated)

. gen asset_protection=(1732/cpi_06)*(age_older_parent-23) 
(4,009 missing values generated)

. replace asset_protection=asset_protection/2.3 if married==0
(93,176 real changes made)

. gen parent_contr_assets=(parent_assets-asset_protection)*0.12
(5,073 missing values generated)

. replace parent_contr_assets=0 if parent_contr_assets<0
(156,598 real changes made)

. 
. gen AAI_pre=parent_contr_assets+available_parent_income
(31,635 missing values generated)

. gen AAI=0.32*AAI_pre if AAI_pre<=(26000/cpi_06)
(80,541 missing values generated)

. replace AAI=0.47*AAI_pre if AAI_pre>(26000/cpi_06)
(48,906 real changes made)

. 
. gen parent_contribution= AAI/HH_size_under_18_in_college
(31,635 missing values generated)

. 
. 
. **********************
. *Student Contribution
. **********************
. capture drop s_allowance_* s_tot_allowances available_student_income student_
> contr_assets student_contr_income student_contribution

. 
. gen s_allowance_1=0.0765*student_lag_income if student_lag_income<(94200/cpi_
> 06)

. replace s_allowance_1=0.0765*(94200/cpi_06) if student_lag_income>=(94200/cpi
> _06)
(0 real changes made)

. gen s_allowance_2=tax2_unmarried_0_ch*student_lag_income

. gen s_allowance_3=0.03*student_lag_income

. gen s_tot_allowances=(2550/cpi_06)+s_allowance_1+s_allowance_2+s_allowance_3

. 
. 
. gen available_student_income=student_lag_income-s_tot_allowances

. replace available_student_income=0 if available_student_income<0
(84,444 real changes made)

. 
. gen student_contr_assets=0

. 
. gen student_contr_income=0.5*available_student_income

. 
. gen student_contribution=student_contr_income+student_contr_assets

. 
. * Final EFC number
. replace `efcvarname'=parent_contribution+student_contribution if `efcvarname'
> ~=0
(107,084 real changes made)

. 
. 
. *---------------------------------------------------------
. * Net cost of college (given EFC)
. *---------------------------------------------------------
. capture drop net_cost_*

. gen     net_cost_4yr = .
(170,696 missing values generated)

. replace net_cost_4yr = 18966   if inrange(`efcvarname',0,405.303100585937)
(67,535 real changes made)

. replace net_cost_4yr = 19185.1 if inrange(`efcvarname',405.303100585937,822.0
> 78186035156)
(1,422 real changes made)

. replace net_cost_4yr = 19411.3 if inrange(`efcvarname',822.078186035156,1221.
> 94873046875)
(1,289 real changes made)

. replace net_cost_4yr = 19627.9 if inrange(`efcvarname',1221.94873046875,1564.
> 91296386718)
(1,040 real changes made)

. replace net_cost_4yr = 19813.9 if inrange(`efcvarname',1564.91296386718,1823.
> 0068359375)
(855 real changes made)

. replace net_cost_4yr = 19954.3 if inrange(`efcvarname',1823.0068359375,2168.4
> 0991210937)
(1,538 real changes made)

. replace net_cost_4yr = 20141.4 if inrange(`efcvarname',2168.40991210937,2354.
> 84375)
(2,179 real changes made)

. replace net_cost_4yr = 20242.1 if inrange(`efcvarname',2354.84375,2637.321289
> 0625)
(967 real changes made)

. replace net_cost_4yr = 20395.7 if inrange(`efcvarname',2637.3212890625,2830.2
> 79296875)
(834 real changes made)

. replace net_cost_4yr = 20500.4 if inrange(`efcvarname',2830.279296875,3063.10
> 009765625)
(834 real changes made)

. replace net_cost_4yr = 20626.7 if inrange(`efcvarname',3063.10009765625,3282.
> 6748046875)
(1,158 real changes made)

. replace net_cost_4yr = 20745.6 if inrange(`efcvarname',3282.6748046875,3503.7
> 79296875)
(966 real changes made)

. replace net_cost_4yr = 20865.3 if inrange(`efcvarname',3503.779296875,3661.20
> 849609375)
(671 real changes made)

. replace net_cost_4yr = 20951.2 if inrange(`efcvarname',3661.20849609375,3825.
> 427734375)
(735 real changes made)

. replace net_cost_4yr = 21039.8 if inrange(`efcvarname',3825.427734375,3985.17
> 944335937)
(781 real changes made)

. replace net_cost_4yr = 21126.6 if inrange(`efcvarname',3985.17944335937,4184.
> 78125)
(1,076 real changes made)

. replace net_cost_4yr = 21234.8 if inrange(`efcvarname',4184.78125,4370.867187
> 5)
(1,074 real changes made)

. replace net_cost_4yr = 21335.5 if inrange(`efcvarname',4370.8671875,4557.1152
> 34375)
(988 real changes made)

. replace net_cost_4yr = 21437   if inrange(`efcvarname',4557.115234375,4729.46
> 923828125)
(796 real changes made)

. replace net_cost_4yr = 21530.2 if inrange(`efcvarname',4729.46923828125,4905.
> 13818359375)
(656 real changes made)

. replace net_cost_4yr = 21625.5 if inrange(`efcvarname',4905.13818359375,5071.
> 37060546875)
(691 real changes made)

. replace net_cost_4yr = 21715.6 if inrange(`efcvarname',5071.37060546875,5194.
> 51220703125)
(682 real changes made)

. replace net_cost_4yr = 21782.5 if inrange(`efcvarname',5194.51220703125,5374.
> 283203125)
(745 real changes made)

. replace net_cost_4yr = 21880   if inrange(`efcvarname',5374.283203125,5553.96
> 58203125)
(1,178 real changes made)

. replace net_cost_4yr = 21976.9 if inrange(`efcvarname',5553.9658203125,5736.5
> 7885742187)
(664 real changes made)

. replace net_cost_4yr = 22076.3 if inrange(`efcvarname',5736.57885742187,5878.
> 37451171875)
(464 real changes made)

. replace net_cost_4yr = 22153.4 if inrange(`efcvarname',5878.37451171875,6005.
> 994140625)
(751 real changes made)

. replace net_cost_4yr = 22222.1 if inrange(`efcvarname',6005.994140625,6133.23
> 53515625)
(467 real changes made)

. replace net_cost_4yr = 22291.6 if inrange(`efcvarname',6133.2353515625,6344.3
> 2275390625)
(816 real changes made)

. replace net_cost_4yr = 22406.1 if inrange(`efcvarname',6344.32275390625,6462.
> 888671875)
(496 real changes made)

. replace net_cost_4yr = 22469.8 if inrange(`efcvarname',6462.888671875,6671.23
> 73046875)
(319 real changes made)

. replace net_cost_4yr = 22583.2 if inrange(`efcvarname',6671.2373046875,6868.8
> 974609375)
(295 real changes made)

. replace net_cost_4yr = 22690   if inrange(`efcvarname',6868.8974609375,7012.4
> 21875)
(166 real changes made)

. replace net_cost_4yr = 22768.1 if inrange(`efcvarname',7012.421875,7181.83837
> 890625)
(310 real changes made)

. replace net_cost_4yr = 22859.7 if inrange(`efcvarname',7181.83837890625,7355.
> 22998046875)
(248 real changes made)

. replace net_cost_4yr = 22954.3 if inrange(`efcvarname',7355.22998046875,7574.
> 85400390625)
(330 real changes made)

. replace net_cost_4yr = 23073.1 if inrange(`efcvarname',7574.85400390625,7794.
> 40234375)
(318 real changes made)

. replace net_cost_4yr = 23192.5 if inrange(`efcvarname',7794.40234375,8036.275
> 390625)
(4,262 real changes made)

. replace net_cost_4yr = 23323.7 if inrange(`efcvarname',8036.275390625,8278.07
> 03125)
(961 real changes made)

. replace net_cost_4yr = 23454.8 if inrange(`efcvarname',8278.0703125,8500.2050
> 78125)
(902 real changes made)

. replace net_cost_4yr = 23575.1 if inrange(`efcvarname',8500.205078125,8713.15
> 8203125)
(667 real changes made)

. replace net_cost_4yr = 23690.6 if inrange(`efcvarname',8713.158203125,8953.95
> 99609375)
(537 real changes made)

. replace net_cost_4yr = 23820.9 if inrange(`efcvarname',8953.9599609375,9244.0
> 95703125)
(807 real changes made)

. replace net_cost_4yr = 23978.6 if inrange(`efcvarname',9244.095703125,9545.51
> 5625)
(818 real changes made)

. replace net_cost_4yr = 24141.9 if inrange(`efcvarname',9545.515625,9876.11035
> 15625)
(1,507 real changes made)

. replace net_cost_4yr = 24321.5 if inrange(`efcvarname',9876.1103515625,10170.
> 9404296875)
(1,624 real changes made)

. replace net_cost_4yr = 24480.8 if inrange(`efcvarname',10170.9404296875,10493
> .701171875)
(1,530 real changes made)

. replace net_cost_4yr = 24655.8 if inrange(`efcvarname',10493.701171875,10725.
> 28515625)
(796 real changes made)

. replace net_cost_4yr = 24781.7 if inrange(`efcvarname',10725.28515625,11085.8
> 14453125)
(1,446 real changes made)

. replace net_cost_4yr = 24977.1 if inrange(`efcvarname',11085.814453125,11408.
> 5522460937)
(1,954 real changes made)

. replace net_cost_4yr = 25152   if inrange(`efcvarname',11408.5522460937,11757
> .89453125)
(1,550 real changes made)

. replace net_cost_4yr = 25341.7 if inrange(`efcvarname',11757.89453125,11993.7
> 51953125)
(1,277 real changes made)

. replace net_cost_4yr = 25469.3 if inrange(`efcvarname',11993.751953125,12310.
> 1484375)
(1,739 real changes made)

. replace net_cost_4yr = 25641.6 if inrange(`efcvarname',12310.1484375,12605.62
> 59765625)
(1,575 real changes made)

. replace net_cost_4yr = 25801.2 if inrange(`efcvarname',12605.6259765625,12959
> .626953125)
(1,489 real changes made)

. replace net_cost_4yr = 25993.2 if inrange(`efcvarname',12959.626953125,13322.
> 759765625)
(1,785 real changes made)

. replace net_cost_4yr = 26190.1 if inrange(`efcvarname',13322.759765625,13642.
> 462890625)
(1,640 real changes made)

. replace net_cost_4yr = 26363.6 if inrange(`efcvarname',13642.462890625,14000.
> 1708984375)
(1,377 real changes made)

. replace net_cost_4yr = 26548.6 if inrange(`efcvarname',14000.1708984375,14404
> .3994140625)
(1,798 real changes made)

. replace net_cost_4yr = 26750.7 if inrange(`efcvarname',14404.3994140625,14808
> .23828125)
(756 real changes made)

. replace net_cost_4yr = 26952.9 if inrange(`efcvarname',14808.23828125,15102.2
> 509765625)
(417 real changes made)

. replace net_cost_4yr = 27099.8 if inrange(`efcvarname',15102.2509765625,15429
> .140625)
(466 real changes made)

. replace net_cost_4yr = 27263.1 if inrange(`efcvarname',15429.140625,15815.296
> 875)
(567 real changes made)

. replace net_cost_4yr = 27456.2 if inrange(`efcvarname',15815.296875,16225.319
> 3359375)
(886 real changes made)

. replace net_cost_4yr = 27661.1 if inrange(`efcvarname',16225.3193359375,16585
> .048828125)
(585 real changes made)

. replace net_cost_4yr = 27841.1 if inrange(`efcvarname',16585.048828125,16876.
> 72265625)
(484 real changes made)

. replace net_cost_4yr = 27986.6 if inrange(`efcvarname',16876.72265625,17187.1
> 9921875)
(532 real changes made)

. replace net_cost_4yr = 28142.1 if inrange(`efcvarname',17187.19921875,17510.4
> 0234375)
(609 real changes made)

. replace net_cost_4yr = 28303.7 if inrange(`efcvarname',17510.40234375,17883.1
> 07421875)
(1,381 real changes made)

. replace net_cost_4yr = 28490.1 if inrange(`efcvarname',17883.107421875,18246.
> 21484375)
(987 real changes made)

. replace net_cost_4yr = 28671.6 if inrange(`efcvarname',18246.21484375,18620.4
> 0234375)
(1,032 real changes made)

. replace net_cost_4yr = 28858.4 if inrange(`efcvarname',18620.40234375,18944.0
> 1171875)
(849 real changes made)

. replace net_cost_4yr = 29020.7 if inrange(`efcvarname',18944.01171875,19307.2
> 1484375)
(1,140 real changes made)

. replace net_cost_4yr = 29202.2 if inrange(`efcvarname',19307.21484375,19806.5
> 5078125)
(1,344 real changes made)

. replace net_cost_4yr = 29451.6 if inrange(`efcvarname',19806.55078125,20232.8
> 818359375)
(1,164 real changes made)

. replace net_cost_4yr = 29664.5 if inrange(`efcvarname',20232.8818359375,20663
> .234375)
(1,074 real changes made)

. replace net_cost_4yr = 29879.9 if inrange(`efcvarname',20663.234375,21115.300
> 78125)
(966 real changes made)

. replace net_cost_4yr = 30106.1 if inrange(`efcvarname',21115.30078125,21510.1
> 015625)
(847 real changes made)

. replace net_cost_4yr = 30303.6 if inrange(`efcvarname',21510.1015625,21886.10
> 546875)
(946 real changes made)

. replace net_cost_4yr = 30491.5 if inrange(`efcvarname',21886.10546875,22311.6
> 2109375)
(827 real changes made)

. replace net_cost_4yr = 30703.9 if inrange(`efcvarname',22311.62109375,22918.0
> 37109375)
(1,049 real changes made)

. replace net_cost_4yr = 31007.7 if inrange(`efcvarname',22918.037109375,23487.
> 943359375)
(1,000 real changes made)

. replace net_cost_4yr = 31292   if inrange(`efcvarname',23487.943359375,24003.
> 546875)
(835 real changes made)

. replace net_cost_4yr = 31550   if inrange(`efcvarname',24003.546875,24849.220
> 703125)
(1,213 real changes made)

. replace net_cost_4yr = 31973.1 if inrange(`efcvarname',24849.220703125,25563.
> 427734375)
(1,074 real changes made)

. replace net_cost_4yr = 32330   if inrange(`efcvarname',25563.427734375,26248.
> 775390625)
(1,189 real changes made)

. replace net_cost_4yr = 32672.5 if inrange(`efcvarname',26248.775390625,27139.
> 1171875)
(1,220 real changes made)

. replace net_cost_4yr = 33117.8 if inrange(`efcvarname',27139.1171875,28176.51
> 7578125)
(1,199 real changes made)

. replace net_cost_4yr = 33636.5 if inrange(`efcvarname',28176.517578125,29303.
> 02734375)
(1,016 real changes made)

. replace net_cost_4yr = 34171.3 if inrange(`efcvarname',29303.02734375,30241.7
> 4609375)
(778 real changes made)

. replace net_cost_4yr = 34589.2 if inrange(`efcvarname',30241.74609375,31416.3
> 125)
(896 real changes made)

. replace net_cost_4yr = 35112.4 if inrange(`efcvarname',31416.3125,32901.04687
> 5)
(1,006 real changes made)

. replace net_cost_4yr = 35773.9 if inrange(`efcvarname',32901.046875,34649.054
> 6875)
(1,132 real changes made)

. replace net_cost_4yr = 36552.5 if inrange(`efcvarname',34649.0546875,36580.72
> 65625)
(738 real changes made)

. replace net_cost_4yr = 37412.7 if inrange(`efcvarname',36580.7265625,39063.51
> 5625)
(1,077 real changes made)

. replace net_cost_4yr = 38518.5 if inrange(`efcvarname',39063.515625,42061.656
> 25)
(929 real changes made)

. replace net_cost_4yr = 39575.1 if inrange(`efcvarname',42061.65625,46831.9921
> 875)
(1,014 real changes made)

. replace net_cost_4yr = 40855.7 if inrange(`efcvarname',46831.9921875,75620.10
> 9375)
(1,767 real changes made)

. replace net_cost_4yr = 44932.4 if inrange(`efcvarname',75620.109375,80406.859
> 375)
(1,007 real changes made)

. replace net_cost_4yr = 44932.4 if inrange(`efcvarname',80406.859375,85562.281
> 25)
(563 real changes made)

. replace net_cost_4yr = 44932.4 if inrange(`efcvarname',85562.28125,.)
(758 real changes made)

. 
. 
. gen     net_cost_2yr = .
(170,696 missing values generated)

. replace net_cost_2yr = 4007.1 if inrange(famIncAsTeenEFC,0,30000)
(88,179 real changes made)

. replace net_cost_2yr = 4441.4 if inrange(famIncAsTeenEFC,30000,39999)
(18,487 real changes made)

. replace net_cost_2yr = 5545.6 if inrange(famIncAsTeenEFC,40000,49999)
(16,017 real changes made)

. replace net_cost_2yr = 5545.6 if inrange(famIncAsTeenEFC,50000,59999)
(12,901 real changes made)

. replace net_cost_2yr = 6496.5 if inrange(famIncAsTeenEFC,60000,699999)
(35,112 real changes made)

. replace net_cost_2yr = 6696.8 if inrange(famIncAsTeenEFC,70000,79999)
(8,550 real changes made)

. replace net_cost_2yr = 6862.2 if inrange(famIncAsTeenEFC,80000,89999)
(4,313 real changes made)

. replace net_cost_2yr = 7030.2 if inrange(famIncAsTeenEFC,90000,99999)
(3,306 real changes made)

. replace net_cost_2yr = 6739.8 if inrange(famIncAsTeenEFC,100000,.)
(10,222 real changes made)

. 
. *** figure out what missings are ***
. local efcvars `efcvarname' student_lag_income tax2_rate tax2_unmarried_0_ch f
> amIncAsTeenEFC HHsize1997 HH_size_under_18 assets_tot age_older_parent marrie
> d

. mdesc `efcvars' if in_4yr
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
     efc_new         317       15137        .020942
student_la~e           0       15137              0
   tax2_rate        2361       15137        .155975
tax2_un~0_ch           0       15137              0
famIncAsTe~C           0       15137              0
  HHsize1997           0       15137              0
HH_size_u~18           0       15137              0
  assets_tot         271       15137        .017903
age_older_~t         319       15137        .021074
     married           0       15137              0

. mdesc `efcvars' if in_2yr
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
     efc_new         110        7963        .013814
student_la~e           0        7963              0
   tax2_rate        1354        7963        .170036
tax2_un~0_ch           0        7963              0
famIncAsTe~C           0        7963              0
  HHsize1997           0        7963              0
HH_size_u~18           0        7963              0
  assets_tot          93        7963        .011679
age_older_~t         174        7963        .021851
     married           0        7963              0

. 
. mdesc `efcvars' if in_4yr & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
     efc_new           0        4777              0
student_la~e           0        4777              0
   tax2_rate           0        4777              0
tax2_un~0_ch           0        4777              0
famIncAsTe~C           0        4777              0
  HHsize1997           0        4777              0
HH_size_u~18           0        4777              0
  assets_tot           0        4777              0
age_older_~t           0        4777              0
     married           0        4777              0

. mdesc `efcvars' if in_2yr & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
     efc_new           0        2099              0
student_la~e           0        2099              0
   tax2_rate           0        2099              0
tax2_un~0_ch           0        2099              0
famIncAsTe~C           0        2099              0
  HHsize1997           0        2099              0
HH_size_u~18           0        2099              0
  assets_tot           0        2099              0
age_older_~t           0        2099              0
     married           0        2099              0

. 
. mdesc `efcvars' if in_4yr & mi(`efcvarname')
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
     efc_new         317         317              1
student_la~e           0         317              0
   tax2_rate           4         317        .012618
tax2_un~0_ch           0         317              0
famIncAsTe~C           0         317              0
  HHsize1997           0         317              0
HH_size_u~18           0         317              0
  assets_tot         271         317         .85489
age_older_~t         181         317        .570978
     married           0         317              0

. mdesc `efcvars' if in_2yr & mi(`efcvarname')
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
     efc_new         110         110              1
student_la~e           0         110              0
   tax2_rate           1         110        .009091
tax2_un~0_ch           0         110              0
famIncAsTe~C           0         110              0
  HHsize1997           0         110              0
HH_size_u~18           0         110              0
  assets_tot          93         110        .845455
age_older_~t          75         110        .681818
     married           0         110              0

. 
. count if in_college
  23,100

. sum `efcvarname' if in_college, d

                           efc_new
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              22,673
25%            0              0       Sum of Wgt.      22,673

50%     7097.311                      Mean           12161.63
                        Largest       Std. Dev.      16036.36
75%     17841.72       160686.3
90%     29432.55       160686.3       Variance       2.57e+08
95%     40332.55       160686.3       Skewness       2.450368
99%     79655.97       160686.3       Kurtosis       11.17734

. 
. 
. 
. corr efc efc_new if in_college
(obs=22,673)

             |      efc  efc_new
-------------+------------------
         efc |   1.0000
     efc_new |   0.8833   1.0000


. 
. gen     recParTrans = inrange(rentParTransfer,1,.) | inrange(incParTransfer,1
> ,.) if in_college
(147,596 missing values generated)

. replace recParTrans = 0 if !in_college
(147,596 real changes made)

. 
. gen     parTrans = rentParTransfer + incParTransfer if in_college & recParTra
> ns
(156,506 missing values generated)

. gen   lnParTrans = ln(parTrans) if !mi(parTrans)
(156,506 missing values generated)

. 
. gen     incParTrans = incParTransfer if in_college & recParTrans
(156,448 missing values generated)

. gen   lnIncParTrans = ln(incParTrans) if !mi(incParTrans)
(162,513 missing values generated)

. 
. bys ID (year): gen sumRecParTrans = sum(l.recParTrans)

. gen everRecParTrans = sumRecParTrans>0

. 
. sum famIncAsTeenEFC if in_college, d

                       famIncAsTeenEFC
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              23,100
25%     11926.35              0       Sum of Wgt.      23,100

50%      39102.8                      Mean           47439.08
                        Largest       Std. Dev.      48547.37
75%     66358.09       428027.3
90%     98734.58       428027.3       Variance       2.36e+09
95%       131972       428027.3       Skewness        2.07518
99%     240945.6       428027.3       Kurtosis       9.214796

. 
. gen infour = in_4yr

. mdesc infour in_4yr
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
      infour           0      170696              0
      in_4yr           0      170696              0

. sum in_4yr

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      in_4yr |    170,696    .0886781    .2842794          0          1

. 
. gen aged0 = age<=0

. gen aged1 = age==1

. gen aged2 = age==2

. gen aged3 = age==3

. gen aged4 = age==4

. gen aged5 = age==5

. gen aged6 = age==6

. gen aged7 = age==7

. gen agesq = age^2

. qui replace agesq = -agesq if age<0

. 
. *logit recParTrans age c.famIncAsTeen##c.famIncAsTeen prev_4yr##c.famIncAsTee
> n   everRecParTrans black hispanic if in_college & ~anyFlag
. *logit recParTrans age lnFamIncAsTeen                 prev_4yr##c.lnFamIncAsT
> een everRecParTrans black hispanic if in_college & ~anyFlag
. logit recParTrans aged?       lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_4yr & ~anyFlag

Iteration 0:   log likelihood = -2908.6323  
Iteration 1:   log likelihood =  -2408.373  
Iteration 2:   log likelihood = -2391.9606  
Iteration 3:   log likelihood = -2391.8252  
Iteration 4:   log likelihood = -2391.8251  

Logistic regression                             Number of obs     =      4,777
                                                LR chi2(17)       =    1033.61
                                                Prob > chi2       =     0.0000
Log likelihood = -2391.8251                     Pseudo R2         =     0.1777

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   3.586339   .1883209    19.04   0.000     3.217237    3.955441
       aged1 |   3.389297   .1573655    21.54   0.000     3.080866    3.697728
       aged2 |   2.668775   .1368587    19.50   0.000     2.400537    2.937013
       aged3 |    2.31952   .1304629    17.78   0.000     2.063817    2.575222
       aged4 |   1.930654   .1308696    14.75   0.000     1.674155    2.187154
       aged5 |   1.586538   .1421434    11.16   0.000     1.307942    1.865134
       aged6 |    1.51585   .1611123     9.41   0.000     1.200076    1.831625
       aged7 |   1.340089   .1827269     7.33   0.000     .9819512    1.698227
lnFamIncAs~n |    .099016   .0407441     2.43   0.015      .019159     .178873
       black |   .1879983   .1070144     1.76   0.079    -.0217461    .3977427
    hispanic |   .1265303   .1103256     1.15   0.251     -.089704    .3427646
             |
  birth_year |
       1980  |   .2590859   .1185589     2.19   0.029     .0267148    .4914569
       1981  |   .1436797   .1112499     1.29   0.197     -.074366    .3617255
       1982  |   .1292867   .1123678     1.15   0.250    -.0909501    .3495236
       1983  |   .1323253   .1115397     1.19   0.235    -.0862885    .3509392
             |
Grades_HS_~t |  -.1219976   .0514792    -2.37   0.018     -.222895   -.0211002
Parent_col~e |   .1486544   .0766254     1.94   0.052    -.0015286    .2988375
       _cons |  -1.722099   .1958849    -8.79   0.000    -2.106027   -1.338172
------------------------------------------------------------------------------

. est sto pt4logit6

. logit recParTrans aged0-aged2 lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_4yr & ~anyFlag

Iteration 0:   log likelihood = -2908.6323  
Iteration 1:   log likelihood = -2610.0409  
Iteration 2:   log likelihood = -2596.8178  
Iteration 3:   log likelihood =   -2596.73  
Iteration 4:   log likelihood =   -2596.73  

Logistic regression                             Number of obs     =      4,777
                                                LR chi2(12)       =     623.80
                                                Prob > chi2       =     0.0000
Log likelihood =   -2596.73                     Pseudo R2         =     0.1072

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   2.085734   .1662493    12.55   0.000     1.759892    2.411577
       aged1 |   1.879351   .1297067    14.49   0.000     1.625131    2.133572
       aged2 |   1.152999   .1038384    11.10   0.000     .9494795    1.356518
lnFamIncAs~n |   .1501697   .0379629     3.96   0.000     .0757638    .2245755
       black |   .2191051   .0996526     2.20   0.028     .0237897    .4144205
    hispanic |   .0053681   .1020913     0.05   0.958    -.1947272    .2054634
             |
  birth_year |
       1980  |   .2619926   .1112053     2.36   0.018     .0440342     .479951
       1981  |   .1523215   .1046723     1.46   0.146    -.0528324    .3574754
       1982  |   .1565912   .1056175     1.48   0.138    -.0504153    .3635978
       1983  |   .2317098   .1056942     2.19   0.028      .024553    .4388666
             |
Grades_HS_~t |   .0972972   .0466736     2.08   0.037     .0058186    .1887759
Parent_col~e |   .2413721   .0721783     3.34   0.001     .0999053    .3828389
       _cons |  -.6241107    .168831    -3.70   0.000    -.9550134    -.293208
------------------------------------------------------------------------------

. est sto pt4logit5

. logit recParTrans age agesq   lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_4yr & ~anyFlag

Iteration 0:   log likelihood = -2908.6323  
Iteration 1:   log likelihood = -2381.0979  
Iteration 2:   log likelihood = -2372.0469  
Iteration 3:   log likelihood = -2371.9709  
Iteration 4:   log likelihood = -2371.9709  

Logistic regression                             Number of obs     =      4,777
                                                LR chi2(11)       =    1073.32
                                                Prob > chi2       =     0.0000
Log likelihood = -2371.9709                     Pseudo R2         =     0.1845

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.3992713   .0353033   -11.31   0.000    -.4684646    -.330078
       agesq |   .0051552   .0027844     1.85   0.064    -.0003022    .0106125
lnFamIncAs~n |   .1012694   .0406605     2.49   0.013     .0215763    .1809625
       black |   .1884937   .1081968     1.74   0.081    -.0235681    .4005555
    hispanic |    .153704   .1118643     1.37   0.169    -.0655461    .3729541
             |
  birth_year |
       1980  |   .3257332   .1201515     2.71   0.007     .0902405    .5612259
       1981  |   .1721395   .1115608     1.54   0.123    -.0465157    .3907946
       1982  |    .140593   .1123026     1.25   0.211     -.079516     .360702
       1983  |   .1316409   .1109565     1.19   0.235    -.0858298    .3491116
             |
Grades_HS_~t |  -.1463216   .0518339    -2.82   0.005    -.2479142    -.044729
Parent_col~e |   .1318342   .0770581     1.71   0.087    -.0191969    .2828652
       _cons |   1.817993   .2060487     8.82   0.000     1.414144    2.221841
------------------------------------------------------------------------------

. est sto pt4logit4

. logit recParTrans age         lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_4yr & ~anyFlag

Iteration 0:   log likelihood = -2908.6323  
Iteration 1:   log likelihood = -2381.1415  
Iteration 2:   log likelihood = -2373.6374  
Iteration 3:   log likelihood = -2373.6284  
Iteration 4:   log likelihood = -2373.6284  

Logistic regression                             Number of obs     =      4,777
                                                LR chi2(10)       =    1070.01
                                                Prob > chi2       =     0.0000
Log likelihood = -2373.6284                     Pseudo R2         =     0.1839

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.3392894   .0127869   -26.53   0.000    -.3643514   -.3142275
lnFamIncAs~n |   .1027496   .0406031     2.53   0.011      .023169    .1823302
       black |   .1883303   .1084163     1.74   0.082    -.0241619    .4008224
    hispanic |   .1572503   .1121777     1.40   0.161     -.062614    .3771145
             |
  birth_year |
       1980  |   .3340083    .120246     2.78   0.005     .0983305    .5696862
       1981  |    .176388   .1114552     1.58   0.114    -.0420603    .3948362
       1982  |   .1438666   .1121489     1.28   0.200    -.0759411    .3636744
       1983  |   .1292358   .1107029     1.17   0.243     -.087738    .3462096
             |
Grades_HS_~t |  -.1477024    .051896    -2.85   0.004    -.2494167   -.0459882
Parent_col~e |   .1280056   .0770293     1.66   0.097    -.0229689    .2789802
       _cons |    1.69521   .1938977     8.74   0.000     1.315178    2.075243
------------------------------------------------------------------------------

. est sto pt4logit3

. logit recParTrans age agesq   lnFamIncAsTeen black hispanic                  
>                               if in_4yr & ~anyFlag

Iteration 0:   log likelihood = -2908.6323  
Iteration 1:   log likelihood = -2389.8559  
Iteration 2:   log likelihood =  -2381.298  
Iteration 3:   log likelihood = -2381.2267  
Iteration 4:   log likelihood = -2381.2267  

Logistic regression                             Number of obs     =      4,777
                                                LR chi2(5)        =    1054.81
                                                Prob > chi2       =     0.0000
Log likelihood = -2381.2267                     Pseudo R2         =     0.1813

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    -.39526   .0352216   -11.22   0.000     -.464293    -.326227
       agesq |   .0054669   .0027898     1.96   0.050    -1.01e-06    .0109348
lnFamIncAs~n |   .1229723   .0392733     3.13   0.002      .045998    .1999466
       black |   .2601033   .1030297     2.52   0.012     .0581688    .4620378
    hispanic |   .1630086   .1110048     1.47   0.142    -.0545568     .380574
       _cons |   1.830593   .1896831     9.65   0.000     1.458821    2.202365
------------------------------------------------------------------------------

. est sto pt4logit2

. logit recParTrans age         lnFamIncAsTeen black hispanic                  
>                               if in_4yr & ~anyFlag

Iteration 0:   log likelihood = -2908.6323  
Iteration 1:   log likelihood = -2389.9282  
Iteration 2:   log likelihood = -2383.0869  
Iteration 3:   log likelihood = -2383.0801  
Iteration 4:   log likelihood = -2383.0801  

Logistic regression                             Number of obs     =      4,777
                                                LR chi2(4)        =    1051.10
                                                Prob > chi2       =     0.0000
Log likelihood = -2383.0801                     Pseudo R2         =     0.1807

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.3316555   .0123392   -26.88   0.000    -.3558399   -.3074711
lnFamIncAs~n |   .1240221   .0392163     3.16   0.002     .0471597    .2008846
       black |   .2617838   .1032214     2.54   0.011     .0594736    .4640941
    hispanic |   .1667502   .1113058     1.50   0.134    -.0514052    .3849057
       _cons |   1.701702   .1765958     9.64   0.000      1.35558    2.047823
------------------------------------------------------------------------------

. est sto pt4logit1

. estimates save ${clnloc}prPT4.ster, replace
file ../../../data/nlsy97/cleaned/prPT4.ster saved

. predict prParTrans4, pr                                                      
>   
(27,607 missing values generated)

. logit recParTrans aged?       lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_2yr & ~anyFlag

Iteration 0:   log likelihood =  -1334.885  
Iteration 1:   log likelihood = -1059.8281  
Iteration 2:   log likelihood =  -1050.809  
Iteration 3:   log likelihood = -1050.7736  
Iteration 4:   log likelihood = -1050.7736  

Logistic regression                             Number of obs     =      2,099
                                                LR chi2(17)       =     568.22
                                                Prob > chi2       =     0.0000
Log likelihood = -1050.7736                     Pseudo R2         =     0.2128

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   3.188229   .2587646    12.32   0.000     2.681059    3.695398
       aged1 |   3.095003   .2040785    15.17   0.000     2.695016    3.494989
       aged2 |   2.635752   .1899786    13.87   0.000     2.263401    3.008104
       aged3 |   2.149921    .193816    11.09   0.000     1.770049    2.529794
       aged4 |   1.627979   .1934102     8.42   0.000     1.248902    2.007056
       aged5 |    1.43937   .2124199     6.78   0.000     1.023034    1.855705
       aged6 |   .8933392   .2266433     3.94   0.000     .4491265    1.337552
       aged7 |   .8348718   .2223466     3.75   0.000     .3990804    1.270663
lnFamIncAs~n |   .1337746   .0548063     2.44   0.015     .0263562     .241193
       black |  -.0732003   .1495569    -0.49   0.625    -.3663265    .2199259
    hispanic |   .1874263   .1401745     1.34   0.181    -.0873106    .4621632
             |
  birth_year |
       1980  |   .0233066   .1796508     0.13   0.897    -.3288026    .3754157
       1981  |   .1465545   .1732044     0.85   0.397      -.19292     .486029
       1982  |   .0346392   .1792661     0.19   0.847    -.3167158    .3859942
       1983  |   .2163779   .1773606     1.22   0.222    -.1312424    .5639982
             |
Grades_HS_~t |  -.0151373    .074762    -0.20   0.840    -.1616681    .1313935
Parent_col~e |   .3817965   .1234075     3.09   0.002     .1399222    .6236707
       _cons |  -1.604944   .2622461    -6.12   0.000    -2.118937   -1.090951
------------------------------------------------------------------------------

. est sto pt2logit6

. logit recParTrans aged0-aged2 lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_2yr & ~anyFlag

Iteration 0:   log likelihood =  -1334.885  
Iteration 1:   log likelihood = -1148.8443  
Iteration 2:   log likelihood = -1141.8589  
Iteration 3:   log likelihood = -1141.8082  
Iteration 4:   log likelihood = -1141.8082  

Logistic regression                             Number of obs     =      2,099
                                                LR chi2(12)       =     386.15
                                                Prob > chi2       =     0.0000
Log likelihood = -1141.8082                     Pseudo R2         =     0.1446

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   2.243109   .2433521     9.22   0.000     1.766148    2.720071
       aged1 |     2.1505   .1840305    11.69   0.000     1.789807    2.511194
       aged2 |    1.69848   .1688602    10.06   0.000      1.36752     2.02944
lnFamIncAs~n |   .1391005   .0528176     2.63   0.008     .0355799     .242621
       black |  -.1114164   .1399156    -0.80   0.426     -.385646    .1628132
    hispanic |   .1015744   .1311862     0.77   0.439    -.1555458    .3586947
             |
  birth_year |
       1980  |  -.1285414   .1702022    -0.76   0.450    -.4621315    .2050487
       1981  |  -.0313578   .1629232    -0.19   0.847    -.3506815    .2879659
       1982  |  -.0379444    .170723    -0.22   0.824    -.3725554    .2966665
       1983  |   .0717472   .1686337     0.43   0.670    -.2587687    .4022632
             |
Grades_HS_~t |   .0829482   .0700622     1.18   0.236    -.0543712    .2202676
Parent_col~e |   .4022856   .1162459     3.46   0.001     .1744479    .6301234
       _cons |  -.5587826   .2344171    -2.38   0.017    -1.018232   -.0993336
------------------------------------------------------------------------------

. est sto pt2logit5

. logit recParTrans age agesq   lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_2yr & ~anyFlag

Iteration 0:   log likelihood =  -1334.885  
Iteration 1:   log likelihood = -1041.8013  
Iteration 2:   log likelihood =  -1036.858  
Iteration 3:   log likelihood = -1036.8312  
Iteration 4:   log likelihood = -1036.8312  

Logistic regression                             Number of obs     =      2,099
                                                LR chi2(11)       =     596.11
                                                Prob > chi2       =     0.0000
Log likelihood = -1036.8312                     Pseudo R2         =     0.2233

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.4086256   .0482879    -8.46   0.000     -.503268   -.3139831
       agesq |   .0079001   .0035181     2.25   0.025     .0010048    .0147954
lnFamIncAs~n |   .1257753   .0553196     2.27   0.023     .0173508    .2341997
       black |  -.0265989   .1521726    -0.17   0.861    -.3248517    .2716539
    hispanic |    .206299   .1425308     1.45   0.148    -.0730563    .4856542
             |
  birth_year |
       1980  |   .0798215   .1795871     0.44   0.657    -.2721628    .4318058
       1981  |   .2486611   .1741857     1.43   0.153    -.0927367    .5900588
       1982  |   .0877954   .1789927     0.49   0.624    -.2630239    .4386147
       1983  |   .2287824    .175466     1.30   0.192    -.1151245    .5726894
             |
Grades_HS_~t |  -.0494361   .0761226    -0.65   0.516    -.1986337    .0997614
Parent_col~e |   .3694078   .1241869     2.97   0.003     .1260059    .6128098
       _cons |    1.69766   .2627607     6.46   0.000     1.182659    2.212662
------------------------------------------------------------------------------

. est sto pt2logit4

. logit recParTrans age         lnFamIncAsTeen black hispanic b1984.birth_year 
> Grades_HS_best Parent_college if in_2yr & ~anyFlag

Iteration 0:   log likelihood =  -1334.885  
Iteration 1:   log likelihood = -1042.6909  
Iteration 2:   log likelihood = -1039.2777  
Iteration 3:   log likelihood = -1039.2715  
Iteration 4:   log likelihood = -1039.2715  

Logistic regression                             Number of obs     =      2,099
                                                LR chi2(10)       =     591.23
                                                Prob > chi2       =     0.0000
Log likelihood = -1039.2715                     Pseudo R2         =     0.2215

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.3075901   .0152283   -20.20   0.000     -.337437   -.2777432
lnFamIncAs~n |   .1233888   .0550921     2.24   0.025     .0154102    .2313674
       black |  -.0140513   .1522751    -0.09   0.926     -.312505    .2844024
    hispanic |   .2044198   .1429809     1.43   0.153    -.0758177    .4846572
             |
  birth_year |
       1980  |   .0928042   .1785731     0.52   0.603    -.2571927    .4428012
       1981  |   .2769916   .1732642     1.60   0.110       -.0626    .6165832
       1982  |   .0986636   .1779046     0.55   0.579     -.250023    .4473503
       1983  |   .2300544   .1740271     1.32   0.186    -.1110325    .5711412
             |
Grades_HS_~t |  -.0570182   .0761855    -0.75   0.454     -.206339    .0923026
Parent_col~e |   .3596422   .1240885     2.90   0.004     .1164333    .6028511
       _cons |   1.493005   .2435415     6.13   0.000     1.015672    1.970337
------------------------------------------------------------------------------

. est sto pt2logit3

. logit recParTrans age agesq   lnFamIncAsTeen black hispanic                  
>                               if in_2yr & ~anyFlag

Iteration 0:   log likelihood =  -1334.885  
Iteration 1:   log likelihood = -1047.4194  
Iteration 2:   log likelihood = -1042.8474  
Iteration 3:   log likelihood = -1042.8224  
Iteration 4:   log likelihood = -1042.8224  

Logistic regression                             Number of obs     =      2,099
                                                LR chi2(5)        =     584.13
                                                Prob > chi2       =     0.0000
Log likelihood = -1042.8224                     Pseudo R2         =     0.2188

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.4032368   .0479271    -8.41   0.000    -.4971723   -.3093014
       agesq |   .0077635   .0034777     2.23   0.026     .0009474    .0145795
lnFamIncAs~n |   .1560288   .0538889     2.90   0.004     .0504085     .261649
       black |  -.0583056   .1470782    -0.40   0.692    -.3465736    .2299624
    hispanic |   .1786527   .1398329     1.28   0.201    -.0954147    .4527201
       _cons |   1.827069   .2436146     7.50   0.000     1.349593    2.304544
------------------------------------------------------------------------------

. est sto pt2logit2

. logit recParTrans age         lnFamIncAsTeen black hispanic                  
>                               if in_2yr & ~anyFlag

Iteration 0:   log likelihood =  -1334.885  
Iteration 1:   log likelihood =  -1048.276  
Iteration 2:   log likelihood = -1045.2353  
Iteration 3:   log likelihood = -1045.2313  
Iteration 4:   log likelihood = -1045.2313  

Logistic regression                             Number of obs     =      2,099
                                                LR chi2(4)        =     579.31
                                                Prob > chi2       =     0.0000
Log likelihood = -1045.2313                     Pseudo R2         =     0.2170

------------------------------------------------------------------------------
 recParTrans |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.3034261   .0149327   -20.32   0.000    -.3326936   -.2741585
lnFamIncAs~n |   .1539419   .0536306     2.87   0.004     .0488278     .259056
       black |  -.0397682   .1468858    -0.27   0.787    -.3276591    .2481227
    hispanic |   .1832065   .1402643     1.31   0.192    -.0917065    .4581196
       _cons |   1.627587   .2238904     7.27   0.000     1.188769    2.066404
------------------------------------------------------------------------------

. est sto pt2logit1

. estimates save ${clnloc}prPT2.ster, replace
file ../../../data/nlsy97/cleaned/prPT2.ster saved

. predict prParTrans2, pr
(27,607 missing values generated)

. est table pt4logit1 pt4logit2 pt4logit3, b(%7.3f) star stats(N r2_p)

-----------------------------------------------------
    Variable | pt4logit1    pt4logit2    pt4logit3   
-------------+---------------------------------------
         age |  -0.332***    -0.395***    -0.339***  
lnFamIncAs~n |   0.124**      0.123**      0.103*    
       black |   0.262*       0.260*       0.188     
    hispanic |   0.167        0.163        0.157     
       agesq |                0.005                  
             |
  birth_year |
       1980  |                             0.334**   
       1981  |                             0.176     
       1982  |                             0.144     
       1983  |                             0.129     
             |
Grades_HS_~t |                            -0.148**   
Parent_col~e |                             0.128     
       _cons |   1.702***     1.831***     1.695***  
-------------+---------------------------------------
           N |    4777         4777         4777     
        r2_p |   0.181        0.181        0.184     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. est table pt4logit4 pt4logit5 pt4logit6, b(%7.3f) star stats(N r2_p)

-----------------------------------------------------
    Variable | pt4logit4    pt4logit5    pt4logit6   
-------------+---------------------------------------
         age |  -0.399***                            
       agesq |   0.005                               
lnFamIncAs~n |   0.101*       0.150***     0.099*    
       black |   0.188        0.219*       0.188     
    hispanic |   0.154        0.005        0.127     
             |
  birth_year |
       1980  |   0.326**      0.262*       0.259*    
       1981  |   0.172        0.152        0.144     
       1982  |   0.141        0.157        0.129     
       1983  |   0.132        0.232*       0.132     
             |
Grades_HS_~t |  -0.146**      0.097*      -0.122*    
Parent_col~e |   0.132        0.241***     0.149     
       aged0 |                2.086***     3.586***  
       aged1 |                1.879***     3.389***  
       aged2 |                1.153***     2.669***  
       aged3 |                             2.320***  
       aged4 |                             1.931***  
       aged5 |                             1.587***  
       aged6 |                             1.516***  
       aged7 |                             1.340***  
       _cons |   1.818***    -0.624***    -1.722***  
-------------+---------------------------------------
           N |    4777         4777         4777     
        r2_p |   0.185        0.107        0.178     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. est table pt2logit1 pt2logit2 pt2logit3, b(%7.3f) star stats(N r2_p)

-----------------------------------------------------
    Variable | pt2logit1    pt2logit2    pt2logit3   
-------------+---------------------------------------
         age |  -0.303***    -0.403***    -0.308***  
lnFamIncAs~n |   0.154**      0.156**      0.123*    
       black |  -0.040       -0.058       -0.014     
    hispanic |   0.183        0.179        0.204     
       agesq |                0.008*                 
             |
  birth_year |
       1980  |                             0.093     
       1981  |                             0.277     
       1982  |                             0.099     
       1983  |                             0.230     
             |
Grades_HS_~t |                            -0.057     
Parent_col~e |                             0.360**   
       _cons |   1.628***     1.827***     1.493***  
-------------+---------------------------------------
           N |    2099         2099         2099     
        r2_p |   0.217        0.219        0.221     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. est table pt2logit4 pt2logit5 pt2logit6, b(%7.3f) star stats(N r2_p)

-----------------------------------------------------
    Variable | pt2logit4    pt2logit5    pt2logit6   
-------------+---------------------------------------
         age |  -0.409***                            
       agesq |   0.008*                              
lnFamIncAs~n |   0.126*       0.139**      0.134*    
       black |  -0.027       -0.111       -0.073     
    hispanic |   0.206        0.102        0.187     
             |
  birth_year |
       1980  |   0.080       -0.129        0.023     
       1981  |   0.249       -0.031        0.147     
       1982  |   0.088       -0.038        0.035     
       1983  |   0.229        0.072        0.216     
             |
Grades_HS_~t |  -0.049        0.083       -0.015     
Parent_col~e |   0.369**      0.402***     0.382**   
       aged0 |                2.243***     3.188***  
       aged1 |                2.151***     3.095***  
       aged2 |                1.698***     2.636***  
       aged3 |                             2.150***  
       aged4 |                             1.628***  
       aged5 |                             1.439***  
       aged6 |                             0.893***  
       aged7 |                             0.835***  
       _cons |   1.698***    -0.559*      -1.605***  
-------------+---------------------------------------
           N |    2099         2099         2099     
        r2_p |   0.223        0.145        0.213     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. 
. 
. *reg lnParTrans age c.famIncAsTeen##c.famIncAsTeen b0.in_4yr##c.famIncAsTeen 
>   cum_college black hispanic if in_college & recParTrans & ~anyFlag
. *reg lnParTrans age lnFamIncAsTeen                 b0.in_4yr##c.lnFamIncAsTee
> n cum_college black hispanic if in_college & recParTrans & ~anyFlag
. *reg lnParTrans age lnFamIncAsTeen                                           
>   cum_college black hispanic if in_4yr     & recParTrans & ~anyFlag
. 
. 
. reg lnParTrans aged?       lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_2yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     1,382
-------------+----------------------------------   F(18, 1363)     =      3.41
       Model |  61.9645473        18  3.44247485   Prob > F        =    0.0000
    Residual |  1374.18687     1,363  1.00820754   R-squared       =    0.0431
-------------+----------------------------------   Adj R-squared   =    0.0305
       Total |  1436.15142     1,381  1.03993586   Root MSE        =    1.0041

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   .6549537   .1327243     4.93   0.000     .3945876    .9153197
       aged1 |    .547658    .119635     4.58   0.000     .3129693    .7823468
       aged2 |   .4857174   .1172521     4.14   0.000     .2557032    .7157316
       aged3 |   .3488889   .1221481     2.86   0.004     .1092702    .5885075
       aged4 |   .2639808   .1306907     2.02   0.044     .0076041    .5203576
       aged5 |  -.0680013     .14424    -0.47   0.637    -.3509577    .2149551
       aged6 |  -.0111854    .166928    -0.07   0.947     -.338649    .3162782
       aged7 |    .009091   .1663841     0.05   0.956    -.3173057    .3354877
lnFamIncAs~n |   .0288995   .0280593     1.03   0.303    -.0261446    .0839436
 cum_college |   .0524967   .0216944     2.42   0.016     .0099387    .0950547
       black |  -.0707472   .0782954    -0.90   0.366    -.2243397    .0828453
    hispanic |   .0618132    .073425     0.84   0.400    -.0822251    .2058516
             |
  birth_year |
       1980  |   .0239694    .090477     0.26   0.791    -.1535199    .2014587
       1981  |   .1068115   .0869178     1.23   0.219    -.0636957    .2773188
       1982  |   .1076799   .0892971     1.21   0.228    -.0674948    .2828546
       1983  |    .021011   .0860111     0.24   0.807    -.1477174    .1897395
             |
Grades_HS_~t |  -.0625614    .038353    -1.63   0.103    -.1377988    .0126759
Parent_col~e |  -.0200977    .060348    -0.33   0.739    -.1384827    .0982873
       _cons |   8.056967   .1648998    48.86   0.000     7.733482    8.380452
------------------------------------------------------------------------------

. est sto pt2reg6

. reg lnParTrans aged0-aged2 lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_2yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     1,382
-------------+----------------------------------   F(13, 1368)     =      3.49
       Model |  46.0576874        13  3.54289903   Prob > F        =    0.0000
    Residual |  1390.09373     1,368  1.01615039   R-squared       =    0.0321
-------------+----------------------------------   Adj R-squared   =    0.0229
       Total |  1436.15142     1,381  1.03993586   Root MSE        =     1.008

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   .4631393   .0958126     4.83   0.000     .2751837    .6510949
       aged1 |    .363929   .0792643     4.59   0.000     .2084363    .5194217
       aged2 |   .3165178   .0795094     3.98   0.000     .1605441    .4724914
lnFamIncAs~n |   .0305678   .0281026     1.09   0.277    -.0245611    .0856966
 cum_college |   .0295417   .0207313     1.42   0.154    -.0111268    .0702103
       black |   -.059441   .0781716    -0.76   0.447    -.2127902    .0939081
    hispanic |   .0641061    .073683     0.87   0.384    -.0804377    .2086499
             |
  birth_year |
       1980  |   .0109199   .0905782     0.12   0.904    -.1667673    .1886072
       1981  |   .1202078   .0868448     1.38   0.167    -.0501556    .2905712
       1982  |   .1146268   .0895168     1.28   0.201    -.0609782    .2902317
       1983  |   .0207871   .0863288     0.24   0.810    -.1485642    .1901383
             |
Grades_HS_~t |  -.0507338   .0383132    -1.32   0.186    -.1258927    .0244251
Parent_col~e |  -.0057288   .0603875    -0.09   0.924    -.1241908    .1127333
       _cons |   8.233913   .1341647    61.37   0.000     7.970722    8.497104
------------------------------------------------------------------------------

. est sto pt2reg5

. reg lnParTrans age agesq   lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_2yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     1,382
-------------+----------------------------------   F(12, 1369)     =      4.87
       Model |  58.7813702        12  4.89844752   Prob > F        =    0.0000
    Residual |  1377.37005     1,369  1.00611399   R-squared       =    0.0409
-------------+----------------------------------   Adj R-squared   =    0.0325
       Total |  1436.15142     1,381  1.03993586   Root MSE        =    1.0031

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.1693101   .0282724    -5.99   0.000     -.224772   -.1138482
       agesq |   .0097761   .0023403     4.18   0.000     .0051851    .0143672
lnFamIncAs~n |    .029673   .0279581     1.06   0.289    -.0251724    .0845184
 cum_college |   .0488501   .0216839     2.25   0.024     .0063128    .0913873
       black |  -.0681289   .0779482    -0.87   0.382    -.2210398     .084782
    hispanic |   .0601805   .0732311     0.82   0.411    -.0834768    .2038378
             |
  birth_year |
       1980  |    .021484   .0901915     0.24   0.812    -.1554445    .1984125
       1981  |   .1168465   .0864157     1.35   0.177     -.052675     .286368
       1982  |   .1174074   .0888807     1.32   0.187    -.0569496    .2917645
       1983  |   .0280995   .0857489     0.33   0.743    -.1401139     .196313
             |
Grades_HS_~t |  -.0585417   .0382772    -1.53   0.126    -.1336301    .0165466
Parent_col~e |    -.01847   .0600324    -0.31   0.758    -.1362355    .0992955
       _cons |   8.766873   .1307725    67.04   0.000     8.510337     9.02341
------------------------------------------------------------------------------

. est sto pt2reg4

. reg lnParTrans age         lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_2yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     1,382
-------------+----------------------------------   F(11, 1370)     =      3.68
       Model |  41.2255184        11   3.7477744   Prob > F        =    0.0000
    Residual |   1394.9259     1,370  1.01819409   R-squared       =    0.0287
-------------+----------------------------------   Adj R-squared   =    0.0209
       Total |  1436.15142     1,381  1.03993586   Root MSE        =    1.0091

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0614677   .0115937    -5.30   0.000    -.0842111   -.0387243
lnFamIncAs~n |    .030382   .0281249     1.08   0.280    -.0247905    .0855546
 cum_college |   .0313772    .021404     1.47   0.143    -.0106109    .0733654
       black |  -.0478276   .0782622    -0.61   0.541    -.2013543    .1056992
    hispanic |   .0589734   .0736688     0.80   0.424    -.0855426    .2034893
             |
  birth_year |
       1980  |   .0253813   .0907265     0.28   0.780    -.1525965    .2033591
       1981  |   .1327126   .0868489     1.53   0.127    -.0376586    .3030839
       1982  |   .1101921   .0893958     1.23   0.218    -.0651754    .2855595
       1983  |   .0252263   .0862593     0.29   0.770    -.1439884     .194441
             |
Grades_HS_~t |   -.059927   .0385049    -1.56   0.120    -.1354619    .0156079
Parent_col~e |   -.016277   .0603894    -0.27   0.788    -.1347428    .1021888
       _cons |   8.627883   .1272256    67.82   0.000     8.378304    8.877461
------------------------------------------------------------------------------

. est sto pt2reg3

. reg lnParTrans age agesq   lnFamIncAsTeen cum_college black hispanic         
>                                        if in_2yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     1,382
-------------+----------------------------------   F(6, 1375)      =      8.80
       Model |  53.1001438         6  8.85002396   Prob > F        =    0.0000
    Residual |  1383.05128     1,375  1.00585548   R-squared       =    0.0370
-------------+----------------------------------   Adj R-squared   =    0.0328
       Total |  1436.15142     1,381  1.03993586   Root MSE        =    1.0029

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.1689008    .028197    -5.99   0.000    -.2242146   -.1135869
       agesq |   .0098947    .002334     4.24   0.000     .0053162    .0144733
lnFamIncAs~n |   .0324551   .0274644     1.18   0.238    -.0214216    .0863319
 cum_college |   .0486732   .0213835     2.28   0.023     .0067254    .0906211
       black |  -.0401739   .0756161    -0.53   0.595    -.1885094    .1081615
    hispanic |   .0904449     .07099     1.27   0.203    -.0488155    .2297053
       _cons |   8.792095   .1204008    73.02   0.000     8.555906    9.028284
------------------------------------------------------------------------------

. est sto pt2reg2

. reg lnParTrans age         lnFamIncAsTeen cum_college black hispanic         
>                                        if in_2yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     1,382
-------------+----------------------------------   F(5, 1376)      =      6.88
       Model |   35.022101         5   7.0044202   Prob > F        =    0.0000
    Residual |  1401.12932     1,376  1.01826259   R-squared       =    0.0244
-------------+----------------------------------   Adj R-squared   =    0.0208
       Total |  1436.15142     1,381  1.03993586   Root MSE        =    1.0091

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.0595774   .0114758    -5.19   0.000    -.0820895   -.0370654
lnFamIncAs~n |    .033434   .0276323     1.21   0.227     -.020772    .0876401
 cum_college |   .0311122   .0211075     1.47   0.141    -.0102941    .0725185
       black |   -.020076   .0759314    -0.26   0.792    -.1690298    .1288778
    hispanic |   .0910101   .0714263     1.27   0.203    -.0491062    .2311264
       _cons |   8.652486   .1165218    74.26   0.000     8.423907    8.881066
------------------------------------------------------------------------------

. est sto pt2reg1

. estimates save ${clnloc}lnPT2.ster, replace
file ../../../data/nlsy97/cleaned/lnPT2.ster saved

. predict lnParTransHat2, xb
(27,607 missing values generated)

. scalar sig2lnPT2 = `=`e(rmse)'^2'

. reg lnParTrans aged?       lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(18, 3301)     =     19.18
       Model |  395.456783        18  21.9698213   Prob > F        =    0.0000
    Residual |  3782.04239     3,301  1.14572626   R-squared       =    0.0947
-------------+----------------------------------   Adj R-squared   =    0.0897
       Total |  4177.49917     3,319    1.258662   Root MSE        =    1.0704

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   1.093666   .1425553     7.67   0.000     .8141602    1.373172
       aged1 |   .9223979   .1320234     6.99   0.000     .6635419    1.181254
       aged2 |    .676267   .1217858     5.55   0.000     .4374836    .9150504
       aged3 |   .4847322    .112495     4.31   0.000     .2641651    .7052993
       aged4 |   .3678913   .1096795     3.35   0.001     .1528446    .5829381
       aged5 |   .1387625    .115602     1.20   0.230    -.0878965    .3654214
       aged6 |   .0416196   .1264889     0.33   0.742     -.206385    .2896241
       aged7 |  -.1254937   .1433403    -0.88   0.381    -.4065386    .1555512
lnFamIncAs~n |   .1063002   .0221389     4.80   0.000     .0628929    .1497076
 cum_college |    .062358   .0195966     3.18   0.001     .0239354    .1007807
       black |   .0240444   .0554234     0.43   0.664    -.0846234    .1327122
    hispanic |   .1636341   .0597851     2.74   0.006     .0464144    .2808537
             |
  birth_year |
       1980  |   .5361626    .062262     8.61   0.000     .4140865    .6582386
       1981  |   .4160768    .059265     7.02   0.000     .2998769    .5322766
       1982  |   .2414458   .0601456     4.01   0.000     .1235194    .3593723
       1983  |   .1359228   .0595175     2.28   0.022     .0192279    .2526177
             |
Grades_HS_~t |  -.0590858   .0272196    -2.17   0.030    -.1124547   -.0057169
Parent_col~e |  -.0670278   .0399531    -1.68   0.094    -.1453633    .0113077
       _cons |   7.210424   .1593432    45.25   0.000     6.898002    7.522845
------------------------------------------------------------------------------

. est sto pt4reg6

. reg lnParTrans aged0-aged2 lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(13, 3306)     =     23.22
       Model |  349.455005        13  26.8811542   Prob > F        =    0.0000
    Residual |  3828.04416     3,306   1.1579081   R-squared       =    0.0837
-------------+----------------------------------   Adj R-squared   =    0.0800
       Total |  4177.49917     3,319    1.258662   Root MSE        =    1.0761

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       aged0 |   .5955614   .0785748     7.58   0.000     .4415013    .7496216
       aged1 |   .4601581   .0669177     6.88   0.000     .3289538    .5913624
       aged2 |   .2693995   .0600828     4.48   0.000     .1515962    .3872027
lnFamIncAs~n |   .1170642   .0221872     5.28   0.000     .0735622    .1605662
 cum_college |  -.0011119    .016481    -0.07   0.946    -.0334259    .0312021
       black |    .032022   .0556915     0.57   0.565    -.0771713    .1412152
    hispanic |    .159609   .0600442     2.66   0.008     .0418813    .2773366
             |
  birth_year |
       1980  |   .5451349   .0625736     8.71   0.000      .422448    .6678219
       1981  |   .4347414   .0594964     7.31   0.000     .3180878     .551395
       1982  |   .2581121   .0603975     4.27   0.000     .1396919    .3765324
       1983  |    .144487   .0598007     2.42   0.016     .0272368    .2617372
             |
Grades_HS_~t |   -.030955   .0269788    -1.15   0.251    -.0838519    .0219419
Parent_col~e |  -.0583649   .0400443    -1.46   0.145    -.1368789    .0201492
       _cons |   7.631361   .1156991    65.96   0.000     7.404512     7.85821
------------------------------------------------------------------------------

. est sto pt4reg5

. reg lnParTrans age agesq   lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(12, 3307)     =     28.73
       Model |  394.455713        12  32.8713094   Prob > F        =    0.0000
    Residual |  3783.04346     3,307  1.14395024   R-squared       =    0.0944
-------------+----------------------------------   Adj R-squared   =    0.0911
       Total |  4177.49917     3,319    1.258662   Root MSE        =    1.0696

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.2562803   .0257289    -9.96   0.000    -.3067264   -.2058342
       agesq |   .0139485   .0019857     7.02   0.000     .0100551    .0178419
lnFamIncAs~n |   .1085209   .0220659     4.92   0.000     .0652566    .1517851
 cum_college |   .0563109   .0194682     2.89   0.004     .0181399    .0944819
       black |   .0250296   .0553603     0.45   0.651    -.0835143    .1335735
    hispanic |   .1607017   .0597512     2.69   0.007     .0435487    .2778548
             |
  birth_year |
       1980  |   .5375402   .0621652     8.65   0.000     .4156541    .6594264
       1981  |   .4152529   .0591754     7.02   0.000     .2992287    .5312771
       1982  |   .2439129   .0600111     4.06   0.000     .1262504    .3615755
       1983  |    .137552    .059428     2.31   0.021     .0210326    .2540714
             |
Grades_HS_~t |  -.0536449   .0271379    -1.98   0.048    -.1068537   -.0004361
Parent_col~e |    -.06564   .0398867    -1.65   0.100     -.143845    .0125651
       _cons |   8.335244   .1063631    78.37   0.000       8.1267    8.543788
------------------------------------------------------------------------------

. est sto pt4reg4

. reg lnParTrans age         lnFamIncAsTeen cum_college black hispanic b1984.bi
> rth_year Grades_HS_best Parent_college if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(11, 3308)     =     26.47
       Model |  338.010912        11  30.7282647   Prob > F        =    0.0000
    Residual |  3839.48826     3,308  1.16066755   R-squared       =    0.0809
-------------+----------------------------------   Adj R-squared   =    0.0779
       Total |  4177.49917     3,319    1.258662   Root MSE        =    1.0773

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.1038439   .0139223    -7.46   0.000    -.1311412   -.0765466
lnFamIncAs~n |   .1085743   .0222266     4.88   0.000     .0649951    .1521536
 cum_college |   .0106124   .0184826     0.57   0.566    -.0256262    .0468509
       black |   .0251745   .0557633     0.45   0.652    -.0841596    .1345086
    hispanic |   .1836014   .0600966     3.06   0.002     .0657712    .3014316
             |
  birth_year |
       1980  |   .5345315   .0626163     8.54   0.000     .4117609    .6573021
       1981  |   .4269872   .0595825     7.17   0.000     .3101649    .5438095
       1982  |   .2420429   .0604474     4.00   0.000     .1235249    .3605609
       1983  |   .1293829   .0598492     2.16   0.031     .0120377    .2467281
             |
Grades_HS_~t |  -.0536549   .0273355    -1.96   0.050    -.1072511   -.0000587
Parent_col~e |  -.0765765   .0401464    -1.91   0.057    -.1552909    .0021379
       _cons |   8.190226   .1050999    77.93   0.000     7.984159    8.396294
------------------------------------------------------------------------------

. est sto pt4reg3

. reg lnParTrans age agesq   lnFamIncAsTeen cum_college black hispanic         
>                                        if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(6, 3313)      =     37.90
       Model |   268.30696         6  44.7178267   Prob > F        =    0.0000
    Residual |  3909.19221     3,313  1.17995539   R-squared       =    0.0642
-------------+----------------------------------   Adj R-squared   =    0.0625
       Total |  4177.49917     3,319    1.258662   Root MSE        =    1.0863

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |  -.2540259   .0259714    -9.78   0.000    -.3049474   -.2031044
       agesq |   .0144925   .0020124     7.20   0.000     .0105469    .0184382
lnFamIncAs~n |   .1120557    .021636     5.18   0.000     .0696344    .1544769
 cum_college |   .0502244   .0196221     2.56   0.011     .0117519     .088697
       black |   .0882903   .0536183     1.65   0.100     -.016838    .1934187
    hispanic |   .1631385   .0602293     2.71   0.007     .0450481    .2812289
       _cons |   8.508472   .0992114    85.76   0.000      8.31395    8.702994
------------------------------------------------------------------------------

. est sto pt4reg2

. reg lnParTrans age         lnFamIncAsTeen cum_college black hispanic         
>                                        if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(5, 3314)      =     34.57
       Model |  207.109589         5  41.4219179   Prob > F        =    0.0000
    Residual |  3970.38958     3,314  1.19806565   R-squared       =    0.0496
-------------+----------------------------------   Adj R-squared   =    0.0481
       Total |  4177.49917     3,319    1.258662   Root MSE        =    1.0946

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   -.095542   .0138976    -6.87   0.000    -.1227907   -.0682932
lnFamIncAs~n |   .1104414   .0218002     5.07   0.000     .0676981    .1531846
 cum_college |   .0027407   .0186224     0.15   0.883    -.0337719    .0392533
       black |   .0903884   .0540274     1.67   0.094    -.0155421    .1963188
    hispanic |   .1878193   .0605914     3.10   0.002      .069019    .3066197
       _cons |   8.357448   .0977111    85.53   0.000     8.165868    8.549028
------------------------------------------------------------------------------

. est sto pt4reg1

. estimates save ${clnloc}lnPT4.ster, replace
file ../../../data/nlsy97/cleaned/lnPT4.ster saved

. predict lnParTransHat4, xb
(27,607 missing values generated)

. scalar sig2lnPT4 = `=`e(rmse)'^2'

. di "sig2lnPT2:"
sig2lnPT2:

. di "`=sig2lnPT2'"
1.01826258794687

. gen ParTrans2RMSE = `=sqrt(`=sig2lnPT2')'

. di "sig2lnPT4:"
sig2lnPT4:

. di "`=sig2lnPT4'"
1.198065654712291

. gen ParTrans4RMSE = `=sqrt(`=sig2lnPT4')'

. est table pt4reg1 pt4reg2 pt4reg3, b(%7.3f) star stats(N r2 r2_a)

-----------------------------------------------------
    Variable |  pt4reg1      pt4reg2      pt4reg3    
-------------+---------------------------------------
         age |  -0.096***    -0.254***    -0.104***  
lnFamIncAs~n |   0.110***     0.112***     0.109***  
 cum_college |   0.003        0.050*       0.011     
       black |   0.090        0.088        0.025     
    hispanic |   0.188**      0.163**      0.184**   
       agesq |                0.014***               
             |
  birth_year |
       1980  |                             0.535***  
       1981  |                             0.427***  
       1982  |                             0.242***  
       1983  |                             0.129*    
             |
Grades_HS_~t |                            -0.054*    
Parent_col~e |                            -0.077     
       _cons |   8.357***     8.508***     8.190***  
-------------+---------------------------------------
           N |    3320         3320         3320     
          r2 |   0.050        0.064        0.081     
        r2_a |   0.048        0.063        0.078     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. est table pt4reg4 pt4reg5 pt4reg6, b(%7.3f) star stats(N r2 r2_a)

-----------------------------------------------------
    Variable |  pt4reg4      pt4reg5      pt4reg6    
-------------+---------------------------------------
         age |  -0.256***                            
       agesq |   0.014***                            
lnFamIncAs~n |   0.109***     0.117***     0.106***  
 cum_college |   0.056**     -0.001        0.062**   
       black |   0.025        0.032        0.024     
    hispanic |   0.161**      0.160**      0.164**   
             |
  birth_year |
       1980  |   0.538***     0.545***     0.536***  
       1981  |   0.415***     0.435***     0.416***  
       1982  |   0.244***     0.258***     0.241***  
       1983  |   0.138*       0.144*       0.136*    
             |
Grades_HS_~t |  -0.054*      -0.031       -0.059*    
Parent_col~e |  -0.066       -0.058       -0.067     
       aged0 |                0.596***     1.094***  
       aged1 |                0.460***     0.922***  
       aged2 |                0.269***     0.676***  
       aged3 |                             0.485***  
       aged4 |                             0.368***  
       aged5 |                             0.139     
       aged6 |                             0.042     
       aged7 |                            -0.125     
       _cons |   8.335***     7.631***     7.210***  
-------------+---------------------------------------
           N |    3320         3320         3320     
          r2 |   0.094        0.084        0.095     
        r2_a |   0.091        0.080        0.090     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. est table pt2reg1 pt2reg2 pt2reg3, b(%7.3f) star stats(N r2 r2_a)

-----------------------------------------------------
    Variable |  pt2reg1      pt2reg2      pt2reg3    
-------------+---------------------------------------
         age |  -0.060***    -0.169***    -0.061***  
lnFamIncAs~n |   0.033        0.032        0.030     
 cum_college |   0.031        0.049*       0.031     
       black |  -0.020       -0.040       -0.048     
    hispanic |   0.091        0.090        0.059     
       agesq |                0.010***               
             |
  birth_year |
       1980  |                             0.025     
       1981  |                             0.133     
       1982  |                             0.110     
       1983  |                             0.025     
             |
Grades_HS_~t |                            -0.060     
Parent_col~e |                            -0.016     
       _cons |   8.652***     8.792***     8.628***  
-------------+---------------------------------------
           N |    1382         1382         1382     
          r2 |   0.024        0.037        0.029     
        r2_a |   0.021        0.033        0.021     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. est table pt2reg4 pt2reg5 pt2reg6, b(%7.3f) star stats(N r2 r2_a)

-----------------------------------------------------
    Variable |  pt2reg4      pt2reg5      pt2reg6    
-------------+---------------------------------------
         age |  -0.169***                            
       agesq |   0.010***                            
lnFamIncAs~n |   0.030        0.031        0.029     
 cum_college |   0.049*       0.030        0.052*    
       black |  -0.068       -0.059       -0.071     
    hispanic |   0.060        0.064        0.062     
             |
  birth_year |
       1980  |   0.021        0.011        0.024     
       1981  |   0.117        0.120        0.107     
       1982  |   0.117        0.115        0.108     
       1983  |   0.028        0.021        0.021     
             |
Grades_HS_~t |  -0.059       -0.051       -0.063     
Parent_col~e |  -0.018       -0.006       -0.020     
       aged0 |                0.463***     0.655***  
       aged1 |                0.364***     0.548***  
       aged2 |                0.317***     0.486***  
       aged3 |                             0.349**   
       aged4 |                             0.264*    
       aged5 |                            -0.068     
       aged6 |                            -0.011     
       aged7 |                             0.009     
       _cons |   8.767***     8.234***     8.057***  
-------------+---------------------------------------
           N |    1382         1382         1382     
          r2 |   0.041        0.032        0.043     
        r2_a |   0.033        0.023        0.031     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001

. 
. * Now create expected parental transfers, using predicted values from logit a
> nd OLS models
. gen E_ParTrans2 = prParTrans2*exp(lnParTransHat2 + `=`=sig2lnPT2'/2')
(27,607 missing values generated)

. gen E_ParTrans4 = prParTrans4*exp(lnParTransHat4 + `=`=sig2lnPT4'/2')
(27,607 missing values generated)

. sum E_ParTrans2 if in_2yr & ~anyFlag, d

                         E_ParTrans2
-------------------------------------------------------------
      Percentiles      Smallest
 1%      364.335       142.3632
 5%     756.4019       158.8503
10%     1515.325       176.9368       Obs               2,099
25%     4013.937       195.8993       Sum of Wgt.       2,099

50%     7309.406                      Mean           6377.545
                        Largest       Std. Dev.      2978.464
75%     8802.282        11153.7
90%     9673.665       11231.68       Variance        8871248
95%     9987.345       11256.92       Skewness      -.5994946
99%     10733.33       11577.79       Kurtosis       2.105231

. sum E_ParTrans4 if in_4yr & ~anyFlag, d

                         E_ParTrans4
-------------------------------------------------------------
      Percentiles      Smallest
 1%     190.7252       75.82313
 5%     770.3667       79.88177
10%     1794.001       82.47704       Obs               4,777
25%     4793.592       86.02551       Sum of Wgt.       4,777

50%     7299.347                      Mean           6946.354
                        Largest       Std. Dev.       3276.93
75%     9477.912        14804.4
90%      10980.9       15172.62       Variance       1.07e+07
95%     11589.81       15572.86       Skewness      -.3434853
99%     13050.65        15953.8       Kurtosis       2.340418

. 
. local efcvars efc student_lag_income tax2_rate tax2_unmarried_0_ch famIncAsTe
> enEFC HHsize1997 HH_size_under_18_in_college assets_tot age_older_parent marr
> ied

. mdesc `efcvars' if in_4yr & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
         efc           0        4777              0
student_la~e           0        4777              0
   tax2_rate           0        4777              0
tax2_un~0_ch           0        4777              0
famIncAsTe~C           0        4777              0
  HHsize1997           0        4777              0
HH_size_un~e           0        4777              0
  assets_tot           0        4777              0
age_older_~t           0        4777              0
     married           0        4777              0

. mdesc `efcvars' if in_2yr & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
         efc           0        2099              0
student_la~e           0        2099              0
   tax2_rate           0        2099              0
tax2_un~0_ch           0        2099              0
famIncAsTe~C           0        2099              0
  HHsize1997           0        2099              0
HH_size_un~e           0        2099              0
  assets_tot           0        2099              0
age_older_~t           0        2099              0
     married           0        2099              0

. 
. sum efc if in_4yr & ~anyFlag, d

                             efc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,777
25%      2910.94              0       Sum of Wgt.       4,777

50%     7471.105                      Mean           10726.07
                        Largest       Std. Dev.      11802.48
75%     13917.84       79885.94
90%     25913.87       80877.23       Variance       1.39e+08
95%     37255.72       80877.23       Skewness       2.383824
99%     53483.02       81653.09       Kurtosis       11.03453

. sum efc if in_2yr & ~anyFlag, d

                             efc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,099
25%      2162.52              0       Sum of Wgt.       2,099

50%     6571.084                      Mean           8029.595
                        Largest       Std. Dev.      8210.469
75%     11240.03        51473.4
90%     17260.77       66006.88       Variance       6.74e+07
95%      22744.3       80877.23       Skewness       2.279284
99%     39241.85       80877.23       Kurtosis       12.87711

. 
. sum famIncAsTeenEFC if in_4yr & ~anyFlag, d

                       famIncAsTeenEFC
-------------------------------------------------------------
      Percentiles      Smallest
 1%     977.5701        58.6542
 5%     9773.746        58.6542
10%     17400.75       249.2804       Obs               4,777
25%     34214.95       249.2804       Sum of Wgt.       4,777

50%     56459.17                      Mean           68041.87
                        Largest       Std. Dev.      53533.92
75%     81871.49       287952.5
90%     127084.1       287952.5       Variance       2.87e+09
95%     230074.9       287952.5       Skewness       1.806608
99%     240945.6       287952.5       Kurtosis       6.489873

. sum famIncAsTeenEFC if in_2yr & ~anyFlag, d

                       famIncAsTeenEFC
-------------------------------------------------------------
      Percentiles      Smallest
 1%     940.9862       31.28224
 5%     7224.243       31.28224
10%     12317.38       31.28224       Obs               2,099
25%     25416.82       43.99065       Sum of Wgt.       2,099

50%      42524.3                      Mean           48862.17
                        Largest       Std. Dev.      36170.33
75%     65790.47       240945.6
90%     89936.45       240945.6       Variance       1.31e+09
95%     106907.1       240945.6       Skewness       2.409981
99%     240945.6       420969.9       Kurtosis       15.15105

. 
. bys ID (year): egen efcmin = min(efc)
(3002 missing values generated)

. ren efc efc_varying

. ren efcmin efc

. 
. *Now impute tuition paid, loans taken out, and grants taken out, using estima
> tes from NPSAS
. gen efc1_4yr = inrange(efc,    1,  312.99999999999999999999)

. gen efc2_4yr = inrange(efc,  313, 2383.99999999999999999999)

. gen efc3_4yr = inrange(efc, 2384, 5100.99999999999999999999)

. gen efc4_4yr = inrange(efc, 5101, 8362.99999999999999999999)

. gen efc5_4yr = inrange(efc, 8363,12206.99999999999999999999)

. gen efc6_4yr = inrange(efc,12207,16890.99999999999999999999)

. gen efc7_4yr = inrange(efc,16891,22899.99999999999999999999)

. gen efc8_4yr = inrange(efc,22900,33023.99999999999999999999)

. gen efc9_4yr = inrange(efc,33024,                         .)

. 
. gen efc1_2yr = inrange(efc,    1,  1328.9999999999999999999)

. gen efc2_2yr = inrange(efc, 1329,  3001.9999999999999999999)

. gen efc3_2yr = inrange(efc, 3002,  5334.9999999999999999999)

. gen efc4_2yr = inrange(efc, 5335,  7913.9999999999999999999)

. gen efc5_2yr = inrange(efc, 7914, 11480.9999999999999999999)

. gen efc6_2yr = inrange(efc,11481, 15865.9999999999999999999)

. gen efc7_2yr = inrange(efc,15866, 22904.9999999999999999999)

. gen efc8_2yr = inrange(efc,22905,                         .)

. 
. gen finc1_4yr = inrange(famIncAsTeenEFC, 22363, 38061.999999999999999999999)

. gen finc2_4yr = inrange(famIncAsTeenEFC, 38062, 52475.999999999999999999999)

. gen finc3_4yr = inrange(famIncAsTeenEFC, 52476, 66438.999999999999999999999)

. gen finc4_4yr = inrange(famIncAsTeenEFC, 66439, 79895.999999999999999999999)

. gen finc5_4yr = inrange(famIncAsTeenEFC, 79896, 94098.999999999999999999999)

. gen finc6_4yr = inrange(famIncAsTeenEFC, 94099,110000.999999999999999999999)

. gen finc7_4yr = inrange(famIncAsTeenEFC,110001,130786.999999999999999999999)

. gen finc8_4yr = inrange(famIncAsTeenEFC,130787,165785.999999999999999999999)

. gen finc9_4yr = inrange(famIncAsTeenEFC,165786,                           .)

. 
. gen finc1_2yr = inrange(famIncAsTeenEFC, 17066, 27314.999999999999999999999)

. gen finc2_2yr = inrange(famIncAsTeenEFC, 27315, 38114.999999999999999999999)

. gen finc3_2yr = inrange(famIncAsTeenEFC, 38115, 47323.999999999999999999999)

. gen finc4_2yr = inrange(famIncAsTeenEFC, 47324, 57202.999999999999999999999)

. gen finc5_2yr = inrange(famIncAsTeenEFC, 57203, 68846.999999999999999999999)

. gen finc6_2yr = inrange(famIncAsTeenEFC, 68847, 81644.999999999999999999999)

. gen finc7_2yr = inrange(famIncAsTeenEFC, 81645, 98987.999999999999999999999)

. gen finc8_2yr = inrange(famIncAsTeenEFC, 98988,121971.999999999999999999999)

. gen finc9_2yr = inrange(famIncAsTeenEFC,121972,                           .)

. 
. gen binsatm1 = inrange(predSATmath,400,439.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm2 = inrange(predSATmath,440,479.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm3 = inrange(predSATmath,480,509.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm4 = inrange(predSATmath,510,539.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm5 = inrange(predSATmath,540,569.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm6 = inrange(predSATmath,570,599.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm7 = inrange(predSATmath,600,639.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm8 = inrange(predSATmath,640,679.999999999999) if !mi(predSATmath)
(25,992 missing values generated)

. gen binsatm9 = inrange(predSATmath,680,               .) if !mi(predSATmath)
(25,992 missing values generated)

. 
. gen binsatv1 = inrange(predSATverb,400,439.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv2 = inrange(predSATverb,440,469.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv3 = inrange(predSATverb,470,489.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv4 = inrange(predSATverb,490,519.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv5 = inrange(predSATverb,520,549.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv6 = inrange(predSATverb,550,569.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv7 = inrange(predSATverb,570,609.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv8 = inrange(predSATverb,610,649.999999999999) if !mi(predSATverb)
(26,087 missing values generated)

. gen binsatv9 = inrange(predSATverb,650,               .) if !mi(predSATverb)
(26,087 missing values generated)

. 
. mdesc predSAT* if in_4yr & ~anyFlag
     Variable      Missing      Total     Missing/Total
    ------------------------------------------------------------
 predSATmath           0        4777              0
 predSATverb           0        4777              0
predSATmathZ           0        4777              0
predSATverbZ           0        4777              0

. generat tui4imp = 6394.2

. generat tui2imp = 1380.1

. 
. generat loan4impPosRMSE = 7046.093725

. generat grant4impPosRMSE = 5372.287396

. generat loan2impPosRMSE = 2770.007032

. generat grant2impPosRMSE = 1823.231748

. 
. //generat loansgr_imputed = .
. //replace loansgr_imputed =  5564.119 - 0.101*efc - 0.008*famIncAsTeenEFC +  
> 4.554*predSATmath  + 6.356*predSATverb if in_4yr
. //replace loansgr_imputed =  1972.367 - 0.023*efc - 0.005*famIncAsTeenEFC    
>                                        if in_2yr
. //
. //sum loansgr_imputed if in_4yr, d
. //sum loansgr_imputed if in_2yr, d
. 
. generat loan4idx = -0.6208 + efc1_4yr*(0.4625) + efc2_4yr*(0.5111) + efc3_4yr
> *(0.7334) + efc4_4yr*(0.5507) + efc5_4yr*(0.2915) + efc6_4yr*(-0.1126) + efc7
> _4yr*(-0.4217) + efc8_4yr*(-0.689) + efc9_4yr*(-0.817) + finc1_4yr*(-0.1345) 
> + finc2_4yr*(-0.3208) + finc3_4yr*(-0.241) + finc4_4yr*(-0.1494) + finc5_4yr*
> (-0.0228) + finc6_4yr*(-0.1543) + finc7_4yr*(-0.2055) + finc8_4yr*(-0.2181) +
>  finc9_4yr*(-0.3824) + binsatm1*(-0.0532) + binsatm2*(-0.2262) + binsatm3*(-0
> .2544) + binsatm4*(-0.2163) + binsatm5*(-0.4274) + binsatm6*(-0.4064) + binsa
> tm7*(-0.5548) + binsatm8*(-0.6377) + binsatm9*(-0.9401) + binsatv1*(0.1756) +
>  binsatv2*(0.0941) + binsatv3*(0.0385) + binsatv4*(0.0451) + binsatv5*(0.0776
> ) + binsatv6*(0.0771) + binsatv7*(0.0768) + binsatv8*(-0.0306) + binsatv9*(-0
> .2145) + 1.5329
(26,239 missing values generated)

. generat loan2idx = -4.0384 + efc1_2yr*(0.2302) + efc2_2yr*(0.4052) + efc3_2yr
> *(1.0393) + efc4_2yr*(0.6441) + efc5_2yr*(0.5859) + efc6_2yr*(0.3178) + efc7_
> 2yr*(0.2597) + efc8_2yr*(-0.0227) + finc1_2yr*(-0.1037) + finc2_2yr*(-0.4017)
>  + finc3_2yr*(-0.3303) + finc4_2yr*(-0.3303) + finc5_2yr*(-0.3869) + finc6_2y
> r*(-0.2336) + finc7_2yr*(-0.0137) + finc8_2yr*(-0.159) + finc9_2yr*(-0.2304) 
> + 2.1207

. 
. generat loan4pr  = exp(loan4idx)/(1+exp(loan4idx))
(26,239 missing values generated)

. generat loan2pr  = exp(loan2idx)/(1+exp(loan2idx))

. 
. sum loan4pr if in_4yr & ~anyFlag, d

                           loan4pr
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .2405621       .1912513
 5%     .3425615       .1912513
10%     .4256064       .1912513       Obs               4,777
25%     .5622257       .1912513       Sum of Wgt.       4,777

50%     .6822432                      Mean           .6369576
                        Largest       Std. Dev.      .1411176
75%     .7377874       .8579419
90%     .7762942       .8579419       Variance       .0199142
95%     .7962793       .8579419       Skewness      -1.127454
99%     .8192093       .8579419       Kurtosis       3.597341

. sum loan2pr if in_2yr & ~anyFlag, d

                           loan2pr
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1024035       .0895289
 5%      .110151       .0895289
10%      .110151       .1024035       Obs               2,099
25%     .1281183       .1024035       Sum of Wgt.       2,099

50%     .1367205                      Mean           .1513684
                        Largest       Std. Dev.      .0381879
75%     .1674372        .261652
90%     .2200629        .261652       Variance       .0014583
95%     .2299312        .261652       Skewness       1.047145
99%     .2474982        .261652       Kurtosis        2.99753

. 
. generat loan4impPos = 3167.3688 + efc1_4yr*(13.4083) + efc2_4yr*(279.6772) + 
> efc3_4yr*(1810.6208) + efc4_4yr*(2265.9244) + efc5_4yr*(2447.0094) + efc6_4yr
> *(2372.4242) + efc7_4yr*(3141.1027) + efc8_4yr*(3074.3813) + efc9_4yr*(2111.8
> 229) + finc1_4yr*(-123.4008) + finc2_4yr*(115.3869) + finc3_4yr*(418.1767) + 
> finc4_4yr*(227.6036) + finc5_4yr*(631.8121) + finc6_4yr*(487.8596) + finc7_4y
> r*(916.5277) + finc8_4yr*(1454.7427) + finc9_4yr*(1776.1062) + binsatm1*(-135
> .1884) + binsatm2*(-84.6638) + binsatm3*(-551.3572) + binsatm4*(-427.1241) + 
> binsatm5*(-423.7365) + binsatm6*(-666.2553) + binsatm7*(-262.0947) + binsatm8
> *(-681.6066) + binsatm9*(-1569.0931) + binsatv1*(175.8538) + binsatv2*(348.13
> 26) + binsatv3*(35.9479) + binsatv4*(294.6957) + binsatv5*(-48.8518) + binsat
> v6*(16.1382) + binsatv7*(-288.6987) + binsatv8*(-477.0777) + binsatv9*(-897.8
> 223) + 3004.9318
(26,239 missing values generated)

. generat loan2impPos = 2929.9435 + efc1_2yr*(715.3761) + efc2_2yr*(173.0259) +
>  efc3_2yr*(597.203) + efc4_2yr*(857.129) + efc5_2yr*(1249.8034) + efc6_2yr*(1
> 024.8624) + efc7_2yr*(1249.758) + efc8_2yr*(1095.9268) + finc1_2yr*(-90.3268)
>  + finc2_2yr*(-79.2131) + finc3_2yr*(-36.498) + finc4_2yr*(18.0709) + finc5_2
> yr*(-118.3996) + finc6_2yr*(-169.6658) + finc7_2yr*(-549.5066) + finc8_2yr*(-
> 378.2811) + finc9_2yr*(-61.0912) + -4.3431

. 
. sum loan4impPos if in_4yr & ~anyFlag, d

                         loan4impPos
-------------------------------------------------------------
      Percentiles      Smallest
 1%     3985.063       3595.393
 5%     5346.091       3595.393
10%     5828.192       3595.393       Obs               4,777
25%     6252.973       3595.393       Sum of Wgt.       4,777

50%     7836.213                      Mean           7563.077
                        Largest       Std. Dev.      1471.927
75%     8700.561       11286.26
90%     9342.313       11286.26       Variance        2166570
95%     9803.568       11286.26       Skewness      -.1519846
99%     10615.19       11286.26       Kurtosis       2.348323

. sum loan2impPos if in_2yr & ~anyFlag, d

                         loan2impPos
-------------------------------------------------------------
      Percentiles      Smallest
 1%     2835.274       2835.274
 5%     2835.274       2835.274
10%       2925.6       2835.274       Obs               2,099
25%     3019.413       2835.274       Sum of Wgt.       2,099

50%     3540.874                      Mean           3414.355
                        Largest       Std. Dev.       384.314
75%     3625.897       4193.475
90%     4005.693       4193.475       Variance       147697.3
95%     4005.738       4193.475       Skewness       .0663337
99%     4193.475       4193.475       Kurtosis       1.911847

. 
. generat loan4imp = loan4impPos*loan4pr
(26,239 missing values generated)

. generat loan2imp = loan2impPos*loan2pr

. 
. sum loan4imp if in_4yr & ~anyFlag, d

                          loan4imp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1812.433       1452.231
 5%     2365.194       1452.231
10%     2891.402       1452.231       Obs               4,777
25%     4011.388       1452.231       Sum of Wgt.       4,777

50%     4776.369                      Mean           4770.257
                        Largest       Std. Dev.      1282.173
75%     5793.827       7747.438
90%     6429.112       7747.438       Variance        1643966
95%     6769.827       7747.438       Skewness      -.3016333
99%     7061.628       7747.438       Kurtosis       2.576211

. sum loan2imp if in_2yr & ~anyFlag, d

                          loan2imp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     331.6542        254.834
 5%     331.6542        254.834
10%     374.8228       331.6542       Obs               2,099
25%      388.024       331.6542       Sum of Wgt.       2,099

50%     462.1308                      Mean            520.631
                        Largest       Std. Dev.      155.5626
75%      655.244       829.8956
90%     749.1829       829.8956       Variance       24199.73
95%     814.1573       829.8956       Skewness       .6355464
99%     829.8956       829.8956       Kurtosis       1.996592

. 
. generat grant4idx = 0.7798 + efc1_4yr*(0.9321) + efc2_4yr*(0.6868) + efc3_4yr
> *(0.0292) + efc4_4yr*(-1.0251) + efc5_4yr*(-1.2971) + efc6_4yr*(-1.5743) + ef
> c7_4yr*(-1.7771) + efc8_4yr*(-1.9483) + efc9_4yr*(-1.9558) + finc1_4yr*(-0.19
> 75) + finc2_4yr*(-0.7559) + finc3_4yr*(-0.5065) + finc4_4yr*(-0.5827) + finc5
> _4yr*(-0.5214) + finc6_4yr*(-0.4863) + finc7_4yr*(-0.6878) + finc8_4yr*(-0.78
> 63) + finc9_4yr*(-0.8146) + binsatm1*(0.0722) + binsatm2*(-0.026) + binsatm3*
> (0.0495) + binsatm4*(-0.0012) + binsatm5*(0.1179) + binsatm6*(0.1665) + binsa
> tm7*(0.1797) + binsatm8*(0.1924) + binsatm9*(0.0723) + binsatv1*(-0.0644) + b
> insatv2*(0.0078) + binsatv3*(-0.0534) + binsatv4*(0.0828) + binsatv5*(0.1877)
>  + binsatv6*(0.2402) + binsatv7*(0.2127) + binsatv8*(0.3817) + binsatv9*(0.39
> 23) + 1.016
(26,239 missing values generated)

. generat grant2idx = -0.2196 + efc1_2yr*(0.4438) + efc2_2yr*(-0.0491) + efc3_2
> yr*(-0.4656) + efc4_2yr*(-1.2203) + efc5_2yr*(-1.2743) + efc6_2yr*(-1.7325) +
>  efc7_2yr*(-1.7391) + efc8_2yr*(-1.6104) + finc1_2yr*(-0.1786) + finc2_2yr*(-
> 0.1578) + finc3_2yr*(-0.1935) + finc4_2yr*(-0.6507) + finc5_2yr*(-0.5761) + f
> inc6_2yr*(-0.475) + finc7_2yr*(-0.5374) + finc8_2yr*(-0.5111) + finc9_2yr*(-0
> .7397) + 0.8013

. 
. generat grant4pr  = exp(grant4idx)/(1+exp(grant4idx))
(26,239 missing values generated)

. generat grant2pr  = exp(grant2idx)/(1+exp(grant2idx))

. 
. sum grant4pr if in_4yr & ~anyFlag, d

                          grant4pr
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .2812641       .2563551
 5%     .3460381       .2563551
10%     .3914789       .2563551       Obs               4,777
25%      .500825       .2563551       Sum of Wgt.       4,777

50%     .6790479                      Mean           .6769636
                        Largest       Std. Dev.      .2029274
75%     .8585866       .9648585
90%     .9142525       .9648585       Variance       .0411795
95%      .934386       .9648585       Skewness      -.2643821
99%     .9489621       .9648585       Kurtosis       1.676235

. sum grant2pr if in_2yr & ~anyFlag, d

                          grant2pr
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1311875        .130437
 5%     .1509845        .130437
10%     .1635018        .130437       Obs               2,099
25%     .2308177        .130437       Sum of Wgt.       2,099

50%     .5839719                      Mean           .4562737
                        Largest       Std. Dev.      .2038269
75%     .6414585       .7042669
90%     .6999164       .7042669       Variance       .0415454
95%     .7042669       .7042669       Skewness      -.2735685
99%     .7042669       .7042669       Kurtosis       1.437839

. 
. generat grant4impPos = 4819.9277 + efc1_4yr*(-285.6587) + efc2_4yr*(-850.9437
> ) + efc3_4yr*(-3206.715) + efc4_4yr*(-4319.5595) + efc5_4yr*(-4929.4486) + ef
> c6_4yr*(-5681.987) + efc7_4yr*(-6241.8933) + efc8_4yr*(-6992.924) + efc9_4yr*
> (-7224.5194) + finc1_4yr*(302.0341) + finc2_4yr*(123.3267) + finc3_4yr*(274.0
> 223) + finc4_4yr*(505.0647) + finc5_4yr*(757.4287) + finc6_4yr*(577.9029) + f
> inc7_4yr*(678.0444) + finc8_4yr*(558.2155) + finc9_4yr*(663.8731) + binsatm1*
> (315.1831) + binsatm2*(592.9409) + binsatm3*(923.202) + binsatm4*(982.1282) +
>  binsatm5*(997.5396) + binsatm6*(1280.5311) + binsatm7*(1191.6313) + binsatm8
> *(1736.448) + binsatm9*(1939.1151) + binsatv1*(94.4814) + binsatv2*(146.3205)
>  + binsatv3*(608.1291) + binsatv4*(527.9978) + binsatv5*(526.2817) + binsatv6
> *(829.8153) + binsatv7*(830.2776) + binsatv8*(1577.6449) + binsatv9*(2208.026
> 2) + 2282.7886
(26,239 missing values generated)

. generat grant2impPos = 2134.5654 + efc1_2yr*(-292.1988) + efc2_2yr*(-1451.907
> 9) + efc3_2yr*(-2076.2855) + efc4_2yr*(-2027.1858) + efc5_2yr*(-1859.2596) + 
> efc6_2yr*(-1731.9758) + efc7_2yr*(-1784.4964) + efc8_2yr*(-1764.3874) + finc1
> _2yr*(248.3406) + finc2_2yr*(180.5374) + finc3_2yr*(-10.1507) + finc4_2yr*(40
> .8704) + finc5_2yr*(-217.682) + finc6_2yr*(-235.9044) + finc7_2yr*(-208.1524)
>  + finc8_2yr*(-218.2376) + finc9_2yr*(-120.329) + 1043.9698

. 
. sum grant4impPos if in_4yr & ~anyFlag, d

                        grant4impPos
-------------------------------------------------------------
      Percentiles      Smallest
 1%      1183.33         542.07
 5%     2144.953         542.07
10%       2823.2         542.07       Obs               4,777
25%     4019.328         542.07       Sum of Wgt.       4,777

50%     5651.394                      Mean           5698.915
                        Largest       Std. Dev.      2243.955
75%     7435.363       11266.23
90%     8381.161       11266.23       Variance        5035335
95%     9323.083       11266.23       Skewness       .1304188
99%     10761.53       11266.23       Kurtosis       2.433839

. sum grant2impPos if in_2yr & ~anyFlag, d

                        grant2impPos
-------------------------------------------------------------
      Percentiles      Smallest
 1%     866.3453       866.3453
 5%      915.445       866.3453
10%     933.6674       866.3453       Obs               2,099
25%      1143.12       866.3453       Sum of Wgt.       2,099

50%     1716.477                      Mean           1974.819
                        Largest       Std. Dev.      941.1448
75%     3134.677       3426.876
90%     3178.535       3426.876       Variance       885753.5
95%     3426.876       3426.876       Skewness       .3846138
99%     3426.876       3426.876       Kurtosis       1.384215

. 
. generat grant4imp = grant4impPos*grant4pr
(26,239 missing values generated)

. generat grant2imp = grant2impPos*grant2pr

. 
. sum grant4imp if in_4yr & ~anyFlag, d

                          grant4imp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     343.9662        148.508
 5%     738.9737        148.508
10%     1157.897        148.508       Obs               4,777
25%     2013.235        148.508       Sum of Wgt.       4,777

50%     3719.349                      Mean            4255.29
                        Largest       Std. Dev.      2568.301
75%      6450.03       10729.37
90%     7467.902       10729.37       Variance        6596168
95%     8728.874       10729.37       Skewness        .374702
99%      10111.8       10729.37       Kurtosis       2.095528

. sum grant2imp if in_2yr & ~anyFlag, d

                          grant2imp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     173.9848       166.1389
 5%      188.563       166.1389
10%     208.3635       166.1389       Obs               2,099
25%     257.0721       166.1389       Sum of Wgt.       2,099

50%     1002.374                      Mean           1062.317
                        Largest       Std. Dev.      825.8046
75%     2038.898       2194.012
90%     2159.898       2194.012       Variance       681953.3
95%     2194.012       2194.012       Skewness       .2992608
99%     2194.012       2194.012       Kurtosis       1.318004

. 
. * Summary stats on E_ParTrans and net_cost_4yr, net_cost_2yr
. sum E_ParTrans4 if in_4yr & ~anyFlag, d

                         E_ParTrans4
-------------------------------------------------------------
      Percentiles      Smallest
 1%     190.7252       75.82313
 5%     770.3667       79.88177
10%     1794.001       82.47704       Obs               4,777
25%     4793.592       86.02551       Sum of Wgt.       4,777

50%     7299.347                      Mean           6946.354
                        Largest       Std. Dev.       3276.93
75%     9477.912        14804.4
90%      10980.9       15172.62       Variance       1.07e+07
95%     11589.81       15572.86       Skewness      -.3434853
99%     13050.65        15953.8       Kurtosis       2.340418

. sum E_ParTrans2 if in_2yr & ~anyFlag, d

                         E_ParTrans2
-------------------------------------------------------------
      Percentiles      Smallest
 1%      364.335       142.3632
 5%     756.4019       158.8503
10%     1515.325       176.9368       Obs               2,099
25%     4013.937       195.8993       Sum of Wgt.       2,099

50%     7309.406                      Mean           6377.545
                        Largest       Std. Dev.      2978.464
75%     8802.282        11153.7
90%     9673.665       11231.68       Variance        8871248
95%     9987.345       11256.92       Skewness      -.5994946
99%     10733.33       11577.79       Kurtosis       2.105231

. 
. sum efc if in_4yr & ~anyFlag, d

                             efc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               4,777
25%     1471.015              0       Sum of Wgt.       4,777

50%     5356.201                      Mean           9118.053
                        Largest       Std. Dev.      11695.01
75%     11670.59       79885.94
90%     25196.25       80877.23       Variance       1.37e+08
95%     35230.12       80877.23       Skewness       2.516972
99%     53483.02       81653.09       Kurtosis        11.5575

. sum efc if in_2yr & ~anyFlag, d

                             efc
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               2,099
25%     439.1106              0       Sum of Wgt.       2,099

50%      2737.96                      Mean           5444.422
                        Largest       Std. Dev.       7585.45
75%     7629.674       45045.66
90%     13096.68       66006.88       Variance       5.75e+07
95%     20260.68       80877.23       Skewness       3.069193
99%      37364.2       80877.23       Kurtosis       18.59977

. 
. gen loanPlusGrant4 = grant4imp + loan4imp
(26,239 missing values generated)

. gen loanPlusGrant2 = grant2imp + loan2imp

. 
. sum loanPlusGrant4 if in_4yr & ~anyFlag, d

                       loanPlusGrant4
-------------------------------------------------------------
      Percentiles      Smallest
 1%     3667.348       3211.593
 5%     4389.945       3211.593
10%     5218.925       3211.593       Obs               4,777
25%     7402.013       3211.593       Sum of Wgt.       4,777

50%     9322.537                      Mean           9025.546
                        Largest       Std. Dev.      2418.185
75%     11033.88       13274.76
90%     11816.39       13274.76       Variance        5847620
95%     12113.74       13274.76       Skewness       -.569545
99%     12819.62       13274.76       Kurtosis       2.324244

. sum loanPlusGrant2 if in_2yr & ~anyFlag, d

                       loanPlusGrant2
-------------------------------------------------------------
      Percentiles      Smallest
 1%     594.1254       594.1254
 5%     647.6723       594.1254
10%     717.3201       594.1254       Obs               2,099
25%     949.5566       594.1254       Sum of Wgt.       2,099

50%      1421.03                      Mean           1582.948
                        Largest       Std. Dev.      728.9465
75%     2413.721       2701.491
90%     2552.229       2701.491       Variance         531363
95%     2701.491       2701.491       Skewness       .2916063
99%     2701.491       2701.491       Kurtosis       1.466726

. 
. gen oop4 = E_ParTrans4 - tui4imp + grant4imp + loan4imp
(47,804 missing values generated)

. gen oop2 = E_ParTrans2 - tui2imp + grant2imp + loan2imp
(27,607 missing values generated)

. 
. reg lnParTrans    lnFamIncAsTeen if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(1, 3318)      =     29.95
       Model |  37.3656167         1  37.3656167   Prob > F        =    0.0000
    Residual |  4140.13355     3,318  1.24777985   R-squared       =    0.0089
-------------+----------------------------------   Adj R-squared   =    0.0086
       Total |  4177.49917     3,319    1.258662   Root MSE        =     1.117

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnFamIncAs~n |   .1135945   .0207582     5.47   0.000     .0728943    .1542948
       _cons |   8.122563   .0847637    95.83   0.000     7.956368    8.288757
------------------------------------------------------------------------------

. reg lnParTrans    lnFamIncAsTeen log_assets black hispanic if in_4yr & recPar
> Trans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     3,320
-------------+----------------------------------   F(4, 3315)      =      8.89
       Model |   44.321151         4  11.0802877   Prob > F        =    0.0000
    Residual |  4133.17802     3,315  1.24681087   R-squared       =    0.0106
-------------+----------------------------------   Adj R-squared   =    0.0094
       Total |  4177.49917     3,319    1.258662   Root MSE        =    1.1166

------------------------------------------------------------------------------
  lnParTrans |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnFamIncAs~n |   .1142852   .0300666     3.80   0.000     .0553342    .1732362
  log_assets |   .0218216   .0295417     0.74   0.460    -.0361001    .0797433
       black |   .0836024   .0594473     1.41   0.160    -.0329547    .2001595
    hispanic |   .1423273   .0637459     2.23   0.026     .0173421    .2673126
       _cons |   7.888131   .2178252    36.21   0.000     7.461045    8.315216
------------------------------------------------------------------------------

. reg lnIncParTrans lnFamIncAsTeen if in_4yr & recParTrans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     2,051
-------------+----------------------------------   F(1, 2049)      =     26.25
       Model |  43.1534972         1  43.1534972   Prob > F        =    0.0000
    Residual |  3368.35232     2,049   1.6439006   R-squared       =    0.0126
-------------+----------------------------------   Adj R-squared   =    0.0122
       Total |  3411.50582     2,050  1.66414918   Root MSE        =    1.2821

------------------------------------------------------------------------------
lnIncParTr~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnFamIncAs~n |   .1520667     .02968     5.12   0.000     .0938606    .2102728
       _cons |   5.887021   .1216527    48.39   0.000     5.648445    6.125596
------------------------------------------------------------------------------

. reg lnIncParTrans lnFamIncAsTeen log_assets black hispanic if in_4yr & recPar
> Trans & ~anyFlag

      Source |       SS           df       MS      Number of obs   =     2,051
-------------+----------------------------------   F(4, 2046)      =     11.41
       Model |    74.42878         4   18.607195   Prob > F        =    0.0000
    Residual |  3337.07704     2,046  1.63102495   R-squared       =    0.0218
-------------+----------------------------------   Adj R-squared   =    0.0199
       Total |  3411.50582     2,050  1.66414918   Root MSE        =    1.2771

------------------------------------------------------------------------------
lnIncParTr~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnFamIncAs~n |     .11244   .0439209     2.56   0.011     .0263057    .1985743
  log_assets |   .1069386   .0435904     2.45   0.014     .0214524    .1924248
       black |   .3598308   .0844371     4.26   0.000     .1942393    .5254224
    hispanic |   .0950607   .0971093     0.98   0.328    -.0953826     .285504
       _cons |   4.988971   .3173195    15.72   0.000     4.366668    5.611274
------------------------------------------------------------------------------

. reg efc           lnFamIncAsTeen log_assets black hispanic if in_4yr & ~anyFl
> ag

      Source |       SS           df       MS      Number of obs   =     4,777
-------------+----------------------------------   F(4, 4772)      =   1089.30
       Model |  3.1177e+11         4  7.7943e+10   Prob > F        =    0.0000
    Residual |  3.4146e+11     4,772  71553980.9   R-squared       =    0.4773
-------------+----------------------------------   Adj R-squared   =    0.4768
       Total |  6.5323e+11     4,776   136773340   Root MSE        =      8459

------------------------------------------------------------------------------
         efc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnFamIncAs~n |   4978.479    189.076    26.33   0.000     4607.803    5349.155
  log_assets |   4346.424   190.9971    22.76   0.000     3971.981    4720.866
       black |   3958.967   376.4619    10.52   0.000     3220.928    4697.006
    hispanic |   2833.923   392.7115     7.22   0.000     2064.027    3603.819
       _cons |  -50852.19   1385.551   -36.70   0.000    -53568.51   -48135.87
------------------------------------------------------------------------------

. reg oop4          lnFamIncAsTeen log_assets black hispanic if in_4yr & ~anyFl
> ag

      Source |       SS           df       MS      Number of obs   =     4,777
-------------+----------------------------------   F(4, 4772)      =     51.55
       Model |  2.4205e+09         4   605123688   Prob > F        =    0.0000
    Residual |  5.6012e+10     4,772  11737704.4   R-squared       =    0.0414
-------------+----------------------------------   Adj R-squared   =    0.0406
       Total |  5.8433e+10     4,776  12234677.6   Root MSE        =      3426

------------------------------------------------------------------------------
        oop4 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lnFamIncAs~n |  -360.4349   76.57925    -4.71   0.000    -510.5655   -210.3042
  log_assets |  -192.0699   77.35732    -2.48   0.013     -343.726    -40.4139
       black |   429.9349    152.474     2.82   0.005     131.0156    728.8542
    hispanic |   969.6401   159.0554     6.10   0.000     657.8182    1281.462
       _cons |   12528.99   561.1735    22.33   0.000     11428.83    13629.15
------------------------------------------------------------------------------

. 
. sum oop4 if in_4yr & ~anyFlag, d

                            oop4
-------------------------------------------------------------
      Percentiles      Smallest
 1%     785.5706      -1932.903
 5%      3691.63      -1856.363
10%     4970.392      -1794.161       Obs               4,777
25%     7157.452      -1743.438       Sum of Wgt.       4,777

50%     9801.948                      Mean             9577.7
                        Largest       Std. Dev.       3497.81
75%     12137.26       18632.12
90%      14026.1       18761.58       Variance       1.22e+07
95%     15035.05       18851.09       Skewness      -.2628085
99%     16480.98       18852.01       Kurtosis       2.764923

. sum oop2 if in_2yr & ~anyFlag, d

                            oop2
-------------------------------------------------------------
      Percentiles      Smallest
 1%     183.7433      -268.5391
 5%     1205.942      -266.6898
10%     1830.436      -201.0709       Obs               2,099
25%     4254.917      -195.7741       Sum of Wgt.       2,099

50%     7454.461                      Mean           6580.393
                        Largest       Std. Dev.      2955.954
75%     8888.717       11905.46
90%     9783.729       11924.65       Variance        8737661
95%     10302.35       11929.89       Skewness       -.569123
99%     11294.14        11937.4       Kurtosis       2.179736

. 
. sum famIncAsTeen if in_4yr & oop4<0 & ~anyFlag, d

                        famIncAsTeen
-------------------------------------------------------------
      Percentiles      Smallest
 1%        83.75          83.75
 5%        83.75          83.75
10%        83.75          83.75       Obs                  19
25%          102            100       Sum of Wgt.          19

50%       133.75                      Mean           169.0318
                        Largest       Std. Dev.      68.44702
75%     235.3539       235.3539
90%      246.474       235.3539       Variance       4684.994
95%      246.474        246.474       Skewness      -.0013415
99%      246.474        246.474       Kurtosis       1.153844

. sum famIncAsTeen if in_2yr & oop2<0 & ~anyFlag, d

                        famIncAsTeen
-------------------------------------------------------------
      Percentiles      Smallest
 1%           49             49
 5%           49         52.543
10%       52.543             60       Obs                  12
25%           60             60       Sum of Wgt.          12

50%     63.69019                      Mean           86.84311
                        Largest       Std. Dev.      54.04364
75%       102.28            102
90%       102.56         102.56       Variance       2920.715
95%      246.474         102.56       Skewness         2.3456
99%      246.474        246.474       Kurtosis       7.616739

. 
. sum workPT if in_4yr & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      workPT |      4,777    .2842788    .4511175          0          1

. sum workFT if in_4yr & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      workFT |      4,777    .1886121    .3912411          0          1

. 
. sum workPT if in_2yr & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      workPT |      2,099    .3020486    .4592556          0          1

. sum workPT if in_4yr & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      workPT |      4,777    .2842788    .4511175          0          1

. 
. sum oop4 if in_4yr & workFT & ~anyFlag, d

                            oop4
-------------------------------------------------------------
      Percentiles      Smallest
 1%     71.34509      -1794.161
 5%     2290.615      -1012.578
10%     3406.406      -560.8634       Obs                 901
25%       5325.2      -287.4726       Sum of Wgt.         901

50%     8089.051                      Mean           8076.971
                        Largest       Std. Dev.      3602.659
75%     10699.69       16578.18
90%     12851.52       16831.37       Variance       1.30e+07
95%      13943.1       16923.36       Skewness       .0223568
99%     15784.79       17857.29       Kurtosis         2.4563

. sum oop4 if in_4yr & workPT & ~anyFlag, d

                            oop4
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1823.392      -412.0529
 5%      4535.93       47.48764
10%     5659.886       115.0082       Obs               1,358
25%     7595.292       412.8326       Sum of Wgt.       1,358

50%      9887.28                      Mean           9826.699
                        Largest       Std. Dev.      3233.507
75%     12108.26       18296.47
90%     13958.12       18632.12       Variance       1.05e+07
95%     14980.71       18761.58       Skewness      -.1532586
99%     16535.74       18852.01       Kurtosis       2.790043

. sum oop4 if in_4yr & !workFT & !workPT & ~anyFlag, d

                            oop4
-------------------------------------------------------------
      Percentiles      Smallest
 1%       791.65      -1932.903
 5%     4171.839      -1856.363
10%     5494.483      -1743.438       Obs               2,518
25%     7674.869      -1578.929       Sum of Wgt.       2,518

50%     10154.61                      Mean           9980.407
                        Largest       Std. Dev.      3454.777
75%     12489.92       18065.22
90%     14265.83        18090.1       Variance       1.19e+07
95%     15243.07       18106.16       Skewness      -.3764435
99%     16579.32       18851.09       Kurtosis       2.983203

. 
. sum oop2 if in_2yr & workFT & ~anyFlag, d

                            oop2
-------------------------------------------------------------
      Percentiles      Smallest
 1%     67.61101      -201.0709
 5%     918.3303      -152.3062
10%     1658.221      -79.04887       Obs                 773
25%      3165.93      -72.21741       Sum of Wgt.         773

50%     6406.061                      Mean           5940.134
                        Largest       Std. Dev.      3002.571
75%     8442.567       11334.63
90%     9654.384       11841.36       Variance        9015430
95%     10235.52       11876.54       Skewness      -.2417198
99%     11045.11       11924.65       Kurtosis       1.913102

. sum oop2 if in_2yr & workPT & ~anyFlag, d

                            oop2
-------------------------------------------------------------
      Percentiles      Smallest
 1%     501.5255      -63.87039
 5%     1884.396      -50.34164
10%     3567.855       297.7708       Obs                 634
25%     6387.614       306.4075       Sum of Wgt.         634

50%     8180.569                      Mean            7493.97
                        Largest       Std. Dev.      2525.262
75%     9234.415        11447.5
90%     9934.988       11715.94       Variance        6376949
95%     10560.37       11860.52       Skewness      -1.041143
99%     11392.11        11937.4       Kurtosis       3.451803

. sum oop2 if in_2yr & !workFT & !workPT & ~anyFlag, d

                            oop2
-------------------------------------------------------------
      Percentiles      Smallest
 1%     183.7433      -268.5391
 5%     1103.054      -266.6898
10%     1679.321      -195.7741       Obs                 692
25%     3761.056        40.4994       Sum of Wgt.         692

50%     7496.527                      Mean           6458.589
                        Largest       Std. Dev.      3062.021
75%      8854.77       11528.73
90%     9716.389       11905.46       Variance        9375973
95%      10239.9       11905.46       Skewness      -.5440926
99%     11343.03       11929.89       Kurtosis       2.018925

. 
. 
. 
. * AGE 18 DEBT REGRESSION
. capture drop efc?_?yr finc?_?yr

. *Now impute tuition paid, loans taken out, and grants taken out, using estima
> tes from NPSAS
. gen efc1_4yr = inrange(efc,    1,  312.99999999999999999999)

. gen efc2_4yr = inrange(efc,  313, 2383.99999999999999999999)

. gen efc3_4yr = inrange(efc, 2384, 5100.99999999999999999999)

. gen efc4_4yr = inrange(efc, 5101, 8362.99999999999999999999)

. gen efc5_4yr = inrange(efc, 8363,12206.99999999999999999999)

. gen efc6_4yr = inrange(efc,12207,16890.99999999999999999999)

. gen efc7_4yr = inrange(efc,16891,22899.99999999999999999999)

. gen efc8_4yr = inrange(efc,22900,33023.99999999999999999999)

. gen efc9_4yr = inrange(efc,33024,                         .)

. 
. gen efc1_2yr = inrange(efc,    1,  1328.9999999999999999999)

. gen efc2_2yr = inrange(efc, 1329,  3001.9999999999999999999)

. gen efc3_2yr = inrange(efc, 3002,  5334.9999999999999999999)

. gen efc4_2yr = inrange(efc, 5335,  7913.9999999999999999999)

. gen efc5_2yr = inrange(efc, 7914, 11480.9999999999999999999)

. gen efc6_2yr = inrange(efc,11481, 15865.9999999999999999999)

. gen efc7_2yr = inrange(efc,15866, 22904.9999999999999999999)

. gen efc8_2yr = inrange(efc,22905,                         .)

. 
. gen finc1_4yr = inrange(famIncAsTeenEFC, 22363, 38061.999999999999999999999)

. gen finc2_4yr = inrange(famIncAsTeenEFC, 38062, 52475.999999999999999999999)

. gen finc3_4yr = inrange(famIncAsTeenEFC, 52476, 66438.999999999999999999999)

. gen finc4_4yr = inrange(famIncAsTeenEFC, 66439, 79895.999999999999999999999)

. gen finc5_4yr = inrange(famIncAsTeenEFC, 79896, 94098.999999999999999999999)

. gen finc6_4yr = inrange(famIncAsTeenEFC, 94099,110000.999999999999999999999)

. gen finc7_4yr = inrange(famIncAsTeenEFC,110001,130786.999999999999999999999)

. gen finc8_4yr = inrange(famIncAsTeenEFC,130787,165785.999999999999999999999)

. gen finc9_4yr = inrange(famIncAsTeenEFC,165786,                           .)

. 
. gen finc1_2yr = inrange(famIncAsTeenEFC, 17066, 27314.999999999999999999999)

. gen finc2_2yr = inrange(famIncAsTeenEFC, 27315, 38114.999999999999999999999)

. gen finc3_2yr = inrange(famIncAsTeenEFC, 38115, 47323.999999999999999999999)

. gen finc4_2yr = inrange(famIncAsTeenEFC, 47324, 57202.999999999999999999999)

. gen finc5_2yr = inrange(famIncAsTeenEFC, 57203, 68846.999999999999999999999)

. gen finc6_2yr = inrange(famIncAsTeenEFC, 68847, 81644.999999999999999999999)

. gen finc7_2yr = inrange(famIncAsTeenEFC, 81645, 98987.999999999999999999999)

. gen finc8_2yr = inrange(famIncAsTeenEFC, 98988,121971.999999999999999999999)

. gen finc9_2yr = inrange(famIncAsTeenEFC,121972,                           .)

. 
. generat loan18_4impPosRMSE = 7291.563690

. generat loan18_2impPosRMSE = 2778.862690

. 
. generat loan18_4idx = -1.0004 + efc1_4yr*(0.6095) + efc2_4yr*(0.7745) + efc3_
> 4yr*(0.628) + efc4_4yr*(0.8591) + efc5_4yr*(0.2808) + efc6_4yr*(-0.307) + efc
> 7_4yr*(-0.586) + efc8_4yr*(-1.0725) + efc9_4yr*(-1.3246) + finc1_4yr*(-0.1968
> ) + finc2_4yr*(-0.2036) + finc3_4yr*(-0.1725) + finc4_4yr*(0.0511) + finc5_4y
> r*(0.3845) + finc6_4yr*(0.0622) + finc7_4yr*(0.4301) + finc8_4yr*(0.3277) + f
> inc9_4yr*(0.1961) + binsatm1*(-0.0516) + binsatm2*(-0.2625) + binsatm3*(-0.23
> 63) + binsatm4*(-0.104) + binsatm5*(-0.183) + binsatm6*(-0.1864) + binsatm7*(
> -0.4072) + binsatm8*(-0.7692) + binsatm9*(-0.4968) + binsatv1*(0.0808) + bins
> atv2*(-0.1152) + binsatv3*(-0.2122) + binsatv4*(-0.3021) + binsatv5*(-0.1043)
>  + binsatv6*(-0.2253) + binsatv7*(-0.2626) + binsatv8*(-0.6712) + binsatv9*(-
> 0.4753) + 1.9293
(26,239 missing values generated)

. generat loan18_2idx = -11.4222 + efc1_2yr*(0.0035) + efc2_2yr*(0.4992) + efc3
> _2yr*(0.781) + efc4_2yr*(0.3748) + efc5_2yr*(-0.1215) + efc6_2yr*(-0.1735) + 
> efc7_2yr*(-0.7727) + efc8_2yr*(-1.4242) + finc1_2yr*(0.114) + finc2_2yr*(-0.1
> 131) + finc3_2yr*(-0.2419) + finc4_2yr*(0.3067) + finc5_2yr*(0.2528) + finc6_
> 2yr*(0.7436) + finc7_2yr*(0.5606) + finc8_2yr*(1.0144) + finc9_2yr*(0.8824) +
>  9.6392

. 
. generat loan18_4pr  = exp(loan18_4idx)/(1+exp(loan18_4idx))
(26,239 missing values generated)

. generat loan18_2pr  = exp(loan18_2idx)/(1+exp(loan18_2idx))

. 
. sum loan18_4pr if in_4yr & ~anyFlag, d

                         loan18_4pr
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .1909112       .1624651
 5%       .33528       .1624651
10%     .4217484       .1624651       Obs               4,777
25%     .5692765       .1624651       Sum of Wgt.       4,777

50%     .6988442                      Mean           .6517603
                        Largest       Std. Dev.      .1513357
75%     .7642459       .8977526
90%     .8072906       .9004021       Variance       .0229025
95%     .8228533       .9004021       Skewness      -1.076219
99%     .8628422       .9004021       Kurtosis       3.653948

. sum loan18_2pr if in_2yr & ~anyFlag, d

                         loan18_2pr
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0661989       .0661989
 5%     .1169743       .0661989
10%     .1309483       .0661989       Obs               2,099
25%     .1439331       .0661989       Sum of Wgt.       2,099

50%     .1682893                      Mean           .1961232
                        Largest       Std. Dev.      .0730802
75%     .2385038          .5031
90%     .3209957          .5031       Variance       .0053407
95%     .3328551          .5031       Skewness       1.096422
99%     .4357571          .5031       Kurtosis       4.119726

. 
. 
. 
. generat loan18_4impPos = 3014.8787 + efc1_4yr*(478.3708) + efc2_4yr*(979.6938
> ) + efc3_4yr*(2668.3326) + efc4_4yr*(2678.5941) + efc5_4yr*(3209.4493) + efc6
> _4yr*(3810.4078) + efc7_4yr*(3343.4367) + efc8_4yr*(3324.6752) + efc9_4yr*(16
> 96.1917) + finc1_4yr*(-260.9732) + finc2_4yr*(-382.595) + finc3_4yr*(24.6798)
>  + finc4_4yr*(-778.0996) + finc5_4yr*(158.8361) + finc6_4yr*(-189.8691) + fin
> c7_4yr*(580.5521) + finc8_4yr*(2363.6766) + finc9_4yr*(1223.3394) + binsatm1*
> (-871.7511) + binsatm2*(-633.1251) + binsatm3*(-1646.5809) + binsatm4*(-615.5
> 127) + binsatm5*(-655.5934) + binsatm6*(-31.417) + binsatm7*(-1459.2514) + bi
> nsatm8*(-842.1835) + binsatm9*(-1891.2) + binsatv1*(1176.398) + binsatv2*(701
> .6157) + binsatv3*(217.8979) + binsatv4*(595.525) + binsatv5*(534.8639) + bin
> satv6*(364.2473) + binsatv7*(-365.7138) + binsatv8*(-1093.6581) + binsatv9*(-
> 1469.3204) + 2805.8850
(26,239 missing values generated)

. 
. * aggregate some 2yr bins since there were cell size issues
. replace efc1_2yr = inrange(efc,    1,  1328.9999999999999999999)
(0 real changes made)

. replace efc2_2yr = inrange(efc, 1329,  3001.9999999999999999999)
(0 real changes made)

. replace efc3_2yr = inrange(efc, 3002,  5334.9999999999999999999)
(0 real changes made)

. replace efc4_2yr = inrange(efc, 5335,  7913.9999999999999999999)
(0 real changes made)

. replace efc5_2yr = inrange(efc, 7914, 11480.9999999999999999999)
(0 real changes made)

. replace efc6_2yr = inrange(efc,11481, 15865.9999999999999999999)
(0 real changes made)

. replace efc7_2yr = inrange(efc,15866,                         .)
(6,080 real changes made)

. replace finc1_2yr = inrange(famIncAsTeenEFC, 27315, 38114.9999999999999999999
> 99)
(38,969 real changes made)

. replace finc2_2yr = inrange(famIncAsTeenEFC, 38115, 57202.9999999999999999999
> 99)
(49,229 real changes made)

. replace finc3_2yr = inrange(famIncAsTeenEFC, 57203, 68846.9999999999999999999
> 99)
(27,075 real changes made)

. replace finc4_2yr = inrange(famIncAsTeenEFC, 68847, 81644.9999999999999999999
> 99)
(24,187 real changes made)

. replace finc5_2yr = inrange(famIncAsTeenEFC, 81645, 98987.9999999999999999999
> 99)
(17,480 real changes made)

. replace finc6_2yr = inrange(famIncAsTeenEFC, 98988,                          
>  .)
(20,900 real changes made)

. generat loan18_2impPos = 1967.0377 + efc1_2yr*(-366.3647) + efc2_2yr*(-458.32
> 62) + efc3_2yr*(335.7275) + efc4_2yr*(-298.8623) + efc5_2yr*(684.4434) + efc6
> _2yr*(207.3959) + efc7_2yr*(1029.1805) +  finc1_2yr*(586.6354) + finc2_2yr*(2
> 35.9855) + finc3_2yr*(47.1963) + finc4_2yr*(750.4633) + finc5_2yr*(279.0236) 
> + finc6_2yr*(-698.8392) + 576.9154

. 
. 
. sum loan18_4impPos if in_4yr & ~anyFlag, d

                       loan18_4impPos
-------------------------------------------------------------
      Percentiles      Smallest
 1%     3178.964       2460.243
 5%     4350.476       2460.243
10%       4990.6       2460.243       Obs               4,777
25%     5889.254       2460.243       Sum of Wgt.       4,777

50%     7008.258                      Mean           7084.233
                        Largest       Std. Dev.      1650.505
75%     8283.945       12063.34
90%     9123.384       12063.34       Variance        2724166
95%     9684.685       12063.34       Skewness       .0234491
99%     11447.23       12063.34       Kurtosis       2.903671

. sum loan18_2impPos if in_2yr & ~anyFlag, d

                       loan18_2impPos
-------------------------------------------------------------
      Percentiles      Smallest
 1%      2052.51        2052.51
 5%     2177.588        2052.51
10%     2292.287        2052.51       Obs               2,099
25%     2481.076        2052.51       Sum of Wgt.       2,099

50%     2672.262                      Mean           2798.063
                        Largest       Std. Dev.      508.0476
75%     3030.373       4323.597
90%      3620.33       4323.597       Variance       258112.3
95%      3978.86       4323.597       Skewness       1.031329
99%     4323.597       4323.597       Kurtosis       3.467053

. 
. generat loan18_4imp = loan18_4impPos*loan18_4pr
(26,239 missing values generated)

. generat loan18_2imp = loan18_2impPos*loan18_2pr

. 
. sum loan18_4imp if in_4yr & ~anyFlag, d

                         loan18_4imp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     1227.328       1105.486
 5%      1997.63       1105.486
10%      2487.02       1105.486       Obs               4,777
25%     3495.302       1105.486       Sum of Wgt.       4,777

50%     4685.738                      Mean            4621.45
                        Largest       Std. Dev.      1521.909
75%     5776.055       8675.947
90%     6660.763       8675.947       Variance        2316206
95%     6952.532       8675.947       Skewness      -.1668054
99%     7637.994       8675.947       Kurtosis       2.408551

. sum loan18_2imp if in_2yr & ~anyFlag, d

                         loan18_2imp
-------------------------------------------------------------
      Percentiles      Smallest
 1%     255.0085       255.0085
 5%      288.576       255.0085
10%     346.2911       255.0085       Obs               2,099
25%      366.159       255.0085       Sum of Wgt.       2,099

50%     430.9275                      Mean           555.4472
                        Largest       Std. Dev.      260.5346
75%     634.8857       1581.861
90%     948.9731       1581.861       Variance       67878.28
95%     1037.065       1581.861       Skewness       1.426621
99%     1581.861       1581.861       Kurtosis       4.897515

. 
. *=================================================
. * Generate accumulated debt
. *=================================================
. gen accum_debt_in2yr = 0

. gen accum_debt_in4yr = 0

. gen accum_debt_nosch = 0

. 
. bys ID (year): replace accum_debt_in2yr = cum_2yr*loan18_2imp+cum_4yr*loan18_
> 4imp+in_2yr*loan18_2imp if ~anyFlag
(21,663 real changes made)

. bys ID (year): replace accum_debt_in4yr = cum_2yr*loan18_2imp+cum_4yr*loan18_
> 4imp+in_4yr*loan18_4imp if ~anyFlag
(21,908 real changes made)

. bys ID (year): replace accum_debt_nosch = cum_2yr*loan18_2imp+cum_4yr*loan18_
> 4imp                    if ~anyFlag
(20,937 real changes made)

. 
. sum accum_d* if in_2yr & cum_2yr==0 & cum_4yr==0 & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
accum_de~2yr |        726    542.3663    248.5602   255.0085   1581.861
accum_de~4yr |        726           0           0          0          0
accum_debt~h |        726           0           0          0          0

. sum accum_d* if in_4yr & cum_4yr==0 & cum_2yr==0 & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
accum_de~2yr |        971           0           0          0          0
accum_de~4yr |        971    4609.431    1525.026   1105.486   8675.947
accum_debt~h |        971           0           0          0          0

. sum accum_d* if ~in_2yr & ~in_4yr & cum_2yr==0 & cum_4yr==0 & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
accum_de~2yr |     11,191           0           0          0          0
accum_de~4yr |     11,191           0           0          0          0
accum_debt~h |     11,191           0           0          0          0

. 
. sum accum_d* if in_2yr & cum_2yr==1 & cum_4yr==0 & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
accum_de~2yr |        485    1091.781    505.4643    510.017   3163.722
accum_de~4yr |        485    545.8904    252.7321   255.0085   1581.861
accum_debt~h |        485    545.8904    252.7321   255.0085   1581.861

. sum accum_d* if in_4yr & cum_4yr==1 & cum_2yr==0 & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
accum_de~2yr |        824    4532.641    1551.312   1105.486   8675.947
accum_de~4yr |        824    9065.282    3102.625   2210.972   17351.89
accum_debt~h |        824    4532.641    1551.312   1105.486   8675.947

. sum accum_d* if ~in_2yr & ~in_4yr & cum_2yr==0 & cum_4yr==1 & ~anyFlag

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
accum_de~2yr |      1,118    4906.616    1353.342   1480.025   8070.161
accum_de~4yr |      1,118    4906.616    1353.342   1480.025   8070.161
accum_debt~h |      1,118    4906.616    1353.342   1480.025   8070.161

. 
. /*
> gen accum_debt_in2yr = 0
> gen accum_debt_in4yr = 0
> gen accum_debt_nosch = 0
> 
> bys ID (year): replace accum_debt_in2yr = sum(L.in_2yr*loan18_2imp+L.in_4yr*l
> oan18_4imp)+in_2yr*loan18_2imp if ~anyFlag
> bys ID (year): replace accum_debt_in4yr = sum(L.in_2yr*loan18_2imp+L.in_4yr*l
> oan18_4imp)+in_4yr*loan18_4imp if ~anyFlag
> bys ID (year): replace accum_debt_nosch = sum(L.in_2yr*loan18_2imp+L.in_4yr*l
> oan18_4imp)                    if ~anyFlag
> 
> sum accum_d* if in_2yr & cum_2yr==0 & cum_4yr==0 & ~anyFlag
> sum accum_d* if in_4yr & cum_4yr==0 & cum_2yr==0 & ~anyFlag
> sum accum_d* if ~in_2yr & ~in_4yr & cum_2yr==0 & cum_4yr==0 & ~anyFlag
> 
> sum accum_d* if in_2yr & cum_2yr==1 & cum_4yr==0 & ~anyFlag
> sum accum_d* if in_4yr & cum_4yr==1 & cum_2yr==0 & ~anyFlag
> sum accum_d* if ~in_2yr & ~in_4yr & cum_2yr==0 & cum_4yr==1 & ~anyFlag
> */
. 
. 
end of do-file

. 
. compress
  variable anyFlag was float now byte
  variable anyFlagFemale was float now byte
  variable race was float now byte
  variable lateHSFlag was float now int
  variable firstLateHSFlag was float now int
  variable repeaterFlag was float now int
  variable firstRepeaterFlag was float now int
  variable earlyGSFlag was float now int
  variable firstEarlyGSFlag was float now int
  variable ageGradHSA was float now byte
  variable ageGradHS was float now byte
  variable age was float now byte
  variable cum_2yr was float now byte
  variable cum_4yr was float now byte
  variable cum_college was float now byte
  variable cum_grad_school was float now byte
  variable prev_WC was float now byte
  variable prev_BC was float now byte
  variable prev_HS was float now byte
  variable prev_2yr was float now byte
  variable prev_4yr was float now byte
  variable prev_PT was float now byte
  variable prev_FT was float now byte
  variable prev_GS was float now byte
  variable lowercompOct was float now byte
  variable firstObs was float now byte
  variable m_wage was float now byte
  variable m_GPA was float now byte
  variable m_maj was float now byte
  variable sum_m_wage was float now byte
  variable sum_m_GPA was float now byte
  variable sum_m_maj was float now byte
  variable bad_wage was float now byte
  variable bad_grade was float now byte
  variable bad_major was float now byte
  variable esttime0 was float now byte
  variable father_educ was float now byte
  variable mother_educ was float now byte
  variable max_educ was float now byte
  variable mar_status was float now byte
  variable rel_par was float now byte
  variable married was float now byte
  variable prev_college was float now byte
  variable black_hsgrad was float now byte
  variable black_some_college was float now byte
  variable black_college was float now byte
  variable hispanic_hsgrad was float now byte
  variable hispanic_some_college was float now byte
  variable hispanic_college was float now byte
  variable other was float now byte
  variable other_hsgrad was float now byte
  variable other_some_college was float now byte
  variable other_college was float now byte
  variable HH_size_under_18_in_college was float now byte
  variable index was float now byte
  variable student_contr_assets was float now byte
  variable recParTrans was float now byte
  variable sumRecParTrans was float now byte
  variable everRecParTrans was float now byte
  variable infour was float now byte
  variable aged0 was float now byte
  variable aged1 was float now byte
  variable aged2 was float now byte
  variable aged3 was float now byte
  variable aged4 was float now byte
  variable aged5 was float now byte
  variable aged6 was float now byte
  variable aged7 was float now byte
  variable agesq was float now int
  variable binsatm1 was float now byte
  variable binsatm2 was float now byte
  variable binsatm3 was float now byte
  variable binsatm4 was float now byte
  variable binsatm5 was float now byte
  variable binsatm6 was float now byte
  variable binsatm7 was float now byte
  variable binsatm8 was float now byte
  variable binsatm9 was float now byte
  variable binsatv1 was float now byte
  variable binsatv2 was float now byte
  variable binsatv3 was float now byte
  variable binsatv4 was float now byte
  variable binsatv5 was float now byte
  variable binsatv6 was float now byte
  variable binsatv7 was float now byte
  variable binsatv8 was float now byte
  variable binsatv9 was float now byte
  variable efc1_4yr was float now byte
  variable efc2_4yr was float now byte
  variable efc3_4yr was float now byte
  variable efc4_4yr was float now byte
  variable efc5_4yr was float now byte
  variable efc6_4yr was float now byte
  variable efc7_4yr was float now byte
  variable efc8_4yr was float now byte
  variable efc9_4yr was float now byte
  variable efc1_2yr was float now byte
  variable efc2_2yr was float now byte
  variable efc3_2yr was float now byte
  variable efc4_2yr was float now byte
  variable efc5_2yr was float now byte
  variable efc6_2yr was float now byte
  variable efc7_2yr was float now byte
  variable efc8_2yr was float now byte
  variable finc1_4yr was float now byte
  variable finc2_4yr was float now byte
  variable finc3_4yr was float now byte
  variable finc4_4yr was float now byte
  variable finc5_4yr was float now byte
  variable finc6_4yr was float now byte
  variable finc7_4yr was float now byte
  variable finc8_4yr was float now byte
  variable finc9_4yr was float now byte
  variable finc1_2yr was float now byte
  variable finc2_2yr was float now byte
  variable finc3_2yr was float now byte
  variable finc4_2yr was float now byte
  variable finc5_2yr was float now byte
  variable finc6_2yr was float now byte
  variable finc7_2yr was float now byte
  variable finc8_2yr was float now byte
  variable finc9_2yr was float now byte
  (61,279,864 bytes saved)

. save ${clnloc}y97_all_tscrGPA.dta, replace
file ../../../data/nlsy97/cleaned/y97_all_tscrGPA.dta saved

. 
. log close
      name:  <unnamed>
       log:  /hpc/group/econ/tmr17/Dropout-R1/src/data-cleaning/nlsy97/y97_crea
> te_trim_tscrGPA.log
  log type:  text
 closed on:  13 Apr 2023, 13:03:15
-------------------------------------------------------------------------------
